
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>白皮书 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    以太共识群
            
                </a>
            

            
        </li>
    

    
        
        <li class="divider"></li>
        
        
    
        <li class="chapter " data-level="2.1" >
            
                <span>
            
                    
                    以太坊
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter active" data-level="2.1.1" data-path="eth1.html">
            
                <a href="eth1.html">
            
                    
                    白皮书
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    
        
        <li class="divider"></li>
        
        
    
        <li class="chapter " data-level="3.1" >
            
                <span>
            
                    
                    结约通证（ JYT ）
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="3.1.1" data-path="../jyt/jyt10.html">
            
                <a href="../jyt/jyt10.html">
            
                    
                    什么是 JYT ？
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.1.2" data-path="../jyt/jyt20.html">
            
                <a href="../jyt/jyt20.html">
            
                    
                    如何获取 JYT 分红？
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.1.3" data-path="../jyt/jyt30.html">
            
                <a href="../jyt/jyt30.html">
            
                    
                    如何把 JYT 兑换成 ETH ？
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.1.4" data-path="../jyt/jyt40.html">
            
                <a href="../jyt/jyt40.html">
            
                    
                    如何获得 JYT ？
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.1.5" data-path="../jyt/jyt50.html">
            
                <a href="../jyt/jyt50.html">
            
                    
                    JYT 的价格算法和机制
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >白皮书</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x767D;&#x76AE;&#x4E66;--&#x4EE5;&#x592A;&#x574A;-ethereum-&#x4E0B;&#x4E00;&#x4EE3;&#x667A;&#x80FD;&#x5408;&#x7EA6;&#x548C;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x5E94;&#x7528;&#x5E73;&#x53F0;">&#x767D;&#x76AE;&#x4E66; | &#x4EE5;&#x592A;&#x574A; (Ethereum ):&#x4E0B;&#x4E00;&#x4EE3;&#x667A;&#x80FD;&#x5408;&#x7EA6;&#x548C;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x5E94;&#x7528;&#x5E73;&#x53F0;</h1>
<p>&#x5F53;&#x4E2D;&#x672C;&#x806A;&#x5728;2009&#x5E74;1&#x6708;&#x542F;&#x52A8;&#x6BD4;&#x7279;&#x5E01;&#x533A;&#x5757;&#x94FE;&#x65F6;&#xFF0C;&#x4ED6;&#x540C;&#x65F6;&#x5411;&#x4E16;&#x754C;&#x5F15;&#x5165;&#x4E86;&#x4E24;&#x79CD;&#x672A;&#x7ECF;&#x6D4B;&#x8BD5;&#x7684;&#x9769;&#x547D;&#x6027;&#x7684;&#x65B0;&#x6982;&#x5FF5;&#x3002;&#x7B2C;&#x4E00;&#x79CD;&#x5C31;&#x662F;&#x6BD4;&#x7279;&#x5E01;&#xFF08;bitcoin&#xFF09;&#xFF0C;&#x4E00;&#x79CD;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x7684;&#x70B9;&#x5BF9;&#x70B9;&#x7684;&#x7F51;&#x4E0A;&#x8D27;&#x5E01;&#xFF0C;&#x5728;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x8D44;&#x4EA7;&#x62C5;&#x4FDD;&#x3001;&#x5185;&#x5728;&#x4EF7;&#x503C;&#x6216;&#x8005;&#x4E2D;&#x5FC3;&#x53D1;&#x884C;&#x8005;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x7EF4;&#x6301;&#x7740;&#x4EF7;&#x503C;&#x3002;&#x5230;&#x76EE;&#x524D;&#x4E3A;&#x6B62;&#xFF0C;&#x6BD4;&#x7279;&#x5E01;&#x5DF2;&#x7ECF;&#x5438;&#x5F15;&#x4E86;&#x5927;&#x91CF;&#x7684;&#x516C;&#x4F17;&#x6CE8;&#x610F;&#x529B;,  &#x5C31;&#x653F;&#x6CBB;&#x65B9;&#x9762;&#x800C;&#x8A00;&#xFF0C;&#x5B83;&#x662F;&#x4E00;&#x79CD;&#x6CA1;&#x6709;&#x4E2D;&#x592E;&#x94F6;&#x884C;&#x7684;&#x8D27;&#x5E01;&#xFF0C;&#x5E76;&#x4E14;&#x6709;&#x7740;&#x5267;&#x70C8;&#x7684;&#x4EF7;&#x683C;&#x6CE2;&#x52A8;&#x3002;</p>
<p>&#x7136;&#x800C;&#xFF0C;&#x4E2D;&#x672C;&#x806A;&#x7684;&#x4F1F;&#x5927;&#x8BD5;&#x9A8C;&#x8FD8;&#x6709;&#x4E0E;&#x6BD4;&#x7279;&#x5E01;&#x540C;&#x7B49;&#x91CD;&#x8981;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF1A;&#x57FA;&#x4E8E;&#x5DE5;&#x4F5C;&#x91CF;&#x8BC1;&#x660E;&#x7684;&#x533A;&#x5757;&#x94FE;&#x6982;&#x5FF5;&#x4F7F;&#x5F97;&#x4EBA;&#x4EEC;&#x53EF;&#x4EE5;&#x5C31;&#x4EA4;&#x6613;&#x987A;&#x5E8F;&#x8FBE;&#x6210;&#x5171;&#x8BC6;&#x3002;&#x4F5C;&#x4E3A;&#x5E94;&#x7528;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x53EF;&#x4EE5;&#x88AB;&#x63CF;&#x8FF0;&#x4E3A;&#x4E00;&#x4E2A;&#x5148;&#x7533;&#x8BF7;&#xFF08;first-to-file&#xFF09;&#x7CFB;&#x7EDF;&#xFF1A;&#x5982;&#x679C;&#x67D0;&#x4EBA;&#x6709;50BTC&#x5E76;&#x4E14;&#x540C;&#x65F6;&#x5411;A&#x548C;B&#x53D1;&#x9001;&#x8FD9;50BTC&#xFF0C;&#x53EA;&#x6709;&#x88AB;&#x9996;&#x5148;&#x786E;&#x8BA4;&#x7684;&#x4EA4;&#x6613;&#x624D;&#x4F1A;&#x751F;&#x6548;&#x3002;&#x6CA1;&#x6709;&#x56FA;&#x6709;&#x65B9;&#x6CD5;&#x53EF;&#x4EE5;&#x51B3;&#x5B9A;&#x4E24;&#x7B14;&#x4EA4;&#x6613;&#x54EA;&#x4E00;&#x7B14;&#x5148;&#x5230;&#xFF0C;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x963B;&#x788D;&#x4E86;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x6570;&#x5B57;&#x8D27;&#x5E01;&#x7684;&#x53D1;&#x5C55;&#x8BB8;&#x591A;&#x5E74;&#x3002;&#x4E2D;&#x672C;&#x806A;&#x7684;&#x533A;&#x5757;&#x94FE;&#x662F;&#x7B2C;&#x4E00;&#x4E2A;&#x53EF;&#x9760;&#x7684;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x89E3;&#x51B3;&#x529E;&#x6CD5;&#x3002;&#x73B0;&#x5728;&#xFF0C;&#x5F00;&#x53D1;&#x8005;&#x4EEC;&#x7684;&#x6CE8;&#x610F;&#x529B;&#x5F00;&#x59CB;&#x8FC5;&#x901F;&#x5730;&#x8F6C;&#x5411;&#x6BD4;&#x7279;&#x5E01;&#x6280;&#x672F;&#x7684;&#x7B2C;&#x4E8C;&#x90E8;&#x5206;&#xFF0C;&#x533A;&#x5757;&#x94FE;&#x600E;&#x6837;&#x5E94;&#x7528;&#x4E8E;&#x8D27;&#x5E01;&#x4EE5;&#x5916;&#x7684;&#x9886;&#x57DF;&#x3002;</p>
<p>&#x5E38;&#x88AB;&#x63D0;&#x53CA;&#x7684;&#x5E94;&#x7528;&#xFF0C;&#x5305;&#x62EC;&#x4F7F;&#x7528;&#x94FE;&#x4E0A;&#x6570;&#x5B57;&#x8D44;&#x4EA7;&#x6765;&#x4EE3;&#x8868;&#x5B9A;&#x5236;&#x8D27;&#x5E01;&#x548C;&#x91D1;&#x878D;&#x5DE5;&#x5177;&#xFF08;&#x5F69;&#x8272;&#x5E01;&#xFF09;&#xFF0C;&#x67D0;&#x79CD;&#x57FA;&#x7840;&#x7269;&#x7406;&#x8BBE;&#x5907;&#x7684;&#x6240;&#x6709;&#x6743;&#xFF08;&#x667A;&#x80FD;&#x8D44;&#x4EA7;&#xFF09;&#xFF0C;&#x5982;&#x57DF;&#x540D;&#x4E00;&#x6837;&#x7684;&#x6CA1;&#x6709;&#x53EF;&#x66FF;&#x4EE3;&#x6027;&#x7684;&#x8D44;&#x4EA7;&#xFF08;&#x57DF;&#x540D;&#x5E01;&#xFF09;&#x4EE5;&#x53CA;&#x5982;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x4EA4;&#x6613;&#x6240;&#xFF0C;&#x91D1;&#x878D;&#x884D;&#x751F;&#x54C1;&#xFF0C;&#x70B9;&#x5230;&#x70B9;&#x8D4C;&#x535A;&#x548C;&#x94FE;&#x4E0A;&#x8EAB;&#x4EFD;&#x548C;&#x4FE1;&#x8A89;&#x7CFB;&#x7EDF;&#x7B49;&#x66F4;&#x9AD8;&#x7EA7;&#x7684;&#x5E94;&#x7528;&#x3002;</p>
<p>&#x53E6;&#x4E00;&#x4E2A;&#x5E38;&#x88AB;&#x95EE;&#x8BE2;&#x7684;&#x91CD;&#x8981;&#x9886;&#x57DF;&#x662F;&#x201C;&#x667A;&#x80FD;&#x5408;&#x7EA6;&#x201D;-  &#x6839;&#x636E;&#x4E8B;&#x5148;&#x4EFB;&#x610F;&#x5236;&#x8BA2;&#x7684;&#x89C4;&#x5219;&#x6765;&#x81EA;&#x52A8;&#x8F6C;&#x79FB;&#x6570;&#x5B57;&#x8D44;&#x4EA7;&#x7684;&#x7CFB;&#x7EDF;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x4E00;&#x4E2A;&#x4EBA;&#x53EF;&#x80FD;&#x6709;&#x4E00;&#x4E2A;&#x5B58;&#x50A8;&#x5408;&#x7EA6;&#xFF0C;&#x5F62;&#x5F0F;&#x4E3A;&#x201C;A&#x53EF;&#x4EE5;&#x6BCF;&#x5929;&#x6700;&#x591A;&#x63D0;&#x73B0;X&#x4E2A;&#x5E01;&#xFF0C;B&#x6BCF;&#x5929;&#x6700;&#x591A;Y&#x4E2A;&#xFF0C;A&#x548C;B&#x4E00;&#x8D77;&#x53EF;&#x4EE5;&#x968F;&#x610F;&#x63D0;&#x53D6;&#xFF0C;A&#x53EF;&#x4EE5;&#x505C;&#x6389;B&#x7684;&#x63D0;&#x73B0;&#x6743;&#x201D;&#x3002;&#x8FD9;&#x79CD;&#x5408;&#x7EA6;&#x7684;&#x7B26;&#x5408;&#x903B;&#x8F91;&#x7684;&#x6269;&#x5C55;&#x5C31;&#x662F;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x81EA;&#x6CBB;&#x7EC4;&#x7EC7;&#xFF08;DAOs&#xFF09;-&#x957F;&#x671F;&#x7684;&#x5305;&#x542B;&#x4E00;&#x4E2A;&#x7EC4;&#x7EC7;&#x7684;&#x8D44;&#x4EA7;&#x5E76;&#x628A;&#x7EC4;&#x7EC7;&#x7684;&#x89C4;&#x5219;&#x7F16;&#x7801;&#x7684;&#x667A;&#x80FD;&#x5408;&#x7EA6;&#x3002;&#x4EE5;&#x592A;&#x574A;&#x7684;&#x76EE;&#x6807;&#x5C31;&#x662F;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x5E26;&#x6709;&#x5185;&#x7F6E;&#x7684;&#x6210;&#x719F;&#x7684;&#x56FE;&#x7075;&#x5B8C;&#x5907;&#x8BED;&#x8A00;&#x7684;&#x533A;&#x5757;&#x94FE;&#xFF0C;&#x7528;&#x8FD9;&#x79CD;&#x8BED;&#x8A00;&#x53EF;&#x4EE5;&#x521B;&#x5EFA;&#x5408;&#x7EA6;&#x6765;&#x7F16;&#x7801;&#x4EFB;&#x610F;&#x72B6;&#x6001;&#x8F6C;&#x6362;&#x529F;&#x80FD;&#xFF0C;&#x7528;&#x6237;&#x53EA;&#x8981;&#x7B80;&#x5355;&#x5730;&#x7528;&#x51E0;&#x884C;&#x4EE3;&#x7801;&#x6765;&#x5B9E;&#x73B0;&#x903B;&#x8F91;&#xFF0C;&#x5C31;&#x80FD;&#x591F;&#x521B;&#x5EFA;&#x4EE5;&#x4E0A;&#x63D0;&#x53CA;&#x7684;&#x6240;&#x6709;&#x7CFB;&#x7EDF;&#x4EE5;&#x53CA;&#x8BB8;&#x591A;&#x6211;&#x4EEC;&#x8FD8;&#x60F3;&#x8C61;&#x4E0D;&#x5230;&#x7684;&#x7684;&#x5176;&#x5B83;&#x7CFB;&#x7EDF;&#x3002;</p>
<h2 id="&#x76EE;&#x5F55;">&#x76EE;&#x5F55;</h2>
<ul>
<li>&#x5386;&#x53F2;<ul>
<li><a href="#&#x4F5C;&#x4E3A;&#x72B6;&#x6001;&#x8F6C;&#x6362;&#x7CFB;&#x7EDF;&#x7684;&#x6BD4;&#x7279;&#x5E01;">&#x4F5C;&#x4E3A;&#x72B6;&#x6001;&#x8F6C;&#x6362;&#x7CFB;&#x7EDF;&#x7684;&#x6BD4;&#x7279;&#x5E01;</a></li>
<li><a href="#&#x6316;&#x77FF;">&#x6316;&#x77FF;</a></li>
<li><a href="#&#x9ED8;&#x514B;&#x5C14;&#x6570;">&#x9ED8;&#x514B;&#x5C14;&#x6811;</a></li>
<li><a href="#&#x66FF;&#x4EE3;&#x533A;&#x5757;&#x94FE;&#x5E94;&#x7528;">&#x66FF;&#x4EE3;&#x533A;&#x5757;&#x94FE;&#x5E94;&#x7528;</a></li>
<li><a href="#&#x811A;&#x672C;">&#x811A;&#x672C;</a></li>
</ul>
</li>
<li>&#x4EE5;&#x592A;&#x574A;<ul>
<li><a href="#&#x4EE5;&#x592A;&#x574A;&#x8D26;&#x6237;">&#x4EE5;&#x592A;&#x574A;&#x8D26;&#x6237;</a></li>
<li><a href="#&#x6D88;&#x606F;&#x548C;&#x4EA4;&#x6613;">&#x6D88;&#x606F;&#x548C;&#x4EA4;&#x6613;</a></li>
<li><a href="#&#x4EE5;&#x592A;&#x574A;&#x72B6;&#x6001;&#x8F6C;&#x6362;&#x529F;&#x80FD;">&#x4EE5;&#x592A;&#x574A;&#x72B6;&#x6001;&#x8F6C;&#x6362;&#x529F;&#x80FD;</a></li>
<li><a href="#&#x4EE3;&#x7801;&#x6267;&#x884C;">&#x4EE3;&#x7801;&#x6267;&#x884C;</a></li>
<li><a href="#&#x533A;&#x5757;&#x94FE;&#x548C;&#x6316;&#x77FF;">&#x533A;&#x5757;&#x94FE;&#x548C;&#x6316;&#x77FF;</a></li>
</ul>
</li>
<li>&#x5E94;&#x7528;<ul>
<li><a href="#&#x4EE4;&#x724C;&#x7CFB;&#x7EDF;">&#x4EE4;&#x724C;&#x7CFB;&#x7EDF;</a></li>
<li><a href="#&#x91D1;&#x878D;&#x884D;&#x751F;&#x54C1;">&#x91D1;&#x878D;&#x884D;&#x751F;&#x54C1;</a></li>
<li><a href="#&#x8EAB;&#x4EFD;&#x548C;&#x4FE1;&#x8A89;&#x7CFB;&#x7EDF;">&#x8EAB;&#x4EFD;&#x548C;&#x4FE1;&#x8A89;&#x7CFB;&#x7EDF;</a></li>
<li><a href="#&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x6587;&#x4EF6;&#x5B58;&#x50A8;">&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x6587;&#x4EF6;&#x5B58;&#x50A8;</a></li>
<li><a href="#&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x81EA;&#x6CBB;&#x7EC4;&#x7EC7;">&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x81EA;&#x6CBB;&#x7EC4;&#x7EC7;</a></li>
<li><a href="#&#x8FDB;&#x4E00;&#x6B65;&#x7684;&#x5E94;&#x7528;">&#x8FDB;&#x4E00;&#x6B65;&#x7684;&#x5E94;&#x7528;</a></li>
</ul>
</li>
<li>&#x6742;&#x9879;&#x548C;&#x5173;&#x6CE8;<ul>
<li><a href="#&#x6539;&#x8FDB;&#x7248;&#x5E7D;&#x7075;&#x534F;&#x8BAE;&#x7684;&#x5B9E;&#x65BD;">&#x6539;&#x8FDB;&#x7248;&#x5E7D;&#x7075;&#x534F;&#x8BAE;&#x7684;&#x5B9E;&#x65BD;</a></li>
<li><a href="#&#x8D39;&#x7528;">&#x8D39;&#x7528;</a></li>
<li><a href="#&#x8BA1;&#x7B97;&#x548C;&#x56FE;&#x7075;&#x5B8C;&#x5907;">&#x8BA1;&#x7B97;&#x548C;&#x56FE;&#x7075;&#x5B8C;&#x5907;</a></li>
<li><a href="#&#x8D27;&#x5E01;&#x548C;&#x53D1;&#x884C;">&#x8D27;&#x5E01;&#x548C;&#x53D1;&#x884C;</a></li>
<li><a href="#&#x6316;&#x77FF;&#x7684;&#x4E2D;&#x5FC3;&#x5316;">&#x6316;&#x77FF;&#x7684;&#x4E2D;&#x5FC3;&#x5316;</a></li>
<li><a href="#&#x6269;&#x5C55;&#x6027;">&#x6269;&#x5C55;&#x6027;</a></li>
</ul>
</li>
<li><a href="#&#x7EFC;&#x8FF0;&#xFF1A;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x5E94;&#x7528;">&#x7EFC;&#x8FF0;&#xFF1A;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x5E94;&#x7528;</a></li>
<li><a href="#&#x7ED3;&#x8BBA;">&#x7ED3;&#x8BBA;</a></li>
<li><a href="#&#x6CE8;&#x89E3;&#x548C;&#x8FDB;&#x9636;&#x9605;&#x8BFB;">&#x6CE8;&#x89E3;&#x548C;&#x8FDB;&#x9636;&#x9605;&#x8BFB;</a></li>
</ul>
<hr>
<h2 id="&#x5386;&#x53F2;">&#x5386;&#x53F2;</h2>
<p>&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x7684;&#x6570;&#x5B57;&#x8D27;&#x5E01;&#x6982;&#x5FF5;&#xFF0C;&#x6B63;&#x5982;&#x8D22;&#x4EA7;&#x767B;&#x8BB0;&#x8FD9;&#x6837;&#x7684;&#x66FF;&#x4EE3;&#x5E94;&#x7528;&#x4E00;&#x6837;&#xFF0C;&#x65E9;&#x5728;&#x51E0;&#x5341;&#x5E74;&#x4EE5;&#x524D;&#x5C31;&#x88AB;&#x63D0;&#x51FA;&#x6765;&#x4E86;&#x3002;1980&#x548C;1990&#x5E74;&#x4EE3;&#x7684;&#x533F;&#x540D;&#x7535;&#x5B50;&#x73B0;&#x91D1;&#x534F;&#x8BAE;&#xFF0C;&#x5927;&#x90E8;&#x5206;&#x662F;&#x4EE5;&#x4E54;&#x59C6;&#x76F2;&#x7B7E;&#x6280;&#x672F;&#xFF08;Chaumian   blinding&#xFF09;&#x4E3A;&#x57FA;&#x7840;&#x7684;&#x3002;&#x8FD9;&#x4E9B;&#x7535;&#x5B50;&#x73B0;&#x91D1;&#x534F;&#x8BAE;&#x63D0;&#x4F9B;&#x5177;&#x6709;&#x9AD8;&#x5EA6;&#x9690;&#x79C1;&#x6027;&#x7684;&#x8D27;&#x5E01;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x4E9B;&#x534F;&#x8BAE;&#x90FD;&#x6CA1;&#x6709;&#x6D41;&#x884C;&#x8D77;&#x6765;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x90FD;&#x4F9D;&#x8D56;&#x4E8E;&#x4E00;&#x4E2A;&#x4E2D;&#x5FC3;&#x5316;&#x7684;&#x4E2D;&#x4ECB;&#x673A;&#x6784;&#x3002;1998&#x5E74;&#xFF0C;&#x6234;&#x4F1F;&#xFF08;Wei   Dai&#xFF09;&#x7684;b-money&#x9996;&#x6B21;&#x5F15;&#x5165;&#x4E86;&#x901A;&#x8FC7;&#x89E3;&#x51B3;&#x8BA1;&#x7B97;&#x96BE;&#x9898;&#x548C;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x5171;&#x8BC6;&#x521B;&#x9020;&#x8D27;&#x5E01;&#x7684;&#x601D;&#x60F3;&#xFF0C;&#x4F46;&#x662F;&#x8BE5;&#x5EFA;&#x8BAE;&#x5E76;&#x672A;&#x7ED9;&#x51FA;&#x5982;&#x4F55;&#x5B9E;&#x73B0;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x5171;&#x8BC6;&#x7684;&#x5177;&#x4F53;&#x65B9;&#x6CD5;&#x3002;2005&#x5E74;&#xFF0C;&#x82AC;&#x5C3C;&#xFF08;Hal  Finney&#xFF09;&#x5F15;&#x5165;&#x4E86;&#x201C;&#x53EF;&#x91CD;&#x590D;&#x4F7F;&#x7528;&#x7684;&#x5DE5;&#x4F5C;&#x91CF;&#x8BC1;&#x660E;&#x673A;&#x5236;&#x201D;&#xFF08;reusable proofs of  work&#xFF09;&#x6982;&#x5FF5;&#xFF0C;&#x5B83;&#x540C;&#x65F6;&#x4F7F;&#x7528;b-money&#x7684;&#x601D;&#x60F3;&#x548C;Adam  Back&#x63D0;&#x51FA;&#x7684;&#x8BA1;&#x7B97;&#x56F0;&#x96BE;&#x7684;&#x54C8;&#x5E0C;&#x73B0;&#x91D1;&#xFF08;Hashcash&#xFF09;&#x96BE;&#x9898;&#x6765;&#x521B;&#x9020;&#x5BC6;&#x7801;&#x5B66;&#x8D27;&#x5E01;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x8FD9;&#x79CD;&#x6982;&#x5FF5;&#x518D;&#x6B21;&#x8FF7;&#x5931;&#x4E8E;&#x7406;&#x60F3;&#x5316;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4F9D;&#x8D56;&#x4E8E;&#x53EF;&#x4FE1;&#x4EFB;&#x7684;&#x8BA1;&#x7B97;&#x4F5C;&#x4E3A;&#x540E;&#x7AEF;&#x3002;</p>
<p>&#x56E0;&#x4E3A;&#x8D27;&#x5E01;&#x662F;&#x4E00;&#x4E2A;&#x5148;&#x7533;&#x8BF7;&#x5E94;&#x7528;&#xFF0C;&#x4EA4;&#x6613;&#x7684;&#x987A;&#x5E8F;&#x81F3;&#x5173;&#x91CD;&#x8981;&#xFF0C;&#x6240;&#x4EE5;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x7684;&#x8D27;&#x5E01;&#x9700;&#x8981;&#x627E;&#x5230;&#x5B9E;&#x73B0;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x5171;&#x8BC6;&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x6BD4;&#x7279;&#x5E01;&#x4EE5;&#x524D;&#x7684;&#x6240;&#x6709;&#x7535;&#x5B50;&#x8D27;&#x5E01;&#x534F;&#x8BAE;&#x6240;&#x9047;&#x5230;&#x7684;&#x4E3B;&#x8981;&#x969C;&#x788D;&#x662F;&#xFF0C;&#x5C3D;&#x7BA1;&#x5BF9;&#x5982;&#x4F55;&#x521B;&#x5EFA;&#x5B89;&#x5168;&#x7684;&#x62DC;&#x5360;&#x5EAD;&#x95EE;&#x9898;&#x5BB9;&#x9519;&#xFF08;Byzantine-fault-tolerant&#xFF09;&#x591A;&#x65B9;&#x5171;&#x8BC6;&#x7CFB;&#x7EDF;&#x7684;&#x7814;&#x7A76;&#x5DF2;&#x7ECF;&#x5386;&#x65F6;&#x591A;&#x5E74;&#xFF0C;&#x4F46;&#x662F;&#x4E0A;&#x8FF0;&#x534F;&#x8BAE;&#x53EA;&#x89E3;&#x51B3;&#x4E86;&#x95EE;&#x9898;&#x7684;&#x4E00;&#x534A;&#x3002;&#x8FD9;&#x4E9B;&#x534F;&#x8BAE;&#x5047;&#x8BBE;&#x7CFB;&#x7EDF;&#x7684;&#x6240;&#x6709;&#x53C2;&#x4E0E;&#x8005;&#x662F;&#x5DF2;&#x77E5;&#x7684;&#xFF0C;&#x5E76;&#x4EA7;&#x751F;&#x5982;&#x201C;&#x5982;&#x679C;&#x6709;N&#x65B9;&#x53C2;&#x4E0E;&#x5230;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x90A3;&#x4E48;&#x7CFB;&#x7EDF;&#x53EF;&#x4EE5;&#x5BB9;&#x5FCD;N/4&#x7684;&#x6076;&#x610F;&#x53C2;&#x4E0E;&#x8005;&#x201D;&#x8FD9;&#x6837;&#x5F62;&#x5F0F;&#x7684;&#x5B89;&#x5168;&#x8FB9;&#x754C;&#x3002;&#x7136;&#x800C;&#x8FD9;&#x4E2A;&#x5047;&#x8BBE;&#x7684;&#x95EE;&#x9898;&#x5728;&#x4E8E;&#xFF0C;&#x5728;&#x533F;&#x540D;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x7CFB;&#x7EDF;&#x8BBE;&#x7F6E;&#x7684;&#x5B89;&#x5168;&#x8FB9;&#x754C;&#x5BB9;&#x6613;&#x906D;&#x53D7;&#x5973;&#x5DEB;&#x653B;&#x51FB;&#xFF0C;&#x56E0;&#x4E3A;&#x4E00;&#x4E2A;&#x653B;&#x51FB;&#x8005;&#x53EF;&#x4EE5;&#x5728;&#x4E00;&#x53F0;&#x670D;&#x52A1;&#x5668;&#x6216;&#x8005;&#x50F5;&#x5C38;&#x7F51;&#x7EDC;&#x4E0A;&#x521B;&#x5EFA;&#x6570;&#x4EE5;&#x5343;&#x8BA1;&#x7684;&#x8282;&#x70B9;&#xFF0C;&#x4ECE;&#x800C;&#x5355;&#x65B9;&#x9762;&#x786E;&#x4FDD;&#x62E5;&#x6709;&#x591A;&#x6570;&#x4EFD;&#x989D;&#x3002;</p>
<p>&#x4E2D;&#x672C;&#x806A;&#x7684;&#x521B;&#x65B0;&#x662F;&#x5F15;&#x5165;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x7406;&#x5FF5;&#xFF1A;&#x5C06;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x7B80;&#x5355;&#x7684;&#x57FA;&#x4E8E;&#x8282;&#x70B9;&#x7684;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x5171;&#x8BC6;&#x534F;&#x8BAE;&#x4E0E;&#x5DE5;&#x4F5C;&#x91CF;&#x8BC1;&#x660E;&#x673A;&#x5236;&#x7ED3;&#x5408;&#x5728;&#x4E00;&#x8D77;&#x3002;&#x8282;&#x70B9;&#x901A;&#x8FC7;&#x5DE5;&#x4F5C;&#x91CF;&#x8BC1;&#x660E;&#x673A;&#x5236;&#x83B7;&#x5F97;&#x53C2;&#x4E0E;&#x5230;&#x7CFB;&#x7EDF;&#x7684;&#x6743;&#x5229;&#xFF0C;&#x6BCF;&#x5341;&#x5206;&#x949F;&#x5C06;&#x4EA4;&#x6613;&#x6253;&#x5305;&#x5230;&#x201C;&#x533A;&#x5757;&#x201D;&#x4E2D;&#xFF0C;&#x4ECE;&#x800C;&#x521B;&#x5EFA;&#x51FA;&#x4E0D;&#x65AD;&#x589E;&#x957F;&#x7684;&#x533A;&#x5757;&#x94FE;&#x3002;&#x62E5;&#x6709;&#x5927;&#x91CF;&#x7B97;&#x529B;&#x7684;&#x8282;&#x70B9;&#x6709;&#x66F4;&#x5927;&#x7684;&#x5F71;&#x54CD;&#x529B;&#xFF0C;&#x4F46;&#x83B7;&#x5F97;&#x6BD4;&#x6574;&#x4E2A;&#x7F51;&#x7EDC;&#x66F4;&#x591A;&#x7684;&#x7B97;&#x529B;&#x6BD4;&#x521B;&#x5EFA;&#x4E00;&#x767E;&#x4E07;&#x4E2A;&#x8282;&#x70B9;&#x56F0;&#x96BE;&#x5F97;&#x591A;&#x3002;&#x5C3D;&#x7BA1;&#x6BD4;&#x7279;&#x5E01;&#x533A;&#x5757;&#x94FE;&#x6A21;&#x578B;&#x975E;&#x5E38;&#x7B80;&#x964B;&#xFF0C;&#x4F46;&#x662F;&#x5B9E;&#x8DF5;&#x8BC1;&#x660E;&#x5B83;&#x5DF2;&#x7ECF;&#x8DB3;&#x591F;&#x597D;&#x7528;&#x4E86;&#xFF0C;&#x5728;&#x672A;&#x6765;&#x4E94;&#x5E74;&#xFF0C;&#x5B83;&#x5C06;&#x6210;&#x4E3A;&#x5168;&#x4E16;&#x754C;&#x4E24;&#x767E;&#x4E2A;&#x4EE5;&#x4E0A;&#x7684;&#x8D27;&#x5E01;&#x548C;&#x534F;&#x8BAE;&#x7684;&#x57FA;&#x77F3;&#x3002;</p>
<h3 id="&#x4F5C;&#x4E3A;&#x72B6;&#x6001;&#x8F6C;&#x6362;&#x7CFB;&#x7EDF;&#x7684;&#x6BD4;&#x7279;&#x5E01;">&#x4F5C;&#x4E3A;&#x72B6;&#x6001;&#x8F6C;&#x6362;&#x7CFB;&#x7EDF;&#x7684;&#x6BD4;&#x7279;&#x5E01;</h3>
<p><img src="eth1/1.jpg" alt="img"></p>
<p>&#x4ECE;&#x6280;&#x672F;&#x89D2;&#x5EA6;&#x8BB2;&#xFF0C;&#x6BD4;&#x7279;&#x5E01;&#x8D26;&#x672C;&#x53EF;&#x4EE5;&#x88AB;&#x8BA4;&#x4E3A;&#x662F;&#x4E00;&#x4E2A;&#x72B6;&#x6001;&#x8F6C;&#x6362;&#x7CFB;&#x7EDF;&#xFF0C;&#x8BE5;&#x7CFB;&#x7EDF;&#x5305;&#x62EC;&#x6240;&#x6709;&#x73B0;&#x5B58;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x6240;&#x6709;&#x6743;&#x72B6;&#x6001;&#x548C;&#x201C;&#x72B6;&#x6001;&#x8F6C;&#x6362;&#x51FD;&#x6570;&#x201D;&#x3002;&#x72B6;&#x6001;&#x8F6C;&#x6362;&#x51FD;&#x6570;&#x4EE5;&#x5F53;&#x524D;&#x72B6;&#x6001;&#x548C;&#x4EA4;&#x6613;&#x4E3A;&#x8F93;&#x5165;&#xFF0C;&#x8F93;&#x51FA;&#x65B0;&#x7684;&#x72B6;&#x6001;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5728;&#x6807;&#x51C6;&#x7684;&#x94F6;&#x884C;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x72B6;&#x6001;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x8D44;&#x4EA7;&#x8D1F;&#x503A;&#x8868;&#xFF0C;&#x4E00;&#x4E2A;&#x4ECE;A&#x8D26;&#x6237;&#x5411;B&#x8D26;&#x6237;&#x8F6C;&#x8D26;X&#x7F8E;&#x5143;&#x7684;&#x8BF7;&#x6C42;&#x662F;&#x4E00;&#x7B14;&#x4EA4;&#x6613;&#xFF0C;&#x72B6;&#x6001;&#x8F6C;&#x6362;&#x51FD;&#x6570;&#x5C06;&#x4ECE;A&#x8D26;&#x6237;&#x4E2D;&#x51CF;&#x53BB;X&#x7F8E;&#x5143;&#xFF0C;&#x5411;B&#x8D26;&#x6237;&#x589E;&#x52A0;X&#x7F8E;&#x5143;&#x3002;&#x5982;&#x679C;A&#x8D26;&#x6237;&#x7684;&#x4F59;&#x989D;&#x5C0F;&#x4E8E;X&#x7F8E;&#x5143;&#xFF0C;&#x72B6;&#x6001;&#x8F6C;&#x6362;&#x51FD;&#x6570;&#x5C31;&#x4F1A;&#x8FD4;&#x56DE;&#x9519;&#x8BEF;&#x63D0;&#x793A;&#x3002;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5982;&#x4E0B;&#x5B9A;&#x4E49;&#x72B6;&#x6001;&#x8F6C;&#x6362;&#x51FD;&#x6570;&#xFF1A;</p>
<pre><code>APPLY(S,TX) &#xAD;&gt; S&#x2019; or ERROR
</code></pre><p>&#x5728;&#x4E0A;&#x9762;&#x63D0;&#x5230;&#x7684;&#x94F6;&#x884C;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x72B6;&#x6001;&#x8F6C;&#x6362;&#x51FD;&#x6570;&#x5982;&#x4E0B;&#xFF1A;</p>
<pre><code>APPLY({ Alice: $50, Bob: $50 },&#x201D;send $20 from Alice to Bob&#x201D;) = { Alice: $30,Bob: $70 }
</code></pre><p>&#x4F46;&#x662F;&#xFF1A;</p>
<pre><code>APPLY({ Alice: $50, Bob: $50 },&#x201D;send $70 from Alice to Bob&#x201D;) = ERROR
</code></pre><p>&#x6BD4;&#x7279;&#x5E01;&#x7CFB;&#x7EDF;&#x7684;&#x201C;&#x72B6;&#x6001;&#x201D;&#x662F;&#x6240;&#x6709;&#x5DF2;&#x7ECF;&#x88AB;&#x6316;&#x51FA;&#x7684;&#x3001;&#x6CA1;&#x6709;&#x82B1;&#x8D39;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#xFF08;&#x6280;&#x672F;&#x4E0A;&#x79F0;&#x4E3A;&#x201C;&#x672A;&#x82B1;&#x8D39;&#x7684;&#x4EA4;&#x6613;&#x8F93;&#x51FA;&#xFF0C;unspent transaction  outputs  &#x6216;UTXO&#x201D;&#xFF09;&#x7684;&#x96C6;&#x5408;&#x3002;&#x6BCF;&#x4E2A;UTXO&#x90FD;&#x6709;&#x4E00;&#x4E2A;&#x9762;&#x503C;&#x548C;&#x6240;&#x6709;&#x8005;&#xFF08;&#x7531;20&#x4E2A;&#x5B57;&#x8282;&#x7684;&#x672C;&#x8D28;&#x4E0A;&#x662F;&#x5BC6;&#x7801;&#x5B66;&#x516C;&#x94A5;&#x7684;&#x5730;&#x5740;&#x6240;&#x5B9A;&#x4E49;[1]&#xFF09;&#x3002;&#x4E00;&#x7B14;&#x4EA4;&#x6613;&#x5305;&#x62EC;&#x4E00;&#x4E2A;&#x6216;&#x591A;&#x4E2A;&#x8F93;&#x5165;&#x548C;&#x4E00;&#x4E2A;&#x6216;&#x591A;&#x4E2A;&#x8F93;&#x51FA;&#x3002;&#x6BCF;&#x4E2A;&#x8F93;&#x5165;&#x5305;&#x542B;&#x4E00;&#x4E2A;&#x5BF9;&#x73B0;&#x6709;UTXO&#x7684;&#x5F15;&#x7528;&#x548C;&#x7531;&#x4E0E;&#x6240;&#x6709;&#x8005;&#x5730;&#x5740;&#x76F8;&#x5BF9;&#x5E94;&#x7684;&#x79C1;&#x94A5;&#x521B;&#x5EFA;&#x7684;&#x5BC6;&#x7801;&#x5B66;&#x7B7E;&#x540D;&#x3002;&#x6BCF;&#x4E2A;&#x8F93;&#x51FA;&#x5305;&#x542B;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x52A0;&#x5165;&#x5230;&#x72B6;&#x6001;&#x4E2D;&#x7684;UTXO&#x3002;</p>
<p>&#x5728;&#x6BD4;&#x7279;&#x5E01;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x72B6;&#x6001;&#x8F6C;&#x6362;&#x51FD;&#x6570;APPLY(S,TX)-&gt;S&#x2019;&#x5927;&#x4F53;&#x4E0A;&#x53EF;&#x4EE5;&#x5982;&#x4E0B;&#x5B9A;&#x4E49;&#xFF1A;</p>
<ol>
<li>&#x4EA4;&#x6613;&#x7684;&#x6BCF;&#x4E2A;&#x8F93;&#x5165;&#xFF1A;</li>
</ol>
<p>- &#x5982;&#x679C;&#x5F15;&#x7528;&#x7684;UTXO&#x4E0D;&#x5B58;&#x5728;&#x4E8E;&#x73B0;&#x5728;&#x7684;&#x72B6;&#x6001;&#x4E2D;&#xFF08;S&#xFF09;&#xFF0C;&#x8FD4;&#x56DE;&#x9519;&#x8BEF;&#x63D0;&#x793A;
&#x200B;     - &#x5982;&#x679C;&#x7B7E;&#x540D;&#x4E0E;UTXO&#x6240;&#x6709;&#x8005;&#x7684;&#x7B7E;&#x540D;&#x4E0D;&#x4E00;&#x81F4;&#xFF0C;&#x8FD4;&#x56DE;&#x9519;&#x8BEF;&#x63D0;&#x793A;</p>
<ol>
<li>&#x5982;&#x679C;&#x6240;&#x6709;&#x7684;UTXO&#x8F93;&#x5165;&#x9762;&#x503C;&#x603B;&#x989D;&#x5C0F;&#x4E8E;&#x6240;&#x6709;&#x7684;UTXO&#x8F93;&#x51FA;&#x9762;&#x503C;&#x603B;&#x989D;&#xFF0C;&#x8FD4;&#x56DE;&#x9519;&#x8BEF;&#x63D0;&#x793A;</li>
<li>&#x8FD4;&#x56DE;&#x65B0;&#x72B6;&#x6001;S&#x2019;,&#x65B0;&#x72B6;&#x6001;S&#x2019;&#x4E2D;&#x79FB;&#x9664;&#x4E86;&#x6240;&#x6709;&#x7684;&#x8F93;&#x5165;UTXO&#xFF0C;&#x589E;&#x52A0;&#x4E86;&#x6240;&#x6709;&#x7684;&#x8F93;&#x51FA;UTXO&#x3002;</li>
</ol>
<p>&#x7B2C;&#x4E00;&#x6B65;&#x7684;&#x7B2C;&#x4E00;&#x90E8;&#x5206;&#x9632;&#x6B62;&#x4EA4;&#x6613;&#x7684;&#x53D1;&#x9001;&#x8005;&#x82B1;&#x8D39;&#x4E0D;&#x5B58;&#x5728;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#xFF0C;&#x7B2C;&#x4E8C;&#x90E8;&#x5206;&#x9632;&#x6B62;&#x4EA4;&#x6613;&#x7684;&#x53D1;&#x9001;&#x8005;&#x82B1;&#x8D39;&#x5176;&#x4ED6;&#x4EBA;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x3002;&#x7B2C;&#x4E8C;&#x6B65;&#x786E;&#x4FDD;&#x4EF7;&#x503C;&#x5B88;&#x6052;&#x3002;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x652F;&#x4ED8;&#x534F;&#x8BAE;&#x5982;&#x4E0B;&#x3002;&#x5047;&#x8BBE;Alice&#x60F3;&#x7ED9;Bob&#x53D1;&#x9001;11.7BTC&#x3002;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;Alice&#x4E0D;&#x53EF;&#x80FD;&#x6B63;&#x597D;&#x6709;11.7BTC&#x3002;&#x5047;&#x8BBE;&#xFF0C;&#x5979;&#x80FD;&#x5F97;&#x5230;&#x7684;&#x6700;&#x5C0F;&#x6570;&#x989D;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x65B9;&#x5F0F;&#x662F;&#xFF1A;6+4+2=12&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x5979;&#x53EF;&#x4EE5;&#x521B;&#x5EFA;&#x4E00;&#x7B14;&#x6709;3&#x4E2A;&#x8F93;&#x5165;&#xFF0C;2&#x4E2A;&#x8F93;&#x51FA;&#x7684;&#x4EA4;&#x6613;&#x3002;&#x7B2C;&#x4E00;&#x4E2A;&#x8F93;&#x51FA;&#x7684;&#x9762;&#x503C;&#x662F;11.7BTC&#xFF0C;&#x6240;&#x6709;&#x8005;&#x662F;Bob&#xFF08;Bob&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#xFF09;&#xFF0C;&#x7B2C;&#x4E8C;&#x4E2A;&#x8F93;&#x51FA;&#x7684;&#x9762;&#x503C;&#x662F;0.3BTC&#xFF0C;&#x6240;&#x6709;&#x8005;&#x662F;Alice&#x81EA;&#x5DF1;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x627E;&#x96F6;&#x3002;</p>
<h3 id="&#x6316;&#x77FF;">&#x6316;&#x77FF;</h3>
<p><img src="2.jpg" alt="img"></p>
<p>&#x5982;&#x679C;&#x6211;&#x4EEC;&#x62E5;&#x6709;&#x53EF;&#x4FE1;&#x4EFB;&#x7684;&#x4E2D;&#x5FC3;&#x5316;&#x670D;&#x52A1;&#x673A;&#x6784;&#xFF0C;&#x72B6;&#x6001;&#x8F6C;&#x6362;&#x7CFB;&#x7EDF;&#x53EF;&#x4EE5;&#x5F88;&#x5BB9;&#x6613;&#x5730;&#x5B9E;&#x73B0;&#xFF0C;&#x53EF;&#x4EE5;&#x7B80;&#x5355;&#x5730;&#x5C06;&#x4E0A;&#x8FF0;&#x529F;&#x80FD;&#x51C6;&#x786E;&#x7F16;&#x7801;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x6211;&#x4EEC;&#x60F3;&#x628A;&#x6BD4;&#x7279;&#x5E01;&#x7CFB;&#x7EDF;&#x5EFA;&#x6210;&#x4E3A;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x7684;&#x8D27;&#x5E01;&#x7CFB;&#x7EDF;&#xFF0C;&#x4E3A;&#x4E86;&#x786E;&#x4FDD;&#x6BCF;&#x4E2A;&#x4EBA;&#x90FD;&#x540C;&#x610F;&#x4EA4;&#x6613;&#x7684;&#x987A;&#x5E8F;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5C06;&#x72B6;&#x6001;&#x8F6C;&#x6362;&#x7CFB;&#x7EDF;&#x4E0E;&#x4E00;&#x4E2A;&#x5171;&#x8BC6;&#x7CFB;&#x7EDF;&#x7ED3;&#x5408;&#x8D77;&#x6765;&#x3002;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x5171;&#x8BC6;&#x8FDB;&#x7A0B;&#x8981;&#x6C42;&#x7F51;&#x7EDC;&#x4E2D;&#x7684;&#x8282;&#x70B9;&#x4E0D;&#x65AD;&#x5C1D;&#x8BD5;&#x5C06;&#x4EA4;&#x6613;&#x6253;&#x5305;&#x6210;&#x201C;&#x533A;&#x5757;&#x201D;&#x3002;&#x7F51;&#x7EDC;&#x88AB;&#x8BBE;&#x8BA1;&#x4E3A;&#x5927;&#x7EA6;&#x6BCF;&#x5341;&#x5206;&#x949F;&#x4EA7;&#x751F;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#xFF0C;&#x6BCF;&#x4E2A;&#x533A;&#x5757;&#x5305;&#x542B;&#x4E00;&#x4E2A;&#x65F6;&#x95F4;&#x6233;&#x3001;&#x4E00;&#x4E2A;&#x968F;&#x673A;&#x6570;&#x3001;&#x4E00;&#x4E2A;&#x5BF9;&#x4E0A;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#x7684;&#x5F15;&#x7528;&#xFF08;&#x5373;&#x54C8;&#x5E0C;&#xFF09;&#x548C;&#x4E0A;&#x4E00;&#x533A;&#x5757;&#x751F;&#x6210;&#x4EE5;&#x6765;&#x53D1;&#x751F;&#x7684;&#x6240;&#x6709;&#x4EA4;&#x6613;&#x5217;&#x8868;&#x3002;&#x8FD9;&#x6837;&#x968F;&#x7740;&#x65F6;&#x95F4;&#x6D41;&#x901D;&#x5C31;&#x521B;&#x5EFA;&#x51FA;&#x4E86;&#x4E00;&#x4E2A;&#x6301;&#x7EED;&#x589E;&#x957F;&#x7684;&#x533A;&#x5757;&#x94FE;&#xFF0C;&#x5B83;&#x4E0D;&#x65AD;&#x5730;&#x66F4;&#x65B0;&#xFF0C;&#x4ECE;&#x800C;&#x80FD;&#x591F;&#x4EE3;&#x8868;&#x6BD4;&#x7279;&#x5E01;&#x8D26;&#x672C;&#x7684;&#x6700;&#x65B0;&#x72B6;&#x6001;&#x3002;</p>
<p>&#x4F9D;&#x7167;&#x8FD9;&#x4E2A;&#x8303;&#x5F0F;&#xFF0C;&#x68C0;&#x67E5;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#x662F;&#x5426;&#x6709;&#x6548;&#x7684;&#x7B97;&#x6CD5;&#x5982;&#x4E0B;&#xFF1A;</p>
<ol>
<li>&#x68C0;&#x67E5;&#x533A;&#x5757;&#x5F15;&#x7528;&#x7684;&#x4E0A;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#x662F;&#x5426;&#x5B58;&#x5728;&#x4E14;&#x6709;&#x6548;&#x3002;</li>
<li>&#x68C0;&#x67E5;&#x533A;&#x5757;&#x7684;&#x65F6;&#x95F4;&#x6233;&#x662F;&#x5426;&#x665A;&#x4E8E;&#x4EE5;&#x524D;&#x7684;&#x533A;&#x5757;&#x7684;&#x65F6;&#x95F4;&#x6233;&#xFF0C;&#x800C;&#x4E14;&#x65E9;&#x4E8E;&#x672A;&#x6765;2&#x5C0F;&#x65F6;[2]&#x3002;</li>
<li>&#x68C0;&#x67E5;&#x533A;&#x5757;&#x7684;&#x5DE5;&#x4F5C;&#x91CF;&#x8BC1;&#x660E;&#x662F;&#x5426;&#x6709;&#x6548;&#x3002;</li>
<li>&#x5C06;&#x4E0A;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#x7684;&#x6700;&#x7EC8;&#x72B6;&#x6001;&#x8D4B;&#x4E8E;S[0]&#x3002;</li>
<li>&#x5047;&#x8BBE;TX&#x662F;&#x533A;&#x5757;&#x7684;&#x4EA4;&#x6613;&#x5217;&#x8868;&#xFF0C;&#x5305;&#x542B;n&#x7B14;&#x4EA4;&#x6613;&#x3002;&#x5BF9;&#x4E8E;&#x5C5E;&#x4E8E;0&#x2026;&#x2026;n-1&#x7684;&#x6240;&#x6709;i,&#x8FDB;&#x884C;&#x72B6;&#x6001;&#x8F6C;&#x6362;S[i+1] = APPLY(S[i],TX[i])&#x3002;&#x5982;&#x679C;&#x4EFB;&#x4F55;&#x4E00;&#x7B14;&#x4EA4;&#x6613;i&#x5728;&#x72B6;&#x6001;&#x8F6C;&#x6362;&#x4E2D;&#x51FA;&#x9519;&#xFF0C;&#x9000;&#x51FA;&#x7A0B;&#x5E8F;&#xFF0C;&#x8FD4;&#x56DE;&#x9519;&#x8BEF;&#x3002;</li>
<li>&#x8FD4;&#x56DE;&#x6B63;&#x786E;&#xFF0C;&#x72B6;&#x6001;S[n]&#x662F;&#x8FD9;&#x4E00;&#x533A;&#x5757;&#x7684;&#x6700;&#x7EC8;&#x72B6;&#x6001;&#x3002;</li>
</ol>
<p>&#x672C;&#x8D28;&#x4E0A;&#xFF0C;&#x533A;&#x5757;&#x4E2D;&#x7684;&#x6BCF;&#x7B14;&#x4EA4;&#x6613;&#x5FC5;&#x987B;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x6B63;&#x786E;&#x7684;&#x72B6;&#x6001;&#x8F6C;&#x6362;&#xFF0C;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;&#x201C;&#x72B6;&#x6001;&#x201D;&#x5E76;&#x4E0D;&#x662F;&#x7F16;&#x7801;&#x5230;&#x533A;&#x5757;&#x7684;&#x3002;&#x5B83;&#x7EAF;&#x7CB9;&#x53EA;&#x662F;&#x88AB;&#x6821;&#x9A8C;&#x8282;&#x70B9;&#x8BB0;&#x4F4F;&#x7684;&#x62BD;&#x8C61;&#x6982;&#x5FF5;&#xFF0C;&#x5BF9;&#x4E8E;&#x4EFB;&#x610F;&#x533A;&#x5757;&#x90FD;&#x53EF;&#x4EE5;&#x4ECE;&#x521B;&#x4E16;&#x72B6;&#x6001;&#x5F00;&#x59CB;&#xFF0C;&#x6309;&#x987A;&#x5E8F;&#x52A0;&#x4E0A;&#x6BCF;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#x7684;&#x6BCF;&#x4E00;&#x7B14;&#x4EA4;&#x6613;&#xFF0C;&#xFF08;&#x59A5;&#x59A5;&#x5730;&#xFF09;&#x8BA1;&#x7B97;&#x51FA;&#x5F53;&#x524D;&#x7684;&#x72B6;&#x6001;&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x9700;&#x8981;&#x6CE8;&#x610F;&#x77FF;&#x5DE5;&#x5C06;&#x4EA4;&#x6613;&#x6536;&#x5F55;&#x8FDB;&#x533A;&#x5757;&#x7684;&#x987A;&#x5E8F;&#x3002;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#x4E2D;&#x6709;A&#x3001;B&#x4E24;&#x7B14;&#x4EA4;&#x6613;&#xFF0C;B&#x82B1;&#x8D39;&#x7684;&#x662F;A&#x521B;&#x5EFA;&#x7684;UTXO&#xFF0C;&#x5982;&#x679C;A&#x5728;B&#x4EE5;&#x524D;&#xFF0C;&#x8FD9;&#x4E2A;&#x533A;&#x5757;&#x662F;&#x6709;&#x6548;&#x7684;&#xFF0C;&#x5426;&#x5219;&#xFF0C;&#x8FD9;&#x4E2A;&#x533A;&#x5757;&#x662F;&#x65E0;&#x6548;&#x7684;&#x3002;</p>
<p>&#x533A;&#x5757;&#x9A8C;&#x8BC1;&#x7B97;&#x6CD5;&#x7684;&#x6709;&#x8DA3;&#x90E8;&#x5206;&#x662F;&#x201C;&#x5DE5;&#x4F5C;&#x91CF;&#x8BC1;&#x660E;&#x201D;&#x6982;&#x5FF5;&#xFF1A;&#x5BF9;&#x6BCF;&#x4E2A;&#x533A;&#x5757;&#x8FDB;&#x884C;SHA256&#x54C8;&#x5E0C;&#x5904;&#x7406;&#xFF0C;&#x5C06;&#x5F97;&#x5230;&#x7684;&#x54C8;&#x5E0C;&#x89C6;&#x4E3A;&#x957F;&#x5EA6;&#x4E3A;256&#x6BD4;&#x7279;&#x7684;&#x6570;&#x503C;&#xFF0C;&#x8BE5;&#x6570;&#x503C;&#x5FC5;&#x987B;&#x5C0F;&#x4E8E;&#x4E0D;&#x65AD;&#x52A8;&#x6001;&#x8C03;&#x6574;&#x7684;&#x76EE;&#x6807;&#x6570;&#x503C;&#xFF0C;&#x672C;&#x4E66;&#x5199;&#x4F5C;&#x65F6;&#x76EE;&#x6807;&#x6570;&#x503C;&#x5927;&#x7EA6;&#x662F;2^190&#x3002;&#x5DE5;&#x4F5C;&#x91CF;&#x8BC1;&#x660E;&#x7684;&#x76EE;&#x7684;&#x662F;&#x4F7F;&#x533A;&#x5757;&#x7684;&#x521B;&#x5EFA;&#x53D8;&#x5F97;&#x56F0;&#x96BE;&#xFF0C;&#x4ECE;&#x800C;&#x963B;&#x6B62;&#x5973;&#x5DEB;&#x653B;&#x51FB;&#x8005;&#x6076;&#x610F;&#x91CD;&#x65B0;&#x751F;&#x6210;&#x533A;&#x5757;&#x94FE;&#x3002;&#x56E0;&#x4E3A;SHA256&#x662F;&#x5B8C;&#x5168;&#x4E0D;&#x53EF;&#x9884;&#x6D4B;&#x7684;&#x4F2A;&#x968F;&#x673A;&#x51FD;&#x6570;&#xFF0C;&#x521B;&#x5EFA;&#x6709;&#x6548;&#x533A;&#x5757;&#x7684;&#x552F;&#x4E00;&#x65B9;&#x6CD5;&#x5C31;&#x662F;&#x7B80;&#x5355;&#x5730;&#x4E0D;&#x65AD;&#x8BD5;&#x9519;&#xFF0C;&#x4E0D;&#x65AD;&#x5730;&#x589E;&#x52A0;&#x968F;&#x673A;&#x6570;&#x7684;&#x6570;&#x503C;&#xFF0C;&#x67E5;&#x770B;&#x65B0;&#x7684;&#x54C8;&#x5E0C;&#x6570;&#x503C;&#x662F;&#x5426;&#x5C0F;&#x4E8E;&#x76EE;&#x6807;&#x6570;&#x503C;&#x3002;&#x5982;&#x679C;&#x5F53;&#x524D;&#x7684;&#x76EE;&#x6807;&#x6570;&#x503C;&#x662F;2^192&#xFF0C;&#x5C31;&#x610F;&#x5473;&#x7740;&#x5E73;&#x5747;&#x9700;&#x8981;&#x5C1D;&#x8BD5;2^64&#x6B21;&#x624D;&#x80FD;&#x751F;&#x6210;&#x6709;&#x6548;&#x7684;&#x533A;&#x5757;&#x3002;&#x4E00;&#x822C;&#x800C;&#x8A00;&#xFF0C;&#x6BD4;&#x7279;&#x5E01;&#x7F51;&#x7EDC;&#x6BCF;&#x9694;2016&#x4E2A;&#x533A;&#x5757;&#x91CD;&#x65B0;&#x8BBE;&#x5B9A;&#x76EE;&#x6807;&#x6570;&#x503C;&#xFF0C;&#x4FDD;&#x8BC1;&#x5E73;&#x5747;&#x6BCF;&#x5341;&#x5206;&#x949F;&#x751F;&#x6210;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#x3002;&#x4E3A;&#x4E86;&#x5BF9;&#x77FF;&#x5DE5;&#x7684;&#x8BA1;&#x7B97;&#x5DE5;&#x4F5C;&#x8FDB;&#x884C;&#x5956;&#x52B1;&#xFF0C;&#x6BCF;&#x4E00;&#x4E2A;&#x6210;&#x529F;&#x751F;&#x6210;&#x533A;&#x5757;&#x7684;&#x77FF;&#x5DE5;&#x6709;&#x6743;&#x5728;&#x533A;&#x5757;&#x4E2D;&#x5305;&#x542B;&#x4E00;&#x7B14;&#x51ED;&#x7A7A;&#x53D1;&#x7ED9;&#x4ED6;&#x4EEC;&#x81EA;&#x5DF1;25BTC&#x7684;&#x4EA4;&#x6613;&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x5982;&#x679C;&#x4EA4;&#x6613;&#x7684;&#x8F93;&#x5165;&#x5927;&#x4E8E;&#x8F93;&#x51FA;&#xFF0C;&#x5DEE;&#x989D;&#x90E8;&#x5206;&#x5C31;&#x4F5C;&#x4E3A;&#x201C;&#x4EA4;&#x6613;&#x8D39;&#x7528;&#x201D;&#x4ED8;&#x7ED9;&#x77FF;&#x5DE5;&#x3002;&#x987A;&#x4FBF;&#x63D0;&#x4E00;&#x4E0B;&#xFF0C;&#x5BF9;&#x77FF;&#x5DE5;&#x7684;&#x5956;&#x52B1;&#x662F;&#x6BD4;&#x7279;&#x5E01;&#x53D1;&#x884C;&#x7684;&#x552F;&#x4E00;&#x673A;&#x5236;&#xFF0C;&#x521B;&#x4E16;&#x72B6;&#x6001;&#x4E2D;&#x5E76;&#x6CA1;&#x6709;&#x6BD4;&#x7279;&#x5E01;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x66F4;&#x597D;&#x5730;&#x7406;&#x89E3;&#x6316;&#x77FF;&#x7684;&#x76EE;&#x7684;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x5206;&#x6790;&#x6BD4;&#x7279;&#x5E01;&#x7F51;&#x7EDC;&#x51FA;&#x73B0;&#x6076;&#x610F;&#x653B;&#x51FB;&#x8005;&#x65F6;&#x4F1A;&#x53D1;&#x751F;&#x4EC0;&#x4E48;&#x3002;&#x56E0;&#x4E3A;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x5BC6;&#x7801;&#x5B66;&#x57FA;&#x7840;&#x662F;&#x975E;&#x5E38;&#x5B89;&#x5168;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x653B;&#x51FB;&#x8005;&#x4F1A;&#x9009;&#x62E9;&#x653B;&#x51FB;&#x6CA1;&#x6709;&#x88AB;&#x5BC6;&#x7801;&#x5B66;&#x76F4;&#x63A5;&#x4FDD;&#x62A4;&#x7684;&#x90E8;&#x5206;&#xFF1A;&#x4EA4;&#x6613;&#x987A;&#x5E8F;&#x3002;&#x653B;&#x51FB;&#x8005;&#x7684;&#x7B56;&#x7565;&#x975E;&#x5E38;&#x7B80;&#x5355;&#xFF1A;</p>
<ol>
<li>&#x5411;&#x5356;&#x5BB6;&#x53D1;&#x9001;100BTC&#x8D2D;&#x4E70;&#x5546;&#x54C1;&#xFF08;&#x5C24;&#x5176;&#x662F;&#x65E0;&#x9700;&#x90AE;&#x5BC4;&#x7684;&#x7535;&#x5B50;&#x5546;&#x54C1;&#xFF09;&#x3002;</li>
<li>&#x7B49;&#x5F85;&#x76F4;&#x81F3;&#x5546;&#x54C1;&#x53D1;&#x51FA;&#x3002;</li>
<li>&#x521B;&#x5EFA;&#x53E6;&#x4E00;&#x7B14;&#x4EA4;&#x6613;&#xFF0C;&#x5C06;&#x76F8;&#x540C;&#x7684;100BTC&#x53D1;&#x9001;&#x7ED9;&#x81EA;&#x5DF1;&#x7684;&#x8D26;&#x6237;&#x3002;</li>
<li>&#x4F7F;&#x6BD4;&#x7279;&#x5E01;&#x7F51;&#x7EDC;&#x76F8;&#x4FE1;&#x53D1;&#x9001;&#x7ED9;&#x81EA;&#x5DF1;&#x8D26;&#x6237;&#x7684;&#x4EA4;&#x6613;&#x662F;&#x6700;&#x5148;&#x53D1;&#x51FA;&#x7684;&#x3002;</li>
</ol>
<p>&#x4E00;&#x65E6;&#x6B65;&#x9AA4;&#xFF08;1&#xFF09;&#x53D1;&#x751F;&#xFF0C;&#x51E0;&#x5206;&#x949F;&#x540E;&#x77FF;&#x5DE5;&#x5C06;&#x628A;&#x8FD9;&#x7B14;&#x4EA4;&#x6613;&#x6253;&#x5305;&#x5230;&#x533A;&#x5757;&#xFF0C;&#x5047;&#x8BBE;&#x662F;&#x7B2C;270000&#x4E2A;&#x533A;&#x5757;&#x3002;&#x5927;&#x7EA6;&#x4E00;&#x4E2A;&#x5C0F;&#x65F6;&#x4EE5;&#x540E;&#xFF0C;&#x5728;&#x6B64;&#x533A;&#x5757;&#x540E;&#x9762;&#x5C06;&#x4F1A;&#x6709;&#x4E94;&#x4E2A;&#x533A;&#x5757;&#xFF0C;&#x6BCF;&#x4E2A;&#x533A;&#x5757;&#x95F4;&#x63A5;&#x5730;&#x6307;&#x5411;&#x8FD9;&#x7B14;&#x4EA4;&#x6613;&#xFF0C;&#x4ECE;&#x800C;&#x786E;&#x8BA4;&#x8FD9;&#x7B14;&#x4EA4;&#x6613;&#x3002;&#x8FD9;&#x65F6;&#x5356;&#x5BB6;&#x6536;&#x5230;&#x8D27;&#x6B3E;&#xFF0C;&#x5E76;&#x5411;&#x4E70;&#x5BB6;&#x53D1;&#x8D27;&#x3002;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x5047;&#x8BBE;&#x8FD9;&#x662F;&#x6570;&#x5B57;&#x5546;&#x54C1;&#xFF0C;&#x653B;&#x51FB;&#x8005;&#x53EF;&#x4EE5;&#x5373;&#x65F6;&#x6536;&#x5230;&#x8D27;&#x3002;&#x73B0;&#x5728;&#xFF0C;&#x653B;&#x51FB;&#x8005;&#x521B;&#x5EFA;&#x53E6;&#x4E00;&#x7B14;&#x4EA4;&#x6613;&#xFF0C;&#x5C06;&#x76F8;&#x540C;&#x7684;100BTC&#x53D1;&#x9001;&#x5230;&#x81EA;&#x5DF1;&#x7684;&#x8D26;&#x6237;&#x3002;&#x5982;&#x679C;&#x653B;&#x51FB;&#x8005;&#x53EA;&#x662F;&#x5411;&#x5168;&#x7F51;&#x5E7F;&#x64AD;&#x8FD9;&#x4E00;&#x6D88;&#x606F;&#xFF0C;&#x8FD9;&#x4E00;&#x7B14;&#x4EA4;&#x6613;&#x4E0D;&#x4F1A;&#x88AB;&#x5904;&#x7406;&#x3002;&#x77FF;&#x5DE5;&#x4F1A;&#x8FD0;&#x884C;&#x72B6;&#x6001;&#x8F6C;&#x6362;&#x51FD;&#x6570;APPLY(S,TX)&#xFF0C;&#x53D1;&#x73B0;&#x8FD9;&#x7B14;&#x4EA4;&#x6613;&#x5C06;&#x82B1;&#x8D39;&#x5DF2;&#x7ECF;&#x4E0D;&#x5728;&#x72B6;&#x6001;&#x4E2D;&#x7684;UTXO&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x653B;&#x51FB;&#x8005;&#x4F1A;&#x5BF9;&#x533A;&#x5757;&#x94FE;&#x8FDB;&#x884C;&#x5206;&#x53C9;&#xFF0C;&#x5C06;&#x7B2C;269999&#x4E2A;&#x533A;&#x5757;&#x4F5C;&#x4E3A;&#x7236;&#x533A;&#x5757;&#x91CD;&#x65B0;&#x751F;&#x6210;&#x7B2C;270000&#x4E2A;&#x533A;&#x5757;&#xFF0C;&#x5728;&#x6B64;&#x533A;&#x5757;&#x4E2D;&#x7528;&#x65B0;&#x7684;&#x4EA4;&#x6613;&#x53D6;&#x4EE3;&#x65E7;&#x7684;&#x4EA4;&#x6613;&#x3002;&#x56E0;&#x4E3A;&#x533A;&#x5757;&#x6570;&#x636E;&#x662F;&#x4E0D;&#x540C;&#x7684;&#xFF0C;&#x8FD9;&#x8981;&#x6C42;&#x91CD;&#x65B0;&#x8FDB;&#x884C;&#x5DE5;&#x4F5C;&#x91CF;&#x8BC1;&#x660E;&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x56E0;&#x4E3A;&#x653B;&#x51FB;&#x8005;&#x751F;&#x6210;&#x7684;&#x65B0;&#x7684;&#x7B2C;270000&#x4E2A;&#x533A;&#x5757;&#x6709;&#x4E0D;&#x540C;&#x7684;&#x54C8;&#x5E0C;&#xFF0C;&#x6240;&#x4EE5;&#x539F;&#x6765;&#x7684;&#x7B2C;270001&#x5230;&#x7B2C;270005&#x7684;&#x533A;&#x5757;&#x4E0D;&#x6307;&#x5411;&#x5B83;&#xFF0C;&#x56E0;&#x6B64;&#x539F;&#x6709;&#x7684;&#x533A;&#x5757;&#x94FE;&#x548C;&#x653B;&#x51FB;&#x8005;&#x7684;&#x65B0;&#x533A;&#x5757;&#x662F;&#x5B8C;&#x5168;&#x5206;&#x79BB;&#x7684;&#x3002;&#x5728;&#x53D1;&#x751F;&#x533A;&#x5757;&#x94FE;&#x5206;&#x53C9;&#x65F6;&#xFF0C;&#x533A;&#x5757;&#x94FE;&#x957F;&#x7684;&#x5206;&#x652F;&#x88AB;&#x8BA4;&#x4E3A;&#x662F;&#x8BDA;&#x5B9E;&#x7684;&#x533A;&#x5757;&#x94FE;&#xFF0C;&#x5408;&#x6CD5;&#x7684;&#x7684;&#x77FF;&#x5DE5;&#x5C06;&#x4F1A;&#x6CBF;&#x7740;&#x539F;&#x6709;&#x7684;&#x7B2C;270005&#x533A;&#x5757;&#x540E;&#x6316;&#x77FF;&#xFF0C;&#x53EA;&#x6709;&#x653B;&#x51FB;&#x8005;&#x4E00;&#x4EBA;&#x5728;&#x65B0;&#x7684;&#x7B2C;270000&#x533A;&#x5757;&#x540E;&#x6316;&#x77FF;&#x3002;&#x653B;&#x51FB;&#x8005;&#x4E3A;&#x4E86;&#x4F7F;&#x5F97;&#x4ED6;&#x7684;&#x533A;&#x5757;&#x94FE;&#x6700;&#x957F;&#xFF0C;&#x4ED6;&#x9700;&#x8981;&#x62E5;&#x6709;&#x6BD4;&#x9664;&#x4E86;&#x4ED6;&#x4EE5;&#x5916;&#x7684;&#x5168;&#x7F51;&#x66F4;&#x591A;&#x7684;&#x7B97;&#x529B;&#x6765;&#x8FFD;&#x8D76;&#xFF08;&#x5373;51%&#x653B;&#x51FB;&#xFF09;&#x3002;</p>
<h3 id="&#x9ED8;&#x514B;&#x5C14;&#x6811;">&#x9ED8;&#x514B;&#x5C14;&#x6811;</h3>
<p><img src="3.jpg" alt="img"></p>
<p><em>&#x5DE6;&#xFF1A;&#x4EC5;&#x63D0;&#x4F9B;&#x9ED8;&#x514B;&#x5C14;&#x6811;&#xFF08;Merkle tree&#xFF09;&#x4E0A;&#x7684;&#x5C11;&#x91CF;&#x8282;&#x70B9;&#x5DF2;&#x7ECF;&#x8DB3;&#x591F;&#x7ED9;&#x51FA;&#x5206;&#x652F;&#x7684;&#x5408;&#x6CD5;&#x8BC1;&#x660E;&#x3002;</em></p>
<p><em>&#x53F3;&#xFF1A;&#x4EFB;&#x4F55;&#x5BF9;&#x4E8E;&#x9ED8;&#x514B;&#x5C14;&#x6811;&#x7684;&#x4EFB;&#x4F55;&#x90E8;&#x5206;&#x8FDB;&#x884C;&#x6539;&#x53D8;&#x7684;&#x5C1D;&#x8BD5;&#x90FD;&#x4F1A;&#x6700;&#x7EC8;&#x5BFC;&#x81F4;&#x94FE;&#x4E0A;&#x67D0;&#x5904;&#x7684;&#x4E0D;&#x4E00;&#x81F4;&#x3002;</em></p>
<p>&#x6BD4;&#x7279;&#x5E01;&#x7CFB;&#x7EDF;&#x7684;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x7684;&#x53EF;&#x6269;&#x5C55;&#x7279;&#x6027;&#x662F;&#xFF1A;&#x5B83;&#x7684;&#x533A;&#x5757;&#x5B58;&#x50A8;&#x5728;&#x591A;&#x5C42;&#x6B21;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x4E2D;&#x3002;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#x7684;&#x54C8;&#x5E0C;&#x5B9E;&#x9645;&#x4E0A;&#x53EA;&#x662F;&#x533A;&#x5757;&#x5934;&#x7684;&#x54C8;&#x5E0C;&#xFF0C;&#x533A;&#x5757;&#x5934;&#x662F;&#x5305;&#x542B;&#x65F6;&#x95F4;&#x6233;&#x3001;&#x968F;&#x673A;&#x6570;&#x3001;&#x4E0A;&#x4E2A;&#x533A;&#x5757;&#x54C8;&#x5E0C;&#x548C;&#x5B58;&#x50A8;&#x4E86;&#x6240;&#x6709;&#x7684;&#x533A;&#x5757;&#x4EA4;&#x6613;&#x7684;&#x9ED8;&#x514B;&#x5C14;&#x6811;&#x7684;&#x6839;&#x54C8;&#x5E0C;&#x7684;&#x957F;&#x5EA6;&#x5927;&#x7EA6;&#x4E3A;200&#x5B57;&#x8282;&#x7684;&#x4E00;&#x6BB5;&#x6570;&#x636E;&#x3002;</p>
<p>&#x9ED8;&#x514B;&#x5C14;&#x6811;&#x662F;&#x4E00;&#x79CD;&#x4E8C;&#x53C9;&#x6811;&#xFF0C;&#x7531;&#x4E00;&#x7EC4;&#x53F6;&#x8282;&#x70B9;&#x3001;&#x4E00;&#x7EC4;&#x4E2D;&#x95F4;&#x8282;&#x70B9;&#x548C;&#x4E00;&#x4E2A;&#x6839;&#x8282;&#x70B9;&#x6784;&#x6210;&#x3002;&#x6700;&#x4E0B;&#x9762;&#x7684;&#x5927;&#x91CF;&#x7684;&#x53F6;&#x8282;&#x70B9;&#x5305;&#x542B;&#x57FA;&#x7840;&#x6570;&#x636E;&#xFF0C;&#x6BCF;&#x4E2A;&#x4E2D;&#x95F4;&#x8282;&#x70B9;&#x662F;&#x5B83;&#x7684;&#x4E24;&#x4E2A;&#x5B50;&#x8282;&#x70B9;&#x7684;&#x54C8;&#x5E0C;&#xFF0C;&#x6839;&#x8282;&#x70B9;&#x4E5F;&#x662F;&#x7531;&#x5B83;&#x7684;&#x4E24;&#x4E2A;&#x5B50;&#x8282;&#x70B9;&#x7684;&#x54C8;&#x5E0C;&#xFF0C;&#x4EE3;&#x8868;&#x4E86;&#x9ED8;&#x514B;&#x5C14;&#x6811;&#x7684;&#x9876;&#x90E8;&#x3002;&#x9ED8;&#x514B;&#x5C14;&#x6811;&#x7684;&#x76EE;&#x7684;&#x662F;&#x5141;&#x8BB8;&#x533A;&#x5757;&#x7684;&#x6570;&#x636E;&#x53EF;&#x4EE5;&#x96F6;&#x6563;&#x5730;&#x4F20;&#x9001;&#xFF1A;&#x8282;&#x70B9;&#x53EF;&#x4EE5;&#x4ECE;&#x4E00;&#x4E2A;&#x6E90;&#x4E0B;&#x8F7D;&#x533A;&#x5757;&#x5934;&#xFF0C;&#x4ECE;&#x53E6;&#x5916;&#x7684;&#x6E90;&#x4E0B;&#x8F7D;&#x4E0E;&#x5176;&#x6709;&#x5173;&#x7684;&#x6811;&#x7684;&#x5176;&#x5B83;&#x90E8;&#x5206;&#xFF0C;&#x800C;&#x4F9D;&#x7136;&#x80FD;&#x591F;&#x786E;&#x8BA4;&#x6240;&#x6709;&#x7684;&#x6570;&#x636E;&#x90FD;&#x662F;&#x6B63;&#x786E;&#x7684;&#x3002;&#x4E4B;&#x6240;&#x4EE5;&#x5982;&#x6B64;&#x662F;&#x56E0;&#x4E3A;&#x54C8;&#x5E0C;&#x5411;&#x4E0A;&#x7684;&#x6269;&#x6563;&#xFF1A;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x6076;&#x610F;&#x7528;&#x6237;&#x5C1D;&#x8BD5;&#x5728;&#x6811;&#x7684;&#x4E0B;&#x90E8;&#x52A0;&#x5165;&#x4E00;&#x4E2A;&#x4F2A;&#x9020;&#x7684;&#x4EA4;&#x6613;&#xFF0C;&#x6240;&#x5F15;&#x8D77;&#x7684;&#x6539;&#x52A8;&#x5C06;&#x5BFC;&#x81F4;&#x6811;&#x7684;&#x4E0A;&#x5C42;&#x8282;&#x70B9;&#x7684;&#x6539;&#x52A8;&#xFF0C;&#x4EE5;&#x53CA;&#x66F4;&#x4E0A;&#x5C42;&#x8282;&#x70B9;&#x7684;&#x6539;&#x52A8;&#xFF0C;&#x6700;&#x7EC8;&#x5BFC;&#x81F4;&#x6839;&#x8282;&#x70B9;&#x7684;&#x6539;&#x52A8;&#x4EE5;&#x53CA;&#x533A;&#x5757;&#x54C8;&#x5E0C;&#x7684;&#x6539;&#x52A8;&#xFF0C;&#x8FD9;&#x6837;&#x534F;&#x8BAE;&#x5C31;&#x4F1A;&#x5C06;&#x5176;&#x8BB0;&#x5F55;&#x4E3A;&#x4E00;&#x4E2A;&#x5B8C;&#x5168;&#x4E0D;&#x540C;&#x7684;&#x533A;&#x5757;&#xFF08;&#x51E0;&#x4E4E;&#x53EF;&#x4EE5;&#x80AF;&#x5B9A;&#x662F;&#x5E26;&#x7740;&#x4E0D;&#x6B63;&#x786E;&#x7684;&#x5DE5;&#x4F5C;&#x91CF;&#x8BC1;&#x660E;&#x7684;&#xFF09;&#x3002;</p>
<p>&#x9ED8;&#x514B;&#x5C14;&#x6811;&#x534F;&#x8BAE;&#x5BF9;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x957F;&#x671F;&#x6301;&#x7EED;&#x6027;&#x53EF;&#x4EE5;&#x8BF4;&#x662F;&#x81F3;&#x5173;&#x91CD;&#x8981;&#x7684;&#x3002;&#x5728;2014&#x5E74;4&#x6708;&#xFF0C;&#x6BD4;&#x7279;&#x5E01;&#x7F51;&#x7EDC;&#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x5168;&#x8282;&#x70B9;-&#x5B58;&#x50A8;&#x548C;&#x5904;&#x7406;&#x6240;&#x6709;&#x533A;&#x5757;&#x7684;&#x5168;&#x90E8;&#x6570;&#x636E;&#x7684;&#x8282;&#x70B9;-&#x9700;&#x8981;&#x5360;&#x7528;15GB&#x7684;&#x5185;&#x5B58;&#x7A7A;&#x95F4;&#xFF0C;&#x800C;&#x4E14;&#x8FD8;&#x4EE5;&#x6BCF;&#x4E2A;&#x6708;&#x8D85;&#x8FC7;1GB&#x7684;&#x901F;&#x5EA6;&#x589E;&#x957F;&#x3002;&#x76EE;&#x524D;&#xFF0C;&#x8FD9;&#x4E00;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#x5BF9;&#x53F0;&#x5F0F;&#x8BA1;&#x7B97;&#x673A;&#x6765;&#x8BF4;&#x5C1A;&#x53EF;&#x63A5;&#x53D7;&#xFF0C;&#x4F46;&#x662F;&#x624B;&#x673A;&#x5DF2;&#x7ECF;&#x8D1F;&#x8F7D;&#x4E0D;&#x4E86;&#x5982;&#x6B64;&#x5DE8;&#x5927;&#x7684;&#x6570;&#x636E;&#x4E86;&#x3002;&#x672A;&#x6765;&#x53EA;&#x6709;&#x5546;&#x4E1A;&#x673A;&#x6784;&#x548C;&#x7231;&#x597D;&#x8005;&#x624D;&#x4F1A;&#x5145;&#x5F53;&#x5B8C;&#x6574;&#x8282;&#x70B9;&#x3002;&#x7B80;&#x5316;&#x652F;&#x4ED8;&#x786E;&#x8BA4;&#xFF08;SPV)&#x534F;&#x8BAE;&#x5141;&#x8BB8;&#x53E6;&#x4E00;&#x79CD;&#x8282;&#x70B9;&#x5B58;&#x5728;&#xFF0C;&#x8FD9;&#x6837;&#x7684;&#x8282;&#x70B9;&#x88AB;&#x6210;&#x4E3A;&#x201C;&#x8F7B;&#x8282;&#x70B9;&#x201D;&#xFF0C;&#x5B83;&#x4E0B;&#x8F7D;&#x533A;&#x5757;&#x5934;&#xFF0C;&#x4F7F;&#x7528;&#x533A;&#x5757;&#x5934;&#x786E;&#x8BA4;&#x5DE5;&#x4F5C;&#x91CF;&#x8BC1;&#x660E;&#xFF0C;&#x7136;&#x540E;&#x53EA;&#x4E0B;&#x8F7D;&#x4E0E;&#x5176;&#x4EA4;&#x6613;&#x76F8;&#x5173;&#x7684;&#x9ED8;&#x514B;&#x5C14;&#x6811;&#x201C;&#x5206;&#x652F;&#x201D;&#x3002;&#x8FD9;&#x4F7F;&#x5F97;&#x8F7B;&#x8282;&#x70B9;&#x53EA;&#x8981;&#x4E0B;&#x8F7D;&#x6574;&#x4E2A;&#x533A;&#x5757;&#x94FE;&#x7684;&#x4E00;&#x5C0F;&#x90E8;&#x5206;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x5B89;&#x5168;&#x5730;&#x786E;&#x5B9A;&#x4EFB;&#x4F55;&#x4E00;&#x7B14;&#x6BD4;&#x7279;&#x5E01;&#x4EA4;&#x6613;&#x7684;&#x72B6;&#x6001;&#x548C;&#x8D26;&#x6237;&#x7684;&#x5F53;&#x524D;&#x4F59;&#x989D;&#x3002;</p>
<h3 id="&#x5176;&#x5B83;&#x7684;&#x533A;&#x5757;&#x94FE;&#x5E94;&#x7528;">&#x5176;&#x5B83;&#x7684;&#x533A;&#x5757;&#x94FE;&#x5E94;&#x7528;</h3>
<p>&#x5C06;&#x533A;&#x5757;&#x94FE;&#x7684;&#x601D;&#x60F3;&#x5E94;&#x7528;&#x5230;&#x5176;&#x5B83;&#x9886;&#x57DF;&#x7684;&#x60F3;&#x6CD5;&#x65E9;&#x5C31;&#x51FA;&#x73B0;&#x4E86;&#x3002;&#x5728;2005&#x5E74;&#xFF0C;&#x5C3C;&#x514B;&#x8428;&#x535A;&#x63D0;&#x51FA;&#x4E86;&#x201C;&#x7528;&#x6240;&#x6709;&#x6743;&#x4E3A;&#x8D22;&#x4EA7;&#x51A0;&#x540D;&#x201D;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x6587;&#x4E2D;&#x63CF;&#x8FF0;&#x4E86;&#x590D;&#x5236;&#x6570;&#x636E;&#x5E93;&#x6280;&#x672F;&#x7684;&#x53D1;&#x5C55;&#x5982;&#x4F55;&#x4F7F;&#x57FA;&#x4E8E;&#x533A;&#x5757;&#x94FE;&#x7684;&#x7CFB;&#x7EDF;&#x53EF;&#x4EE5;&#x5E94;&#x7528;&#x4E8E;&#x767B;&#x8BB0;&#x571F;&#x5730;&#x6240;&#x6709;&#x6743;&#xFF0C;&#x521B;&#x5EFA;&#x5305;&#x62EC;&#x4F8B;&#x5982;&#x623F;&#x4EA7;&#x6743;&#x3001;&#x8FDD;&#x6CD5;&#x4FB5;&#x5360;&#x548C;&#x4E54;&#x6CBB;&#x4E9A;&#x5DDE;&#x571F;&#x5730;&#x7A0E;&#x7B49;&#x6982;&#x5FF5;&#x7684;&#x8BE6;&#x7EC6;&#x6846;&#x67B6;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x4E0D;&#x5E78;&#x7684;&#x662F;&#x5728;&#x90A3;&#x65F6;&#x8FD8;&#x6CA1;&#x6709;&#x5B9E;&#x7528;&#x7684;&#x590D;&#x5236;&#x6570;&#x636E;&#x5E93;&#x7CFB;&#x7EDF;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x4E2A;&#x534F;&#x8BAE;&#x88AB;&#x6CA1;&#x6709;&#x88AB;&#x4ED8;&#x8BF8;&#x5B9E;&#x8DF5;&#x3002;&#x4E0D;&#x8FC7;&#xFF0C;&#x81EA;2009&#x5E74;&#x6BD4;&#x7279;&#x5E01;&#x7CFB;&#x7EDF;&#x7684;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x5171;&#x8BC6;&#x5F00;&#x53D1;&#x6210;&#x529F;&#x4EE5;&#x6765;&#xFF0C;&#x8BB8;&#x591A;&#x533A;&#x5757;&#x94FE;&#x7684;&#x5176;&#x5B83;&#x5E94;&#x7528;&#x5F00;&#x59CB;&#x5FEB;&#x901F;&#x51FA;&#x73B0;&#x3002;</p>
<ul>
<li>&#x57DF;&#x540D;&#x5E01;&#xFF08;namecoin&#xFF09;-  &#x521B;&#x5EFA;&#x4E8E;2010&#x5E74;&#xFF0C;&#x88AB;&#x79F0;&#x4E3A;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x7684;&#x540D;&#x79F0;&#x6CE8;&#x518C;&#x6570;&#x636E;&#x5E93;&#x3002;&#x50CF;Tor&#x3001;Bitcoin&#x548C;BitMessage&#x8FD9;&#x6837;&#x7684;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x534F;&#x8BAE;&#xFF0C;&#x9700;&#x8981;&#x4E00;&#x4E9B;&#x786E;&#x8BA4;&#x8D26;&#x6237;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x8FD9;&#x6837;&#x5176;&#x4ED6;&#x4EBA;&#x624D;&#x80FD;&#x591F;&#x4E0E;&#x7528;&#x6237;&#x8FDB;&#x884C;&#x4EA4;&#x4E92;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x5728;&#x6240;&#x6709;&#x7684;&#x73B0;&#x5B58;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x4E2D;&#x4EC5;&#x6709;&#x7684;&#x53EF;&#x7528;&#x7684;&#x8EAB;&#x4EFD;&#x6807;&#x8BC6;&#x662F;&#x8C61;1LW79wp5ZBqaHW1jL5TciBCrhQYtHagUWy&#x8FD9;&#x6837;&#x7684;&#x4F2A;&#x968F;&#x673A;&#x54C8;&#x5E0C;&#x3002;&#x7406;&#x60F3;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4EBA;&#x4EEC;&#x5E0C;&#x671B;&#x62E5;&#x6709;&#x4E00;&#x4E2A;&#x5E26;&#x6709;&#x8C61;&#x201C;george&#x201D;&#x8FD9;&#x6837;&#x7684;&#x540D;&#x79F0;&#x7684;&#x8D26;&#x6237;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x95EE;&#x9898;&#x662F;&#x5982;&#x679C;&#x6709;&#x4EBA;&#x53EF;&#x4EE5;&#x521B;&#x5EFA;&#x201C;george&#x201D;&#x8D26;&#x6237;&#xFF0C;&#x90A3;&#x4E48;&#x5176;&#x4ED6;&#x4EBA;&#x540C;&#x6837;&#x4E5F;&#x53EF;&#x4EE5;&#x521B;&#x5EFA;&#x201C;george&#x201D;&#x8D26;&#x6237;&#x6765;&#x5047;&#x626E;&#x3002;&#x552F;&#x4E00;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6CD5;&#x662F;&#x5148;&#x7533;&#x8BF7;&#x539F;&#x5219;&#xFF08;first-to-file&#xFF09;&#xFF0C;&#x53EA;&#x6709;&#x7B2C;&#x4E00;&#x4E2A;&#x6CE8;&#x518C;&#x8005;&#x53EF;&#x4EE5;&#x6210;&#x529F;&#x6CE8;&#x518C;&#xFF0C;&#x7B2C;&#x4E8C;&#x4E2A;&#x4E0D;&#x80FD;&#x518D;&#x6B21;&#x6CE8;&#x518C;&#x540C;&#x4E00;&#x4E2A;&#x8D26;&#x6237;&#x3002;&#x8FD9;&#x4E00;&#x95EE;&#x9898;&#x5C31;&#x53EF;&#x4EE5;&#x5229;&#x7528;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x5171;&#x8BC6;&#x534F;&#x8BAE;&#x3002;&#x57DF;&#x540D;&#x5E01;&#x662F;&#x5229;&#x7528;&#x533A;&#x5757;&#x94FE;&#x5B9E;&#x73B0;&#x540D;&#x79F0;&#x6CE8;&#x518C;&#x7CFB;&#x7EDF;&#x7684;&#x6700;&#x65E9;&#x7684;&#x3001;&#x6700;&#x6210;&#x529F;&#x7684;&#x7CFB;&#x7EDF;&#x3002;</li>
<li>&#x5F69;&#x8272;&#x5E01;&#xFF08;Colored coins&#xFF09;- &#x5F69;&#x8272;&#x5E01;&#x7684;&#x76EE;&#x7684;&#x662F;&#x4E3A;&#x4EBA;&#x4EEC;&#x5728;&#x6BD4;&#x7279;&#x5E01;&#x533A;&#x5757;&#x94FE;&#x4E0A;&#x521B;&#x5EFA;&#x81EA;&#x5DF1;&#x7684;&#x6570;&#x5B57;&#x8D27;&#x5E01;&#xFF0C;&#x6216;&#x8005;&#xFF0C;&#x5728;&#x66F4;&#x91CD;&#x8981;&#x7684;&#x4E00;&#x822C;&#x610F;&#x4E49;&#x4E0A;&#x7684;&#x8D27;&#x5E01; &#x2013;  &#x6570;&#x5B57;&#x4EE4;&#x724C;&#x63D0;&#x4F9B;&#x670D;&#x52A1;&#x3002;&#x4F9D;&#x7167;&#x5F69;&#x8272;&#x5E01;&#x534F;&#x8BAE;&#xFF0C;&#x4EBA;&#x4EEC;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4E3A;&#x67D0;&#x4E00;&#x7279;&#x522B;&#x7684;&#x6BD4;&#x7279;&#x5E01;UTXO&#x6307;&#x5B9A;&#x989C;&#x8272;&#xFF0C;&#x53D1;&#x884C;&#x65B0;&#x7684;&#x8D27;&#x5E01;&#x3002;&#x8BE5;&#x534F;&#x8BAE;&#x9012;&#x5F52;&#x5730;&#x5C06;&#x5176;&#x5B83;UTXO&#x5B9A;&#x4E49;&#x4E3A;&#x4E0E;&#x4EA4;&#x6613;&#x8F93;&#x5165;UTXO&#x76F8;&#x540C;&#x7684;&#x989C;&#x8272;&#x3002;&#x8FD9;&#x5C31;&#x5141;&#x8BB8;&#x7528;&#x6237;&#x4FDD;&#x6301;&#x53EA;&#x5305;&#x542B;&#x67D0;&#x4E00;&#x7279;&#x5B9A;&#x989C;&#x8272;&#x7684;UTXO&#xFF0C;&#x53D1;&#x9001;&#x8FD9;&#x4E9B;UTXO&#x5C31;&#x50CF;&#x53D1;&#x9001;&#x666E;&#x901A;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x4E00;&#x6837;&#xFF0C;&#x901A;&#x8FC7;&#x56DE;&#x6EAF;&#x5168;&#x90E8;&#x7684;&#x533A;&#x5757;&#x94FE;&#x5224;&#x65AD;&#x6536;&#x5230;&#x7684;UTXO&#x989C;&#x8272;&#x3002;</li>
<li>&#x5143;&#x5E01;&#xFF08;Metacoins&#xFF09;-  &#x5143;&#x5E01;&#x7684;&#x7406;&#x5FF5;&#x662F;&#x5728;&#x6BD4;&#x7279;&#x5E01;&#x533A;&#x5757;&#x94FE;&#x4E0A;&#x521B;&#x5EFA;&#x65B0;&#x7684;&#x534F;&#x8BAE;&#xFF0C;&#x5229;&#x7528;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x4EA4;&#x6613;&#x4FDD;&#x5B58;&#x5143;&#x5E01;&#x7684;&#x4EA4;&#x6613;&#xFF0C;&#x4F46;&#x662F;&#x91C7;&#x7528;&#x4E86;&#x4E0D;&#x540C;&#x7684;&#x72B6;&#x6001;&#x8F6C;&#x6362;&#x51FD;&#x6570;APPLY&#x2019;&#x3002;&#x56E0;&#x4E3A;&#x5143;&#x5E01;&#x534F;&#x8BAE;&#x4E0D;&#x80FD;&#x963B;&#x6B62;&#x6BD4;&#x7279;&#x5E01;&#x533A;&#x5757;&#x94FE;&#x4E0A;&#x7684;&#x65E0;&#x6548;&#x7684;&#x5143;&#x5E01;&#x4EA4;&#x6613;&#xFF0C;&#x6240;&#x4EE5;&#x589E;&#x52A0;&#x4E00;&#x4E2A;&#x89C4;&#x5219;&#x5982;&#x679C;APPLY&#x2019;(S,TX)&#x8FD4;&#x56DE;&#x9519;&#x8BEF;&#xFF0C;&#x8FD9;&#x4E00;&#x534F;&#x8BAE;&#x5C06;&#x9ED8;&#x8BA4;APPLY&#x2019;(S,TX)  =  S&#x3002;&#x8FD9;&#x4E3A;&#x521B;&#x5EFA;&#x4EFB;&#x610F;&#x7684;&#x3001;&#x5148;&#x8FDB;&#x7684;&#x4E0D;&#x80FD;&#x5728;&#x6BD4;&#x7279;&#x5E01;&#x7CFB;&#x7EDF;&#x4E2D;&#x5B9E;&#x73B0;&#x7684;&#x5BC6;&#x7801;&#x5B66;&#x8D27;&#x5E01;&#x534F;&#x8BAE;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6CD5;&#xFF0C;&#x800C;&#x4E14;&#x5F00;&#x53D1;&#x6210;&#x672C;&#x975E;&#x5E38;&#x4F4E;&#xFF0C;&#x56E0;&#x4E3A;&#x6316;&#x77FF;&#x548C;&#x7F51;&#x7EDC;&#x7684;&#x95EE;&#x9898;&#x5DF2;&#x7ECF;&#x7531;&#x6BD4;&#x7279;&#x5E01;&#x534F;&#x8BAE;&#x5904;&#x7406;&#x597D;&#x4E86;&#x3002;</li>
</ul>
<p>&#x56E0;&#x6B64;&#xFF0C;&#x4E00;&#x822C;&#x800C;&#x8A00;&#xFF0C;&#x5EFA;&#x7ACB;&#x5171;&#x8BC6;&#x534F;&#x8BAE;&#x6709;&#x4E24;&#x79CD;&#x65B9;&#x6CD5;&#xFF1A;&#x5EFA;&#x7ACB;&#x4E00;&#x4E2A;&#x72EC;&#x7ACB;&#x7684;&#x7F51;&#x7EDC;&#x548C;&#x5728;&#x6BD4;&#x7279;&#x5E01;&#x7F51;&#x7EDC;&#x4E0A;&#x5EFA;&#x7ACB;&#x534F;&#x8BAE;&#x3002;&#x867D;&#x7136;&#x50CF;&#x57DF;&#x540D;&#x5E01;&#x8FD9;&#x6837;&#x7684;&#x5E94;&#x7528;&#x4F7F;&#x7528;&#x7B2C;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x5DF2;&#x7ECF;&#x83B7;&#x5F97;&#x4E86;&#x6210;&#x529F;&#xFF0C;&#x4F46;&#x662F;&#x8BE5;&#x65B9;&#x6CD5;&#x7684;&#x5B9E;&#x65BD;&#x975E;&#x5E38;&#x56F0;&#x96BE;&#xFF0C;&#x56E0;&#x4E3A;&#x6BCF;&#x4E00;&#x4E2A;&#x5E94;&#x7528;&#x9700;&#x8981;&#x521B;&#x5EFA;&#x72EC;&#x7ACB;&#x7684;&#x533A;&#x5757;&#x94FE;&#x548C;&#x5EFA;&#x7ACB;&#x3001;&#x6D4B;&#x8BD5;&#x6240;&#x6709;&#x72B6;&#x6001;&#x8F6C;&#x6362;&#x548C;&#x7F51;&#x7EDC;&#x4EE3;&#x7801;&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x6211;&#x4EEC;&#x9884;&#x6D4B;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x5171;&#x8BC6;&#x6280;&#x672F;&#x7684;&#x5E94;&#x7528;&#x5C06;&#x4F1A;&#x670D;&#x4ECE;&#x5E42;&#x5F8B;&#x5206;&#x5E03;&#xFF0C;&#x5927;&#x591A;&#x6570;&#x7684;&#x5E94;&#x7528;&#x592A;&#x5C0F;&#x4E0D;&#x8DB3;&#x4EE5;&#x4FDD;&#x8BC1;&#x81EA;&#x7531;&#x533A;&#x5757;&#x94FE;&#x7684;&#x5B89;&#x5168;&#xFF0C;&#x6211;&#x4EEC;&#x8FD8;&#x6CE8;&#x610F;&#x5230;&#x5927;&#x91CF;&#x7684;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x5E94;&#x7528;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x81EA;&#x6CBB;&#x7EC4;&#x7EC7;&#xFF0C;&#x9700;&#x8981;&#x8FDB;&#x884C;&#x5E94;&#x7528;&#x4E4B;&#x95F4;&#x7684;&#x4EA4;&#x4E92;&#x3002;</p>
<p>&#x53E6;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x57FA;&#x4E8E;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x65B9;&#x6CD5;&#x5B58;&#x5728;&#x7F3A;&#x70B9;&#xFF0C;&#x5B83;&#x6CA1;&#x6709;&#x7EE7;&#x627F;&#x6BD4;&#x7279;&#x5E01;&#x53EF;&#x4EE5;&#x8FDB;&#x884C;&#x7B80;&#x5316;&#x786E;&#x8BA4;&#x652F;&#x4ED8;&#xFF08;SPV)  &#x7684;&#x7279;&#x6027;&#x3002;&#x6BD4;&#x7279;&#x5E01;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x7B80;&#x5316;&#x786E;&#x8BA4;&#x652F;&#x4ED8;&#xFF0C;&#x56E0;&#x4E3A;&#x6BD4;&#x7279;&#x5E01;&#x53EF;&#x4EE5;&#x5C06;&#x533A;&#x5757;&#x94FE;&#x6DF1;&#x5EA6;&#x4F5C;&#x4E3A;&#x6709;&#x6548;&#x6027;&#x786E;&#x8BA4;&#x4EE3;&#x7406;&#x3002;&#x5728;&#x67D0;&#x4E00;&#x70B9;&#x4E0A;&#xFF0C;&#x4E00;&#x65E6;&#x4E00;&#x7B14;&#x4EA4;&#x6613;&#x7684;&#x7956;&#x5148;&#x4EEC;&#x8DDD;&#x79BB;&#x73B0;&#x5728;&#x8DB3;&#x591F;&#x8FDC;&#x65F6;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x8BA4;&#x4E3A;&#x5B83;&#x4EEC;&#x662F;&#x5408;&#x6CD5;&#x72B6;&#x6001;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x3002;&#x4E0E;&#x4E4B;&#x76F8;&#x53CD;&#xFF0C;&#x57FA;&#x4E8E;&#x6BD4;&#x7279;&#x5E01;&#x533A;&#x5757;&#x94FE;&#x7684;&#x5143;&#x5E01;&#x534F;&#x8BAE;&#x4E0D;&#x80FD;&#x5F3A;&#x8FEB;&#x533A;&#x5757;&#x94FE;&#x4E0D;&#x5305;&#x62EC;&#x4E0D;&#x7B26;&#x5408;&#x5143;&#x5E01;&#x534F;&#x8BAE;&#x7684;&#x4EA4;&#x6613;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5B89;&#x5168;&#x7684;&#x5143;&#x5E01;&#x534F;&#x8BAE;&#x7684;&#x7B80;&#x5316;&#x652F;&#x4ED8;&#x786E;&#x8BA4;&#x9700;&#x8981;&#x540E;&#x5411;&#x626B;&#x63CF;&#x6240;&#x6709;&#x7684;&#x533A;&#x5757;&#xFF0C;&#x76F4;&#x5230;&#x533A;&#x5757;&#x94FE;&#x7684;&#x521D;&#x59CB;&#x70B9;&#xFF0C;&#x4EE5;&#x786E;&#x8BA4;&#x67D0;&#x4E00;&#x4EA4;&#x6613;&#x662F;&#x5426;&#x6709;&#x6548;&#x3002;&#x76EE;&#x524D;&#xFF0C;&#x6240;&#x6709;&#x57FA;&#x4E8E;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x5143;&#x5E01;&#x534F;&#x8BAE;&#x7684;&#x201C;&#x8F7B;&#x201D;&#x5B9E;&#x65BD;&#x90FD;&#x4F9D;&#x8D56;&#x53EF;&#x4FE1;&#x4EFB;&#x7684;&#x670D;&#x52A1;&#x5668;&#x63D0;&#x4F9B;&#x6570;&#x636E;&#xFF0C;&#x8FD9;&#x5BF9;&#x4E3B;&#x8981;&#x76EE;&#x7684;&#x4E4B;&#x4E00;&#x662F;&#x6D88;&#x9664;&#x4FE1;&#x4EFB;&#x9700;&#x8981;&#x7684;&#x5BC6;&#x7801;&#x5B66;&#x8D27;&#x5E01;&#x800C;&#x8A00;&#xFF0C;&#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x76F8;&#x5F53;&#x6B21;&#x4F18;&#x7684;&#x7ED3;&#x679C;&#x3002;</p>
<h3 id="&#x811A;&#x672C;">&#x811A;&#x672C;</h3>
<p>&#x5373;&#x4F7F;&#x4E0D;&#x5BF9;&#x6BD4;&#x7279;&#x5E01;&#x534F;&#x8BAE;&#x8FDB;&#x884C;&#x6269;&#x5C55;&#xFF0C;&#x5B83;&#x4E5F;&#x80FD;&#x5728;&#x4E00;&#x5B9A;&#x7A0B;&#x5EA6;&#x4E0A;&#x5B9E;&#x73B0;&#x201D;&#x667A;&#x80FD;&#x5408;&#x7EA6;&#x201D;&#x3002;&#x6BD4;&#x7279;&#x5E01;&#x7684;UTXO&#x53EF;&#x4EE5;&#x88AB;&#x4E0D;&#x53EA;&#x4E00;&#x4E2A;&#x516C;&#x94A5;&#x62E5;&#x6709;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x88AB;&#x7528;&#x57FA;&#x4E8E;&#x5806;&#x6808;&#x7684;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x6240;&#x7F16;&#x5199;&#x7684;&#x66F4;&#x52A0;&#x590D;&#x6742;&#x7684;&#x811A;&#x672C;&#x6240;&#x62E5;&#x6709;&#x3002;&#x5728;&#x8FD9;&#x4E00;&#x6A21;&#x5F0F;&#x4E0B;&#xFF0C;&#x82B1;&#x8D39;&#x8FD9;&#x6837;&#x7684;UTXO&#xFF0C;&#x5FC5;&#x987B;&#x63D0;&#x4F9B;&#x6EE1;&#x8DB3;&#x811A;&#x672C;&#x7684;&#x6570;&#x636E;&#x3002;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x57FA;&#x672C;&#x7684;&#x516C;&#x94A5;&#x6240;&#x6709;&#x6743;&#x673A;&#x5236;&#x4E5F;&#x662F;&#x901A;&#x8FC7;&#x811A;&#x672C;&#x5B9E;&#x73B0;&#x7684;&#xFF1A;&#x811A;&#x672C;&#x5C06;&#x692D;&#x5706;&#x66F2;&#x7EBF;&#x7B7E;&#x540D;&#x4F5C;&#x4E3A;&#x8F93;&#x5165;&#xFF0C;&#x9A8C;&#x8BC1;&#x4EA4;&#x6613;&#x548C;&#x62E5;&#x6709;&#x8FD9;&#x4E00;UTXO&#x7684;&#x5730;&#x5740;&#xFF0C;&#x5982;&#x679C;&#x9A8C;&#x8BC1;&#x6210;&#x529F;&#xFF0C;&#x8FD4;&#x56DE;1&#xFF0C;&#x5426;&#x5219;&#x8FD4;&#x56DE;0&#x3002;&#x66F4;&#x52A0;&#x590D;&#x6742;&#x7684;&#x811A;&#x672C;&#x7528;&#x4E8E;&#x5176;&#x5B83;&#x4E0D;&#x540C;&#x7684;&#x5E94;&#x7528;&#x60C5;&#x51B5;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x4EBA;&#x4EEC;&#x53EF;&#x4EE5;&#x521B;&#x5EFA;&#x8981;&#x6C42;&#x96C6;&#x9F50;&#x4E09;&#x628A;&#x79C1;&#x94A5;&#x4E2D;&#x7684;&#x4E24;&#x628A;&#x624D;&#x80FD;&#x8FDB;&#x884C;&#x4EA4;&#x6613;&#x786E;&#x8BA4;&#x7684;&#x811A;&#x672C;&#xFF08;&#x591A;&#x91CD;&#x7B7E;&#x540D;&#xFF09;&#xFF0C;&#x5BF9;&#x516C;&#x53F8;&#x8D26;&#x6237;&#x3001;&#x50A8;&#x84C4;&#x8D26;&#x6237;&#x548C;&#x67D0;&#x4E9B;&#x5546;&#x4E1A;&#x4EE3;&#x7406;&#x6765;&#x8BF4;&#xFF0C;&#x8FD9;&#x79CD;&#x811A;&#x672C;&#x662F;&#x975E;&#x5E38;&#x6709;&#x7528;&#x7684;&#x3002;&#x811A;&#x672C;&#x4E5F;&#x80FD;&#x7528;&#x6765;&#x5BF9;&#x89E3;&#x51B3;&#x8BA1;&#x7B97;&#x95EE;&#x9898;&#x7684;&#x7528;&#x6237;&#x53D1;&#x9001;&#x5956;&#x52B1;&#x3002;&#x4EBA;&#x4EEC;&#x751A;&#x81F3;&#x53EF;&#x4EE5;&#x521B;&#x5EFA;&#x8FD9;&#x6837;&#x7684;&#x811A;&#x672C;&#x201C;&#x5982;&#x679C;&#x4F60;&#x80FD;&#x591F;&#x63D0;&#x4F9B;&#x4F60;&#x5DF2;&#x7ECF;&#x53D1;&#x9001;&#x4E00;&#x5B9A;&#x6570;&#x989D;&#x7684;&#x7684;&#x72D7;&#x5E01;&#x7ED9;&#x6211;&#x7684;&#x7B80;&#x5316;&#x786E;&#x8BA4;&#x652F;&#x4ED8;&#x8BC1;&#x660E;&#xFF0C;&#x8FD9;&#x4E00;&#x6BD4;&#x7279;&#x5E01;UTXO&#x5C31;&#x662F;&#x4F60;&#x7684;&#x4E86;&#x201D;&#xFF0C;&#x672C;&#x8D28;&#x4E0A;&#xFF0C;&#x6BD4;&#x7279;&#x5E01;&#x7CFB;&#x7EDF;&#x5141;&#x8BB8;&#x4E0D;&#x540C;&#x7684;&#x5BC6;&#x7801;&#x5B66;&#x8D27;&#x5E01;&#x8FDB;&#x884C;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x7684;&#x5151;&#x6362;&#x3002;</p>
<p>&#x7136;&#x800C;&#xFF0C;&#x6BD4;&#x7279;&#x5E01;&#x7CFB;&#x7EDF;&#x7684;&#x811A;&#x672C;&#x8BED;&#x8A00;&#x5B58;&#x5728;&#x4E00;&#x4E9B;&#x4E25;&#x91CD;&#x7684;&#x9650;&#x5236;&#xFF1A;</p>
<ul>
<li>&#x7F3A;&#x5C11;&#x56FE;&#x7075;&#x5B8C;&#x5907;&#x6027; &#x2013;  &#x8FD9;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x5C3D;&#x7BA1;&#x6BD4;&#x7279;&#x5E01;&#x811A;&#x672C;&#x8BED;&#x8A00;&#x53EF;&#x4EE5;&#x652F;&#x6301;&#x591A;&#x79CD;&#x8BA1;&#x7B97;&#xFF0C;&#x4F46;&#x662F;&#x5B83;&#x4E0D;&#x80FD;&#x652F;&#x6301;&#x6240;&#x6709;&#x7684;&#x8BA1;&#x7B97;&#x3002;&#x6700;&#x4E3B;&#x8981;&#x7684;&#x7F3A;&#x5931;&#x662F;&#x5FAA;&#x73AF;&#x8BED;&#x53E5;&#x3002;&#x4E0D;&#x652F;&#x6301;&#x5FAA;&#x73AF;&#x8BED;&#x53E5;&#x7684;&#x76EE;&#x7684;&#x662F;&#x907F;&#x514D;&#x4EA4;&#x6613;&#x786E;&#x8BA4;&#x65F6;&#x51FA;&#x73B0;&#x65E0;&#x9650;&#x5FAA;&#x73AF;&#x3002;&#x7406;&#x8BBA;&#x4E0A;&#xFF0C;&#x5BF9;&#x4E8E;&#x811A;&#x672C;&#x7A0B;&#x5E8F;&#x5458;&#x6765;&#x8BF4;&#xFF0C;&#x8FD9;&#x662F;&#x53EF;&#x4EE5;&#x514B;&#x670D;&#x7684;&#x969C;&#x788D;&#xFF0C;&#x56E0;&#x4E3A;&#x4EFB;&#x4F55;&#x5FAA;&#x73AF;&#x90FD;&#x53EF;&#x4EE5;&#x7528;&#x591A;&#x6B21;&#x91CD;&#x590D;if   &#x8BED;&#x53E5;&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x6A21;&#x62DF;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x6837;&#x505A;&#x4F1A;&#x5BFC;&#x81F4;&#x811A;&#x672C;&#x7A7A;&#x95F4;&#x5229;&#x7528;&#x4E0A;&#x7684;&#x4F4E;&#x6548;&#x7387;&#xFF0C;&#x4F8B;&#x5982;&#xFF0C;&#x5B9E;&#x65BD;&#x4E00;&#x4E2A;&#x66FF;&#x4EE3;&#x7684;&#x692D;&#x5706;&#x66F2;&#x7EBF;&#x7B7E;&#x540D;&#x7B97;&#x6CD5;&#x53EF;&#x80FD;&#x5C06;&#x9700;&#x8981;256&#x6B21;&#x91CD;&#x590D;&#x7684;&#x4E58;&#x6CD5;&#xFF0C;&#x800C;&#x6BCF;&#x6B21;&#x90FD;&#x9700;&#x8981;&#x5355;&#x72EC;&#x7F16;&#x7801;&#x3002;</li>
<li>&#x4EF7;&#x503C;&#x76F2;&#xFF08;Value-blindness&#xFF09;&#x3002;UTXO&#x811A;&#x672C;&#x4E0D;&#x80FD;&#x4E3A;&#x8D26;&#x6237;&#x7684;&#x53D6;&#x6B3E;&#x989D;&#x5EA6;&#x63D0;&#x4F9B;&#x7CBE;&#x7EC6;&#x7684;&#x63A7;&#x5236;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x9884;&#x8A00;&#x673A;&#x5408;&#x7EA6;&#xFF08;oracle  contract&#xFF09;&#x7684;&#x4E00;&#x4E2A;&#x5F3A;&#x5927;&#x5E94;&#x7528;&#x662F;&#x5BF9;&#x51B2;&#x5408;&#x7EA6;&#xFF0C;A&#x548C;B&#x5404;&#x81EA;&#x5411;&#x5BF9;&#x51B2;&#x5408;&#x7EA6;&#x4E2D;&#x53D1;&#x9001;&#x4EF7;&#x503C;1000&#x7F8E;&#x5143;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#xFF0C;30&#x5929;&#x4EE5;&#x540E;&#xFF0C;&#x811A;&#x672C;&#x5411;A&#x53D1;&#x9001;&#x4EF7;&#x503C;1000&#x7F8E;&#x5143;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#xFF0C;&#x5411;B&#x53D1;&#x9001;&#x5269;&#x4F59;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x3002;&#x867D;&#x7136;&#x5B9E;&#x73B0;&#x5BF9;&#x51B2;&#x5408;&#x7EA6;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x9884;&#x8A00;&#x673A;&#xFF08;oracle&#xFF09;&#x51B3;&#x5B9A;&#x4E00;&#x6BD4;&#x7279;&#x5E01;&#x503C;&#x591A;&#x5C11;&#x7F8E;&#x5143;&#xFF0C;&#x4F46;&#x662F;&#x4E0E;&#x73B0;&#x5728;&#x5B8C;&#x5168;&#x4E2D;&#x5FC3;&#x5316;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x76F8;&#x6BD4;&#xFF0C;&#x8FD9;&#x4E00;&#x673A;&#x5236;&#x5DF2;&#x7ECF;&#x5728;&#x51CF;&#x5C11;&#x4FE1;&#x4EFB;&#x548C;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x65B9;&#x9762;&#x6709;&#x4E86;&#x5DE8;&#x5927;&#x7684;&#x8FDB;&#x6B65;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x56E0;&#x4E3A;UTXO&#x662F;&#x4E0D;&#x53EF;&#x5206;&#x5272;&#x7684;&#xFF0C;&#x4E3A;&#x5B9E;&#x73B0;&#x6B64;&#x5408;&#x7EA6;&#xFF0C;&#x552F;&#x4E00;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#x975E;&#x5E38;&#x4F4E;&#x6548;&#x5730;&#x91C7;&#x7528;&#x8BB8;&#x591A;&#x6709;&#x4E0D;&#x540C;&#x9762;&#x503C;&#x7684;UTXO&#xFF08;&#x4F8B;&#x5982;&#x5BF9;&#x5E94;&#x4E8E;&#x6700;&#x5927;&#x4E3A;30&#x7684;&#x6BCF;&#x4E2A;k&#xFF0C;&#x6709;&#x4E00;&#x4E2A;2^k&#x7684;UTXO)&#x5E76;&#x4F7F;&#x9884;&#x8A00;&#x673A;&#x6311;&#x51FA;&#x6B63;&#x786E;&#x7684;UTXO&#x53D1;&#x9001;&#x7ED9;A&#x548C;B&#x3002;</li>
<li>&#x7F3A;&#x5C11;&#x72B6;&#x6001; &#x2013;  UTXO&#x53EA;&#x80FD;&#x662F;&#x5DF2;&#x82B1;&#x8D39;&#x6216;&#x8005;&#x672A;&#x82B1;&#x8D39;&#x72B6;&#x6001;&#xFF0C;&#x8FD9;&#x5C31;&#x6CA1;&#x6709;&#x7ED9;&#x9700;&#x8981;&#x4EFB;&#x4F55;&#x5176;&#x5B83;&#x5185;&#x90E8;&#x72B6;&#x6001;&#x7684;&#x591A;&#x9636;&#x6BB5;&#x5408;&#x7EA6;&#x6216;&#x8005;&#x811A;&#x672C;&#x7559;&#x51FA;&#x751F;&#x5B58;&#x7A7A;&#x95F4;&#x3002;&#x8FD9;&#x4F7F;&#x5F97;&#x5B9E;&#x73B0;&#x591A;&#x9636;&#x6BB5;&#x671F;&#x6743;&#x5408;&#x7EA6;&#x3001;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x7684;&#x4EA4;&#x6362;&#x8981;&#x7EA6;&#x6216;&#x8005;&#x4E24;&#x9636;&#x6BB5;&#x52A0;&#x5BC6;&#x627F;&#x8BFA;&#x534F;&#x8BAE;&#xFF08;&#x5BF9;&#x786E;&#x4FDD;&#x8BA1;&#x7B97;&#x5956;&#x52B1;&#x975E;&#x5E38;&#x5FC5;&#x8981;&#xFF09;&#x975E;&#x5E38;&#x56F0;&#x96BE;&#x3002;&#x8FD9;&#x4E5F;&#x610F;&#x5473;&#x7740;UTXO&#x53EA;&#x80FD;&#x7528;&#x4E8E;&#x5EFA;&#x7ACB;&#x7B80;&#x5355;&#x7684;&#x3001;&#x4E00;&#x6B21;&#x6027;&#x7684;&#x5408;&#x7EA6;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x4F8B;&#x5982;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x7EC4;&#x7EC7;&#x8FD9;&#x6837;&#x7684;&#x6709;&#x7740;&#x66F4;&#x52A0;&#x590D;&#x6742;&#x7684;&#x72B6;&#x6001;&#x7684;&#x5408;&#x7EA6;&#xFF0C;&#x4F7F;&#x5F97;&#x5143;&#x534F;&#x8BAE;&#x96BE;&#x4EE5;&#x5B9E;&#x73B0;&#x3002;&#x4E8C;&#x5143;&#x72B6;&#x6001;&#x4E0E;&#x4EF7;&#x503C;&#x76F2;&#x7ED3;&#x5408;&#x5728;&#x4E00;&#x8D77;&#x610F;&#x5473;&#x7740;&#x53E6;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x7684;&#x5E94;&#x7528;-&#x53D6;&#x6B3E;&#x9650;&#x989D;-&#x662F;&#x4E0D;&#x53EF;&#x80FD;&#x5B9E;&#x73B0;&#x7684;&#x3002;</li>
<li>&#x533A;&#x5757;&#x94FE;&#x76F2;&#xFF08;Blockchain-blindness&#xFF09;- UTXO&#x770B;&#x4E0D;&#x5230;&#x533A;&#x5757;&#x94FE;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x4F8B;&#x5982;&#x968F;&#x673A;&#x6570;&#x548C;&#x4E0A;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#x7684;&#x54C8;&#x5E0C;&#x3002;&#x8FD9;&#x4E00;&#x7F3A;&#x9677;&#x5265;&#x593A;&#x4E86;&#x811A;&#x672C;&#x8BED;&#x8A00;&#x6240;&#x62E5;&#x6709;&#x7684;&#x57FA;&#x4E8E;&#x968F;&#x673A;&#x6027;&#x7684;&#x6F5C;&#x5728;&#x4EF7;&#x503C;&#xFF0C;&#x4E25;&#x91CD;&#x5730;&#x9650;&#x5236;&#x4E86;&#x535A;&#x5F69;&#x7B49;&#x5176;&#x5B83;&#x9886;&#x57DF;&#x5E94;&#x7528;&#x3002;</li>
</ul>
<p>&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x8003;&#x5BDF;&#x4E86;&#x5728;&#x5BC6;&#x7801;&#x5B66;&#x8D27;&#x5E01;&#x4E0A;&#x5EFA;&#x7ACB;&#x9AD8;&#x7EA7;&#x5E94;&#x7528;&#x7684;&#x4E09;&#x79CD;&#x65B9;&#x6CD5;&#xFF1A;&#x5EFA;&#x7ACB;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x533A;&#x5757;&#x94FE;&#xFF0C;&#x5728;&#x6BD4;&#x7279;&#x5E01;&#x533A;&#x5757;&#x94FE;&#x4E0A;&#x4F7F;&#x7528;&#x811A;&#x672C;&#xFF0C;&#x5728;&#x6BD4;&#x7279;&#x5E01;&#x533A;&#x5757;&#x94FE;&#x4E0A;&#x5EFA;&#x7ACB;&#x5143;&#x5E01;&#x534F;&#x8BAE;&#x3002;&#x5EFA;&#x7ACB;&#x65B0;&#x533A;&#x5757;&#x94FE;&#x7684;&#x65B9;&#x6CD5;&#x53EF;&#x4EE5;&#x81EA;&#x7531;&#x5730;&#x5B9E;&#x73B0;&#x4EFB;&#x610F;&#x7684;&#x7279;&#x6027;&#xFF0C;&#x6210;&#x672C;&#x662F;&#x5F00;&#x53D1;&#x65F6;&#x95F4;&#x548C;&#x57F9;&#x80B2;&#x52AA;&#x529B;&#x3002;&#x4F7F;&#x7528;&#x811A;&#x672C;&#x7684;&#x65B9;&#x6CD5;&#x975E;&#x5E38;&#x5BB9;&#x6613;&#x5B9E;&#x73B0;&#x548C;&#x6807;&#x51C6;&#x5316;&#xFF0C;&#x4F46;&#x662F;&#x5B83;&#x7684;&#x80FD;&#x529B;&#x6709;&#x9650;&#x3002;&#x5143;&#x5E01;&#x534F;&#x8BAE;&#x5C3D;&#x7BA1;&#x975E;&#x5E38;&#x5BB9;&#x6613;&#x5B9E;&#x73B0;&#xFF0C;&#x4F46;&#x662F;&#x5B58;&#x5728;&#x6269;&#x5C55;&#x6027;&#x5DEE;&#x7684;&#x7F3A;&#x9677;&#x3002;&#x5728;&#x4EE5;&#x592A;&#x574A;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x76EE;&#x7684;&#x662F;&#x5EFA;&#x7ACB;&#x4E00;&#x4E2A;&#x80FD;&#x591F;&#x540C;&#x65F6;&#x5177;&#x6709;&#x8FD9;&#x4E09;&#x79CD;&#x6A21;&#x5F0F;&#x7684;&#x6240;&#x6709;&#x4F18;&#x52BF;&#x7684;&#x901A;&#x7528;&#x6846;&#x67B6;&#x3002;</p>
<h2 id="&#x4EE5;&#x592A;&#x574A;">&#x4EE5;&#x592A;&#x574A;</h2>
<p>&#x4EE5;&#x592A;&#x574A;&#x7684;&#x76EE;&#x7684;&#x662F;&#x57FA;&#x4E8E;&#x811A;&#x672C;&#x3001;&#x7ADE;&#x4E89;&#x5E01;&#x548C;&#x94FE;&#x4E0A;&#x5143;&#x534F;&#x8BAE;&#xFF08;on-chain  meta-protocol&#xFF09;&#x6982;&#x5FF5;&#x8FDB;&#x884C;&#x6574;&#x5408;&#x548C;&#x63D0;&#x9AD8;&#xFF0C;&#x4F7F;&#x5F97;&#x5F00;&#x53D1;&#x8005;&#x80FD;&#x591F;&#x521B;&#x5EFA;&#x4EFB;&#x610F;&#x7684;&#x57FA;&#x4E8E;&#x5171;&#x8BC6;&#x7684;&#x3001;&#x53EF;&#x6269;&#x5C55;&#x7684;&#x3001;&#x6807;&#x51C6;&#x5316;&#x7684;&#x3001;&#x7279;&#x6027;&#x5B8C;&#x5907;&#x7684;&#x3001;&#x6613;&#x4E8E;&#x5F00;&#x53D1;&#x7684;&#x548C;&#x534F;&#x540C;&#x7684;&#x5E94;&#x7528;&#x3002;&#x4EE5;&#x592A;&#x574A;&#x901A;&#x8FC7;&#x5EFA;&#x7ACB;&#x7EC8;&#x6781;&#x7684;&#x62BD;&#x8C61;&#x7684;&#x57FA;&#x7840;&#x5C42;-&#x5185;&#x7F6E;&#x6709;&#x56FE;&#x7075;&#x5B8C;&#x5907;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x7684;&#x533A;&#x5757;&#x94FE;-&#x4F7F;&#x5F97;&#x4EFB;&#x4F55;&#x4EBA;&#x90FD;&#x80FD;&#x591F;&#x521B;&#x5EFA;&#x5408;&#x7EA6;&#x548C;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x5E94;&#x7528;&#xFF0C;&#x5E76;&#x5728;&#x5176;&#x4E2D;&#x8BBE;&#x7ACB;&#x4ED6;&#x4EEC;&#x81EA;&#x7531;&#x5B9A;&#x4E49;&#x7684;&#x6240;&#x6709;&#x6743;&#x89C4;&#x5219;&#x3001;&#x4EA4;&#x6613;&#x65B9;&#x5F0F;&#x548C;&#x72B6;&#x6001;&#x8F6C;&#x6362;&#x51FD;&#x6570;&#x3002;&#x57DF;&#x540D;&#x5E01;&#x7684;&#x4E3B;&#x4F53;&#x6846;&#x67B6;&#x53EA;&#x9700;&#x8981;&#x4E24;&#x884C;&#x4EE3;&#x7801;&#x5C31;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#xFF0C;&#x8BF8;&#x5982;&#x8D27;&#x5E01;&#x548C;&#x4FE1;&#x8A89;&#x7CFB;&#x7EDF;&#x7B49;&#x5176;&#x5B83;&#x534F;&#x8BAE;&#x53EA;&#x9700;&#x8981;&#x4E0D;&#x5230;&#x4E8C;&#x5341;&#x884C;&#x4EE3;&#x7801;&#x5C31;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x3002;&#x667A;&#x80FD;&#x5408;&#x7EA6;-&#x5305;&#x542B;&#x4EF7;&#x503C;&#x800C;&#x4E14;&#x53EA;&#x6709;&#x6EE1;&#x8DB3;&#x67D0;&#x4E9B;&#x6761;&#x4EF6;&#x624D;&#x80FD;&#x6253;&#x5F00;&#x7684;&#x52A0;&#x5BC6;&#x7BB1;&#x5B50;-&#x4E5F;&#x80FD;&#x5728;&#x6211;&#x4EEC;&#x7684;&#x5E73;&#x53F0;&#x4E0A;&#x521B;&#x5EFA;&#xFF0C;&#x5E76;&#x4E14;&#x56E0;&#x4E3A;&#x56FE;&#x7075;&#x5B8C;&#x5907;&#x6027;&#x3001;&#x4EF7;&#x503C;&#x77E5;&#x6653;&#xFF08;value-awareness&#xFF09;&#x3001;&#x533A;&#x5757;&#x94FE;&#x77E5;&#x6653;&#xFF08;blockchain-awareness&#xFF09;&#x548C;&#x591A;&#x72B6;&#x6001;&#x6240;&#x589E;&#x52A0;&#x7684;&#x529B;&#x91CF;&#xFF0C;&#x800C;&#x6BD4;&#x6BD4;&#x7279;&#x5E01;&#x811A;&#x672C;&#x6240;&#x80FD;&#x63D0;&#x4F9B;&#x7684;&#x667A;&#x80FD;&#x5408;&#x7EA6;&#x5F3A;&#x5927;&#x5F97;&#x591A;&#x3002;</p>
<h3 id="&#x4EE5;&#x592A;&#x574A;&#x8D26;&#x6237;">&#x4EE5;&#x592A;&#x574A;&#x8D26;&#x6237;</h3>
<p>&#x5728;&#x4EE5;&#x592A;&#x574A;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x72B6;&#x6001;&#x662F;&#x7531;&#x88AB;&#x79F0;&#x4E3A;&#x201C;&#x8D26;&#x6237;&#x201D;&#xFF08;&#x6BCF;&#x4E2A;&#x8D26;&#x6237;&#x7531;&#x4E00;&#x4E2A;20&#x5B57;&#x8282;&#x7684;&#x5730;&#x5740;&#xFF09;&#x7684;&#x5BF9;&#x8C61;&#x548C;&#x5728;&#x4E24;&#x4E2A;&#x8D26;&#x6237;&#x4E4B;&#x95F4;&#x8F6C;&#x79FB;&#x4EF7;&#x503C;&#x548C;&#x4FE1;&#x606F;&#x7684;&#x72B6;&#x6001;&#x8F6C;&#x6362;&#x6784;&#x6210;&#x7684;&#x3002;&#x4EE5;&#x592A;&#x574A;&#x7684;&#x8D26;&#x6237;&#x5305;&#x542B;&#x56DB;&#x4E2A;&#x90E8;&#x5206;&#xFF1A;</p>
<ul>
<li>&#x968F;&#x673A;&#x6570;&#xFF0C;&#x7528;&#x4E8E;&#x786E;&#x5B9A;&#x6BCF;&#x7B14;&#x4EA4;&#x6613;&#x53EA;&#x80FD;&#x88AB;&#x5904;&#x7406;&#x4E00;&#x6B21;&#x7684;&#x8BA1;&#x6570;&#x5668;</li>
<li>&#x8D26;&#x6237;&#x76EE;&#x524D;&#x7684;&#x4EE5;&#x592A;&#x5E01;&#x4F59;&#x989D;</li>
<li>&#x8D26;&#x6237;&#x7684;&#x5408;&#x7EA6;&#x4EE3;&#x7801;&#xFF0C;&#x5982;&#x679C;&#x6709;&#x7684;&#x8BDD;</li>
<li>&#x8D26;&#x6237;&#x7684;&#x5B58;&#x50A8;&#xFF08;&#x9ED8;&#x8BA4;&#x4E3A;&#x7A7A;&#xFF09;</li>
</ul>
<p>&#x4EE5;&#x592A;&#x5E01;&#xFF08;Ether&#xFF09;&#x662F;&#x4EE5;&#x592A;&#x574A;&#x5185;&#x90E8;&#x7684;&#x4E3B;&#x8981;&#x52A0;&#x5BC6;&#x71C3;&#x6599;&#xFF0C;&#x7528;&#x4E8E;&#x652F;&#x4ED8;&#x4EA4;&#x6613;&#x8D39;&#x7528;&#x3002;&#x4E00;&#x822C;&#x800C;&#x8A00;&#xFF0C;&#x4EE5;&#x592A;&#x574A;&#x6709;&#x4E24;&#x79CD;&#x7C7B;&#x578B;&#x7684;&#x8D26;&#x6237;&#xFF1A;&#x5916;&#x90E8;&#x6240;&#x6709;&#x7684;&#x8D26;&#x6237;&#xFF08;&#x7531;&#x79C1;&#x94A5;&#x63A7;&#x5236;&#x7684;&#xFF09;&#x548C;&#x5408;&#x7EA6;&#x8D26;&#x6237;&#xFF08;&#x7531;&#x5408;&#x7EA6;&#x4EE3;&#x7801;&#x63A7;&#x5236;&#xFF09;&#x3002;&#x5916;&#x90E8;&#x6240;&#x6709;&#x7684;&#x8D26;&#x6237;&#x6CA1;&#x6709;&#x4EE3;&#x7801;&#xFF0C;&#x4EBA;&#x4EEC;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x521B;&#x5EFA;&#x548C;&#x7B7E;&#x540D;&#x4E00;&#x7B14;&#x4EA4;&#x6613;&#x4ECE;&#x4E00;&#x4E2A;&#x5916;&#x90E8;&#x8D26;&#x6237;&#x53D1;&#x9001;&#x6D88;&#x606F;&#x3002;&#x6BCF;&#x5F53;&#x5408;&#x7EA6;&#x8D26;&#x6237;&#x6536;&#x5230;&#x4E00;&#x6761;&#x6D88;&#x606F;&#xFF0C;&#x5408;&#x7EA6;&#x5185;&#x90E8;&#x7684;&#x4EE3;&#x7801;&#x5C31;&#x4F1A;&#x88AB;&#x6FC0;&#x6D3B;&#xFF0C;&#x5141;&#x8BB8;&#x5B83;&#x5BF9;&#x5185;&#x90E8;&#x5B58;&#x50A8;&#x8FDB;&#x884C;&#x8BFB;&#x53D6;&#x548C;&#x5199;&#x5165;&#xFF0C;&#x548C;&#x53D1;&#x9001;&#x5176;&#x5B83;&#x6D88;&#x606F;&#x6216;&#x8005;&#x521B;&#x5EFA;&#x5408;&#x7EA6;&#x3002;</p>
<h3 id="&#x6D88;&#x606F;&#x548C;&#x4EA4;&#x6613;">&#x6D88;&#x606F;&#x548C;&#x4EA4;&#x6613;</h3>
<p>&#x4EE5;&#x592A;&#x574A;&#x7684;&#x6D88;&#x606F;&#x5728;&#x67D0;&#x79CD;&#x7A0B;&#x5EA6;&#x4E0A;&#x7C7B;&#x4F3C;&#x4E8E;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x4EA4;&#x6613;&#xFF0C;&#x4F46;&#x662F;&#x4E24;&#x8005;&#x4E4B;&#x95F4;&#x5B58;&#x5728;&#x4E09;&#x70B9;&#x91CD;&#x8981;&#x7684;&#x4E0D;&#x540C;&#x3002;&#x7B2C;&#x4E00;&#xFF0C;&#x4EE5;&#x592A;&#x574A;&#x7684;&#x6D88;&#x606F;&#x53EF;&#x4EE5;&#x7531;&#x5916;&#x90E8;&#x5B9E;&#x4F53;&#x6216;&#x8005;&#x5408;&#x7EA6;&#x521B;&#x5EFA;&#xFF0C;&#x7136;&#x800C;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x4EA4;&#x6613;&#x53EA;&#x80FD;&#x4ECE;&#x5916;&#x90E8;&#x521B;&#x5EFA;&#x3002;&#x7B2C;&#x4E8C;&#xFF0C;&#x4EE5;&#x592A;&#x574A;&#x6D88;&#x606F;&#x53EF;&#x4EE5;&#x9009;&#x62E9;&#x5305;&#x542B;&#x6570;&#x636E;&#x3002;&#x7B2C;&#x4E09;&#xFF0C;&#x5982;&#x679C;&#x4EE5;&#x592A;&#x574A;&#x6D88;&#x606F;&#x7684;&#x63A5;&#x53D7;&#x8005;&#x662F;&#x5408;&#x7EA6;&#x8D26;&#x6237;&#xFF0C;&#x53EF;&#x4EE5;&#x9009;&#x62E9;&#x8FDB;&#x884C;&#x56DE;&#x5E94;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x4EE5;&#x592A;&#x574A;&#x6D88;&#x606F;&#x4E5F;&#x5305;&#x542B;&#x51FD;&#x6570;&#x6982;&#x5FF5;&#x3002;</p>
<p>&#x4EE5;&#x592A;&#x574A;&#x4E2D;&#x201C;&#x4EA4;&#x6613;&#x201D;&#x662F;&#x6307;&#x5B58;&#x50A8;&#x4ECE;&#x5916;&#x90E8;&#x8D26;&#x6237;&#x53D1;&#x51FA;&#x7684;&#x6D88;&#x606F;&#x7684;&#x7B7E;&#x540D;&#x6570;&#x636E;&#x5305;&#x3002;&#x4EA4;&#x6613;&#x5305;&#x542B;&#x6D88;&#x606F;&#x7684;&#x63A5;&#x6536;&#x8005;&#x3001;&#x7528;&#x4E8E;&#x786E;&#x8BA4;&#x53D1;&#x9001;&#x8005;&#x7684;&#x7B7E;&#x540D;&#x3001;&#x4EE5;&#x592A;&#x5E01;&#x8D26;&#x6237;&#x4F59;&#x989D;&#x3001;&#x8981;&#x53D1;&#x9001;&#x7684;&#x6570;&#x636E;&#x548C;&#x4E24;&#x4E2A;&#x88AB;&#x79F0;&#x4E3A;STARTGAS&#x548C;GASPRICE&#x7684;&#x6570;&#x503C;&#x3002;&#x4E3A;&#x4E86;&#x9632;&#x6B62;&#x4EE3;&#x7801;&#x7684;&#x6307;&#x6570;&#x578B;&#x7206;&#x70B8;&#x548C;&#x65E0;&#x9650;&#x5FAA;&#x73AF;&#xFF0C;&#x6BCF;&#x7B14;&#x4EA4;&#x6613;&#x9700;&#x8981;&#x5BF9;&#x6267;&#x884C;&#x4EE3;&#x7801;&#x6240;&#x5F15;&#x53D1;&#x7684;&#x8BA1;&#x7B97;&#x6B65;&#x9AA4;-&#x5305;&#x62EC;&#x521D;&#x59CB;&#x6D88;&#x606F;&#x548C;&#x6240;&#x6709;&#x6267;&#x884C;&#x4E2D;&#x5F15;&#x53D1;&#x7684;&#x6D88;&#x606F;-&#x505A;&#x51FA;&#x9650;&#x5236;&#x3002;STARTGAS&#x5C31;&#x662F;&#x9650;&#x5236;&#xFF0C;GASPRICE&#x662F;&#x6BCF;&#x4E00;&#x8BA1;&#x7B97;&#x6B65;&#x9AA4;&#x9700;&#x8981;&#x652F;&#x4ED8;&#x77FF;&#x5DE5;&#x7684;&#x8D39;&#x7528;&#x3002;&#x5982;&#x679C;&#x6267;&#x884C;&#x4EA4;&#x6613;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x201C;&#x7528;&#x5B8C;&#x4E86;&#x71C3;&#x6599;&#x201D;&#xFF0C;&#x6240;&#x6709;&#x7684;&#x72B6;&#x6001;&#x6539;&#x53D8;&#x6062;&#x590D;&#x539F;&#x72B6;&#x6001;&#xFF0C;&#x4F46;&#x662F;&#x5DF2;&#x7ECF;&#x652F;&#x4ED8;&#x7684;&#x4EA4;&#x6613;&#x8D39;&#x7528;&#x4E0D;&#x53EF;&#x6536;&#x56DE;&#x4E86;&#x3002;&#x5982;&#x679C;&#x6267;&#x884C;&#x4EA4;&#x6613;&#x4E2D;&#x6B62;&#x65F6;&#x8FD8;&#x5269;&#x4F59;&#x71C3;&#x6599;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x4E9B;&#x71C3;&#x6599;&#x5C06;&#x9000;&#x8FD8;&#x7ED9;&#x53D1;&#x9001;&#x8005;&#x3002;&#x521B;&#x5EFA;&#x5408;&#x7EA6;&#x6709;&#x5355;&#x72EC;&#x7684;&#x4EA4;&#x6613;&#x7C7B;&#x578B;&#x548C;&#x76F8;&#x5E94;&#x7684;&#x6D88;&#x606F;&#x7C7B;&#x578B;&#xFF1B;&#x5408;&#x7EA6;&#x7684;&#x5730;&#x5740;&#x662F;&#x57FA;&#x4E8E;&#x8D26;&#x53F7;&#x968F;&#x673A;&#x6570;&#x548C;&#x4EA4;&#x6613;&#x6570;&#x636E;&#x7684;&#x54C8;&#x5E0C;&#x8BA1;&#x7B97;&#x51FA;&#x6765;&#x7684;&#x3002;</p>
<p>&#x6D88;&#x606F;&#x673A;&#x5236;&#x7684;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x540E;&#x679C;&#x662F;&#x4EE5;&#x592A;&#x574A;&#x7684;&#x201C;&#x5934;&#x7B49;&#x516C;&#x6C11;&#x201D;&#x8D22;&#x4EA7;-&#x5408;&#x7EA6;&#x4E0E;&#x5916;&#x90E8;&#x8D26;&#x6237;&#x62E5;&#x6709;&#x540C;&#x6837;&#x6743;&#x5229;&#xFF0C;&#x5305;&#x62EC;&#x53D1;&#x9001;&#x6D88;&#x606F;&#x548C;&#x521B;&#x5EFA;&#x5176;&#x5B83;&#x5408;&#x7EA6;&#x7684;&#x6743;&#x5229;&#x3002;&#x8FD9;&#x4F7F;&#x5F97;&#x5408;&#x7EA6;&#x53EF;&#x4EE5;&#x540C;&#x65F6;&#x5145;&#x5F53;&#x591A;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x89D2;&#x8272;&#xFF0C;&#x4F8B;&#x5982;&#xFF0C;&#x7528;&#x6237;&#x53EF;&#x4EE5;&#x4F7F;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x7EC4;&#x7EC7;&#xFF08;&#x4E00;&#x4E2A;&#x5408;&#x7EA6;&#xFF09;&#x7684;&#x4E00;&#x4E2A;&#x6210;&#x5458;&#x6210;&#x4E3A;&#x4E00;&#x4E2A;&#x4E2D;&#x4ECB;&#x8D26;&#x6237;&#xFF08;&#x53E6;&#x4E00;&#x4E2A;&#x5408;&#x7EA6;&#xFF09;&#xFF0C;&#x4E3A;&#x4E00;&#x4E2A;&#x504F;&#x6267;&#x7684;&#x4F7F;&#x7528;&#x5B9A;&#x5236;&#x7684;&#x57FA;&#x4E8E;&#x91CF;&#x5B50;&#x8BC1;&#x660E;&#x7684;&#x5170;&#x6CE2;&#x7279;&#x7B7E;&#x540D;&#xFF08;&#x7B2C;&#x4E09;&#x4E2A;&#x5408;&#x7EA6;&#xFF09;&#x7684;&#x4E2A;&#x4EBA;&#x548C;&#x4E00;&#x4E2A;&#x81EA;&#x8EAB;&#x4F7F;&#x7528;&#x7531;&#x4E94;&#x4E2A;&#x79C1;&#x94A5;&#x4FDD;&#x8BC1;&#x5B89;&#x5168;&#x7684;&#x8D26;&#x6237;&#xFF08;&#x7B2C;&#x56DB;&#x4E2A;&#x5408;&#x7EA6;&#xFF09;&#x7684;&#x5171;&#x540C;&#x7B7E;&#x540D;&#x5B9E;&#x4F53;&#x63D0;&#x4F9B;&#x5C45;&#x95F4;&#x670D;&#x52A1;&#x3002;&#x4EE5;&#x592A;&#x574A;&#x5E73;&#x53F0;&#x7684;&#x5F3A;&#x5927;&#x4E4B;&#x5904;&#x5728;&#x4E8E;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x7684;&#x7EC4;&#x7EC7;&#x548C;&#x4EE3;&#x7406;&#x5408;&#x7EA6;&#x4E0D;&#x9700;&#x8981;&#x5173;&#x5FC3;&#x5408;&#x7EA6;&#x7684;&#x6BCF;&#x4E00;&#x53C2;&#x4E0E;&#x65B9;&#x662F;&#x4EC0;&#x4E48;&#x7C7B;&#x578B;&#x7684;&#x8D26;&#x6237;&#x3002;</p>
<h3 id="&#x4EE5;&#x592A;&#x574A;&#x72B6;&#x6001;&#x8F6C;&#x6362;&#x51FD;&#x6570;">&#x4EE5;&#x592A;&#x574A;&#x72B6;&#x6001;&#x8F6C;&#x6362;&#x51FD;&#x6570;</h3>
<p><img src="4.jpg" alt="img"></p>
<p>&#x4EE5;&#x592A;&#x574A;&#x7684;&#x72B6;&#x6001;&#x8F6C;&#x6362;&#x51FD;&#x6570;&#xFF1A;<code>APPLY(S,TX) -&gt; S&#x2019;</code>&#xFF0C;&#x53EF;&#x4EE5;&#x5B9A;&#x4E49;&#x5982;&#x4E0B;&#xFF1A;</p>
<ol>
<li>&#x68C0;&#x67E5;&#x4EA4;&#x6613;&#x7684;&#x683C;&#x5F0F;&#x662F;&#x5426;&#x6B63;&#x786E;&#xFF08;&#x5373;&#x6709;&#x6B63;&#x786E;&#x6570;&#x503C;&#xFF09;&#x3001;&#x7B7E;&#x540D;&#x662F;&#x5426;&#x6709;&#x6548;&#x548C;&#x968F;&#x673A;&#x6570;&#x662F;&#x5426;&#x4E0E;&#x53D1;&#x9001;&#x8005;&#x8D26;&#x6237;&#x7684;&#x968F;&#x673A;&#x6570;&#x5339;&#x914D;&#x3002;&#x5982;&#x5426;&#xFF0C;&#x8FD4;&#x56DE;&#x9519;&#x8BEF;&#x3002;</li>
<li>&#x8BA1;&#x7B97;&#x4EA4;&#x6613;&#x8D39;&#x7528;:fee=STARTGAS * GASPRICE&#xFF0C;&#x5E76;&#x4ECE;&#x7B7E;&#x540D;&#x4E2D;&#x786E;&#x5B9A;&#x53D1;&#x9001;&#x8005;&#x7684;&#x5730;&#x5740;&#x3002;&#x4ECE;&#x53D1;&#x9001;&#x8005;&#x7684;&#x8D26;&#x6237;&#x4E2D;&#x51CF;&#x53BB;&#x4EA4;&#x6613;&#x8D39;&#x7528;&#x548C;&#x589E;&#x52A0;&#x53D1;&#x9001;&#x8005;&#x7684;&#x968F;&#x673A;&#x6570;&#x3002;&#x5982;&#x679C;&#x8D26;&#x6237;&#x4F59;&#x989D;&#x4E0D;&#x8DB3;&#xFF0C;&#x8FD4;&#x56DE;&#x9519;&#x8BEF;&#x3002;</li>
<li>&#x8BBE;&#x5B9A;&#x521D;&#x503C;GAS = STARTGAS&#xFF0C;&#x5E76;&#x6839;&#x636E;&#x4EA4;&#x6613;&#x4E2D;&#x7684;&#x5B57;&#x8282;&#x6570;&#x51CF;&#x53BB;&#x4E00;&#x5B9A;&#x91CF;&#x7684;&#x71C3;&#x6599;&#x503C;&#x3002;</li>
<li>&#x4ECE;&#x53D1;&#x9001;&#x8005;&#x7684;&#x8D26;&#x6237;&#x8F6C;&#x79FB;&#x4EF7;&#x503C;&#x5230;&#x63A5;&#x6536;&#x8005;&#x8D26;&#x6237;&#x3002;&#x5982;&#x679C;&#x63A5;&#x6536;&#x8D26;&#x6237;&#x8FD8;&#x4E0D;&#x5B58;&#x5728;&#xFF0C;&#x521B;&#x5EFA;&#x6B64;&#x8D26;&#x6237;&#x3002;&#x5982;&#x679C;&#x63A5;&#x6536;&#x8D26;&#x6237;&#x662F;&#x4E00;&#x4E2A;&#x5408;&#x7EA6;&#xFF0C;&#x8FD0;&#x884C;&#x5408;&#x7EA6;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x76F4;&#x5230;&#x4EE3;&#x7801;&#x8FD0;&#x884C;&#x7ED3;&#x675F;&#x6216;&#x8005;&#x71C3;&#x6599;&#x7528;&#x5B8C;&#x3002;</li>
<li>&#x5982;&#x679C;&#x56E0;&#x4E3A;&#x53D1;&#x9001;&#x8005;&#x8D26;&#x6237;&#x6CA1;&#x6709;&#x8DB3;&#x591F;&#x7684;&#x94B1;&#x6216;&#x8005;&#x4EE3;&#x7801;&#x6267;&#x884C;&#x8017;&#x5C3D;&#x71C3;&#x6599;&#x5BFC;&#x81F4;&#x4EF7;&#x503C;&#x8F6C;&#x79FB;&#x5931;&#x8D25;&#xFF0C;&#x6062;&#x590D;&#x539F;&#x6765;&#x7684;&#x72B6;&#x6001;&#xFF0C;&#x4F46;&#x662F;&#x8FD8;&#x9700;&#x8981;&#x652F;&#x4ED8;&#x4EA4;&#x6613;&#x8D39;&#x7528;&#xFF0C;&#x4EA4;&#x6613;&#x8D39;&#x7528;&#x52A0;&#x81F3;&#x77FF;&#x5DE5;&#x8D26;&#x6237;&#x3002;</li>
<li>&#x5426;&#x5219;&#xFF0C;&#x5C06;&#x6240;&#x6709;&#x5269;&#x4F59;&#x7684;&#x71C3;&#x6599;&#x5F52;&#x8FD8;&#x7ED9;&#x53D1;&#x9001;&#x8005;&#xFF0C;&#x6D88;&#x8017;&#x6389;&#x7684;&#x71C3;&#x6599;&#x4F5C;&#x4E3A;&#x4EA4;&#x6613;&#x8D39;&#x7528;&#x53D1;&#x9001;&#x7ED9;&#x77FF;&#x5DE5;&#x3002;</li>
</ol>
<p>&#x4F8B;&#x5982;&#xFF0C;&#x5047;&#x8BBE;&#x5408;&#x7EA6;&#x7684;&#x4EE3;&#x7801;&#x5982;&#x4E0B;&#xFF1A;</p>
<pre><code>if !contract.storage[msg.data[0]]:

contract.storage[msg.data[0]] = msg.data[1]
</code></pre><p>&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;&#x5728;&#x73B0;&#x5B9E;&#x4E2D;&#x5408;&#x7EA6;&#x4EE3;&#x7801;&#x662F;&#x7528;&#x5E95;&#x5C42;&#x4EE5;&#x592A;&#x574A;&#x865A;&#x62DF;&#x673A;&#xFF08;EVM&#xFF09;&#x4EE3;&#x7801;&#x5199;&#x6210;&#x7684;&#x3002;&#x4E0A;&#x9762;&#x7684;&#x5408;&#x7EA6;&#x662F;&#x7528;&#x6211;&#x4EEC;&#x7684;&#x9AD8;&#x7EA7;&#x8BED;&#x8A00;Serpent&#x8BED;&#x8A00;&#x5199;&#x6210;&#x7684;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x88AB;&#x7F16;&#x8BD1;&#x6210;EVM&#x4EE3;&#x7801;&#x3002;&#x5047;&#x8BBE;&#x5408;&#x7EA6;&#x5B58;&#x50A8;&#x5668;&#x5F00;&#x59CB;&#x65F6;&#x662F;&#x7A7A;&#x7684;&#xFF0C;&#x4E00;&#x4E2A;&#x503C;&#x4E3A;10&#x4EE5;&#x592A;&#xFF0C;&#x71C3;&#x6599;&#x4E3A;2000&#xFF0C;&#x71C3;&#x6599;&#x4EF7;&#x683C;&#x4E3A;0.001&#x4EE5;&#x592A;&#x5E76;&#x4E14;&#x4E24;&#x4E2A;&#x6570;&#x636E;&#x5B57;&#x6BB5;&#x503C;&#x4E3A;[  2, &#x2018;CHARLIE&#x2019; ] [3]&#x7684;&#x4EA4;&#x6613;&#x53D1;&#x9001;&#x540E;&#xFF0C;&#x72B6;&#x6001;&#x8F6C;&#x6362;&#x51FD;&#x6570;&#x7684;&#x5904;&#x7406;&#x8FC7;&#x7A0B;&#x5982;&#x4E0B;&#xFF1A;</p>
<ol>
<li>&#x68C0;&#x67E5;&#x4EA4;&#x6613;&#x662F;&#x5426;&#x6709;&#x6548;&#x3001;&#x683C;&#x5F0F;&#x662F;&#x5426;&#x6B63;&#x786E;&#x3002;</li>
<li>&#x68C0;&#x67E5;&#x4EA4;&#x6613;&#x53D1;&#x9001;&#x8005;&#x81F3;&#x5C11;&#x6709;2000*0.001=2&#x4E2A;&#x4EE5;&#x592A;&#x5E01;&#x3002;&#x5982;&#x679C;&#x6709;&#xFF0C;&#x4ECE;&#x53D1;&#x9001;&#x8005;&#x8D26;&#x6237;&#x4E2D;&#x51CF;&#x53BB;2&#x4E2A;&#x4EE5;&#x592A;&#x5E01;&#x3002;</li>
<li>&#x521D;&#x59CB;&#x8BBE;&#x5B9A;gas=2000,&#x5047;&#x8BBE;&#x4EA4;&#x6613;&#x957F;&#x4E3A;170&#x5B57;&#x8282;&#xFF0C;&#x6BCF;&#x5B57;&#x8282;&#x7684;&#x8D39;&#x7528;&#x662F;5&#xFF0C;&#x51CF;&#x53BB;850&#xFF0C;&#x6240;&#x4EE5;&#x8FD8;&#x5269;1150&#x3002;</li>
<li>&#x4ECE;&#x53D1;&#x9001;&#x8005;&#x8D26;&#x6237;&#x51CF;&#x53BB;10&#x4E2A;&#x4EE5;&#x592A;&#x5E01;&#xFF0C;&#x4E3A;&#x5408;&#x7EA6;&#x8D26;&#x6237;&#x589E;&#x52A0;10&#x4E2A;&#x4EE5;&#x592A;&#x5E01;&#x3002;</li>
<li>&#x8FD0;&#x884C;&#x4EE3;&#x7801;&#x3002;&#x5728;&#x8FD9;&#x4E2A;&#x5408;&#x7EA6;&#x4E2D;&#xFF0C;&#x8FD0;&#x884C;&#x4EE3;&#x7801;&#x5F88;&#x7B80;&#x5355;&#xFF1A;&#x5B83;&#x68C0;&#x67E5;&#x5408;&#x7EA6;&#x5B58;&#x50A8;&#x5668;&#x7D22;&#x5F15;&#x4E3A;2&#x5904;&#x662F;&#x5426;&#x5DF2;&#x4F7F;&#x7528;&#xFF0C;&#x6CE8;&#x610F;&#x5230;&#x5B83;&#x672A;&#x88AB;&#x4F7F;&#x7528;&#xFF0C;&#x7136;&#x540E;&#x5C06;&#x5176;&#x503C;&#x7F6E;&#x4E3A;CHARLIE&#x3002;&#x5047;&#x8BBE;&#x8FD9;&#x6D88;&#x8017;&#x4E86;187&#x5355;&#x4F4D;&#x7684;&#x71C3;&#x6599;&#xFF0C;&#x4E8E;&#x662F;&#x5269;&#x4F59;&#x7684;&#x71C3;&#x6599;&#x4E3A;1150 &#x2013; 187 = 963&#x3002;</li>
</ol>
<p>&#xFF16;. &#x5411;&#x53D1;&#x9001;&#x8005;&#x7684;&#x8D26;&#x6237;&#x589E;&#x52A0;963*0.001=0.963&#x4E2A;&#x4EE5;&#x592A;&#x5E01;&#xFF0C;&#x8FD4;&#x56DE;&#x6700;&#x7EC8;&#x72B6;&#x6001;&#x3002;</p>
<p>&#x5982;&#x679C;&#x6CA1;&#x6709;&#x5408;&#x7EA6;&#x63A5;&#x6536;&#x4EA4;&#x6613;&#xFF0C;&#x90A3;&#x4E48;&#x6240;&#x6709;&#x7684;&#x4EA4;&#x6613;&#x8D39;&#x7528;&#x5C31;&#x7B49;&#x4E8E;GASPRICE&#x4E58;&#x4EE5;&#x4EA4;&#x6613;&#x7684;&#x5B57;&#x8282;&#x957F;&#x5EA6;&#xFF0C;&#x4EA4;&#x6613;&#x7684;&#x6570;&#x636E;&#x5C31;&#x4E0E;&#x4EA4;&#x6613;&#x8D39;&#x7528;&#x65E0;&#x5173;&#x4E86;&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;&#x5408;&#x7EA6;&#x53D1;&#x8D77;&#x7684;&#x6D88;&#x606F;&#x53EF;&#x4EE5;&#x5BF9;&#x5B83;&#x4EEC;&#x4EA7;&#x751F;&#x7684;&#x8BA1;&#x7B97;&#x5206;&#x914D;&#x71C3;&#x6599;&#x9650;&#x989D;&#xFF0C;&#x5982;&#x679C;&#x5B50;&#x8BA1;&#x7B97;&#x7684;&#x71C3;&#x6599;&#x7528;&#x5B8C;&#x4E86;&#xFF0C;&#x5B83;&#x53EA;&#x6062;&#x590D;&#x5230;&#x6D88;&#x606F;&#x53D1;&#x51FA;&#x65F6;&#x7684;&#x72B6;&#x6001;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5C31;&#x50CF;&#x4EA4;&#x6613;&#x4E00;&#x6837;&#xFF0C;&#x5408;&#x7EA6;&#x4E5F;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5BF9;&#x5B83;&#x4EA7;&#x751F;&#x7684;&#x5B50;&#x8BA1;&#x7B97;&#x8BBE;&#x7F6E;&#x4E25;&#x683C;&#x7684;&#x9650;&#x5236;&#xFF0C;&#x4FDD;&#x62A4;&#x5B83;&#x4EEC;&#x7684;&#x8BA1;&#x7B97;&#x8D44;&#x6E90;&#x3002;</p>
<h3 id="&#x4EE3;&#x7801;&#x6267;&#x884C;">&#x4EE3;&#x7801;&#x6267;&#x884C;</h3>
<p>&#x4EE5;&#x592A;&#x574A;&#x5408;&#x7EA6;&#x7684;&#x4EE3;&#x7801;&#x4F7F;&#x7528;&#x4F4E;&#x7EA7;&#x7684;&#x57FA;&#x4E8E;&#x5806;&#x6808;&#x7684;&#x5B57;&#x8282;&#x7801;&#x7684;&#x8BED;&#x8A00;&#x5199;&#x6210;&#x7684;&#xFF0C;&#x88AB;&#x79F0;&#x4E3A;&#x201C;&#x4EE5;&#x592A;&#x574A;&#x865A;&#x62DF;&#x673A;&#x4EE3;&#x7801;&#x201D;&#x6216;&#x8005;&#x201C;EVM&#x4EE3;&#x7801;&#x201D;&#x3002;&#x4EE3;&#x7801;&#x7531;&#x4E00;&#x7CFB;&#x5217;&#x5B57;&#x8282;&#x6784;&#x6210;&#xFF0C;&#x6BCF;&#x4E00;&#x4E2A;&#x5B57;&#x8282;&#x4EE3;&#x8868;&#x4E00;&#x79CD;&#x64CD;&#x4F5C;&#x3002;&#x4E00;&#x822C;&#x800C;&#x8A00;&#xFF0C;&#x4EE3;&#x7801;&#x6267;&#x884C;&#x662F;&#x65E0;&#x9650;&#x5FAA;&#x73AF;&#xFF0C;&#x7A0B;&#x5E8F;&#x8BA1;&#x6570;&#x5668;&#x6BCF;&#x589E;&#x52A0;&#x4E00;&#xFF08;&#x521D;&#x59CB;&#x503C;&#x4E3A;&#x96F6;&#xFF09;&#x5C31;&#x6267;&#x884C;&#x4E00;&#x6B21;&#x64CD;&#x4F5C;&#xFF0C;&#x76F4;&#x5230;&#x4EE3;&#x7801;&#x6267;&#x884C;&#x5B8C;&#x6BD5;&#x6216;&#x8005;&#x9047;&#x5230;&#x9519;&#x8BEF;&#xFF0C;STOP&#x6216;&#x8005;RETURN&#x6307;&#x4EE4;&#x3002;&#x64CD;&#x4F5C;&#x53EF;&#x4EE5;&#x8BBF;&#x95EE;&#x4E09;&#x79CD;&#x5B58;&#x50A8;&#x6570;&#x636E;&#x7684;&#x7A7A;&#x95F4;&#xFF1A;</p>
<ul>
<li>&#x5806;&#x6808;&#xFF0C;&#x4E00;&#x79CD;&#x540E;&#x8FDB;&#x5148;&#x51FA;&#x7684;&#x6570;&#x636E;&#x5B58;&#x50A8;&#xFF0C;32&#x5B57;&#x8282;&#x7684;&#x6570;&#x503C;&#x53EF;&#x4EE5;&#x5165;&#x6808;&#xFF0C;&#x51FA;&#x6808;&#x3002;</li>
<li>&#x5185;&#x5B58;&#xFF0C;&#x53EF;&#x65E0;&#x9650;&#x6269;&#x5C55;&#x7684;&#x5B57;&#x8282;&#x961F;&#x5217;&#x3002;</li>
<li>&#x5408;&#x7EA6;&#x7684;&#x957F;&#x671F;&#x5B58;&#x50A8;&#xFF0C;&#x4E00;&#x4E2A;&#x79D8;&#x94A5;/&#x6570;&#x503C;&#x7684;&#x5B58;&#x50A8;&#xFF0C;&#x5176;&#x4E2D;&#x79D8;&#x94A5;&#x548C;&#x6570;&#x503C;&#x90FD;&#x662F;32&#x5B57;&#x8282;&#x5927;&#x5C0F;&#xFF0C;&#x4E0E;&#x8BA1;&#x7B97;&#x7ED3;&#x675F;&#x5373;&#x91CD;&#x7F6E;&#x7684;&#x5806;&#x6808;&#x548C;&#x5185;&#x5B58;&#x4E0D;&#x540C;&#xFF0C;&#x5B58;&#x50A8;&#x5185;&#x5BB9;&#x5C06;&#x957F;&#x671F;&#x4FDD;&#x6301;&#x3002;</li>
</ul>
<p>&#x4EE3;&#x7801;&#x53EF;&#x4EE5;&#x8C61;&#x8BBF;&#x95EE;&#x533A;&#x5757;&#x5934;&#x6570;&#x636E;&#x4E00;&#x6837;&#x8BBF;&#x95EE;&#x6570;&#x503C;&#xFF0C;&#x53D1;&#x9001;&#x8005;&#x548C;&#x63A5;&#x53D7;&#x5230;&#x7684;&#x6D88;&#x606F;&#x4E2D;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x4EE3;&#x7801;&#x8FD8;&#x53EF;&#x4EE5;&#x8FD4;&#x56DE;&#x6570;&#x636E;&#x7684;&#x5B57;&#x8282;&#x961F;&#x5217;&#x4F5C;&#x4E3A;&#x8F93;&#x51FA;&#x3002;</p>
<p>EVM&#x4EE3;&#x7801;&#x7684;&#x6B63;&#x5F0F;&#x6267;&#x884C;&#x6A21;&#x578B;&#x4EE4;&#x4EBA;&#x60CA;&#x8BB6;&#x5730;&#x7B80;&#x5355;&#x3002;&#x5F53;&#x4EE5;&#x592A;&#x574A;&#x865A;&#x62DF;&#x673A;&#x8FD0;&#x884C;&#x65F6;&#xFF0C;&#x5B83;&#x7684;&#x5B8C;&#x6574;&#x7684;&#x8BA1;&#x7B97;&#x72B6;&#x6001;&#x53EF;&#x4EE5;&#x7531;&#x5143;&#x7EC4;(block_state,  transaction, message, code, memory, stack, pc,  gas)&#x6765;&#x5B9A;&#x4E49;&#xFF0C;&#x8FD9;&#x91CC;block_state&#x662F;&#x5305;&#x542B;&#x6240;&#x6709;&#x8D26;&#x6237;&#x4F59;&#x989D;&#x548C;&#x5B58;&#x50A8;&#x7684;&#x5168;&#x5C40;&#x72B6;&#x6001;&#x3002;&#x6BCF;&#x8F6E;&#x6267;&#x884C;&#x65F6;&#xFF0C;&#x901A;&#x8FC7;&#x8C03;&#x51FA;&#x4EE3;&#x7801;&#x7684;&#x7B2C;pc&#xFF08;&#x7A0B;&#x5E8F;&#x8BA1;&#x6570;&#x5668;&#xFF09;&#x4E2A;&#x5B57;&#x8282;&#xFF0C;&#x5F53;&#x524D;&#x6307;&#x4EE4;&#x88AB;&#x627E;&#x5230;&#xFF0C;&#x6BCF;&#x4E2A;&#x6307;&#x4EE4;&#x90FD;&#x6709;&#x5B9A;&#x4E49;&#x81EA;&#x5DF1;&#x5982;&#x4F55;&#x5F71;&#x54CD;&#x5143;&#x7EC4;&#x3002;&#x4F8B;&#x5982;&#xFF0C;ADD&#x5C06;&#x4E24;&#x4E2A;&#x5143;&#x7D20;&#x51FA;&#x6808;&#x5E76;&#x5C06;&#x5B83;&#x4EEC;&#x7684;&#x548C;&#x5165;&#x6808;&#xFF0C;&#x5C06;gas&#xFF08;&#x71C3;&#x6599;&#xFF09;&#x51CF;&#x4E00;&#x5E76;&#x5C06;pc&#x52A0;&#x4E00;&#xFF0C;SSTORE&#x5C06;&#x9876;&#x90E8;&#x7684;&#x4E24;&#x4E2A;&#x5143;&#x7D20;&#x51FA;&#x6808;&#x5E76;&#x5C06;&#x7B2C;&#x4E8C;&#x4E2A;&#x5143;&#x7D20;&#x63D2;&#x5165;&#x5230;&#x7531;&#x7B2C;&#x4E00;&#x4E2A;&#x5143;&#x7D20;&#x5B9A;&#x4E49;&#x7684;&#x5408;&#x7EA6;&#x5B58;&#x50A8;&#x4F4D;&#x7F6E;&#xFF0C;&#x540C;&#x6837;&#x51CF;&#x5C11;&#x6700;&#x591A;200&#x7684;gas&#x503C;&#x5E76;&#x5C06;pc&#x52A0;&#x4E00;&#xFF0C;&#x867D;&#x7136;&#x6709;&#x8BB8;&#x591A;&#x65B9;&#x6CD5;&#x901A;&#x8FC7;&#x5373;&#x65F6;&#x7F16;&#x8BD1;&#x53BB;&#x4F18;&#x5316;&#x4EE5;&#x592A;&#x574A;&#xFF0C;&#x4F46;&#x4EE5;&#x592A;&#x574A;&#x7684;&#x57FA;&#x7840;&#x6027;&#x7684;&#x5B9E;&#x65BD;&#x53EF;&#x4EE5;&#x7528;&#x51E0;&#x767E;&#x884C;&#x4EE3;&#x7801;&#x5B9E;&#x73B0;&#x3002;</p>
<h3 id="&#x533A;&#x5757;&#x94FE;&#x548C;&#x6316;&#x77FF;">&#x533A;&#x5757;&#x94FE;&#x548C;&#x6316;&#x77FF;</h3>
<p><img src="5.jpg" alt="img"></p>
<p>&#x867D;&#x7136;&#x6709;&#x4E00;&#x4E9B;&#x4E0D;&#x540C;&#xFF0C;&#x4F46;&#x4EE5;&#x592A;&#x574A;&#x7684;&#x533A;&#x5757;&#x94FE;&#x5728;&#x5F88;&#x591A;&#x65B9;&#x9762;&#x7C7B;&#x4F3C;&#x4E8E;&#x6BD4;&#x7279;&#x5E01;&#x533A;&#x5757;&#x94FE;&#x3002;&#x5B83;&#x4EEC;&#x7684;&#x533A;&#x5757;&#x94FE;&#x67B6;&#x6784;&#x7684;&#x4E0D;&#x540C;&#x5728;&#x4E8E;&#xFF0C;&#x4EE5;&#x592A;&#x574A;&#x533A;&#x5757;&#x4E0D;&#x4EC5;&#x5305;&#x542B;&#x4EA4;&#x6613;&#x8BB0;&#x5F55;&#x548C;&#x6700;&#x8FD1;&#x7684;&#x72B6;&#x6001;&#xFF0C;&#x8FD8;&#x5305;&#x542B;&#x533A;&#x5757;&#x5E8F;&#x53F7;&#x548C;&#x96BE;&#x5EA6;&#x503C;&#x3002;&#x4EE5;&#x592A;&#x574A;&#x4E2D;&#x7684;&#x533A;&#x5757;&#x786E;&#x8BA4;&#x7B97;&#x6CD5;&#x5982;&#x4E0B;&#xFF1A;</p>
<ol>
<li>&#x68C0;&#x67E5;&#x533A;&#x5757;&#x5F15;&#x7528;&#x7684;&#x4E0A;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#x662F;&#x5426;&#x5B58;&#x5728;&#x548C;&#x6709;&#x6548;&#x3002;</li>
<li>&#x68C0;&#x67E5;&#x533A;&#x5757;&#x7684;&#x65F6;&#x95F4;&#x6233;&#x662F;&#x5426;&#x6BD4;&#x5F15;&#x7528;&#x7684;&#x4E0A;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#x5927;&#xFF0C;&#x800C;&#x4E14;&#x5C0F;&#x4E8E;15&#x5206;&#x949F;&#x3002;</li>
<li>&#x68C0;&#x67E5;&#x533A;&#x5757;&#x5E8F;&#x53F7;&#x3001;&#x96BE;&#x5EA6;&#x503C;&#x3001; &#x4EA4;&#x6613;&#x6839;&#xFF0C;&#x53D4;&#x6839;&#x548C;&#x71C3;&#x6599;&#x9650;&#x989D;&#xFF08;&#x8BB8;&#x591A;&#x4EE5;&#x592A;&#x574A;&#x7279;&#x6709;&#x7684;&#x5E95;&#x5C42;&#x6982;&#x5FF5;&#xFF09;&#x662F;&#x5426;&#x6709;&#x6548;&#x3002;</li>
<li>&#x68C0;&#x67E5;&#x533A;&#x5757;&#x7684;&#x5DE5;&#x4F5C;&#x91CF;&#x8BC1;&#x660E;&#x662F;&#x5426;&#x6709;&#x6548;&#x3002;</li>
<li>&#x5C06;S[0]&#x8D4B;&#x503C;&#x4E3A;&#x4E0A;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#x7684;STATE_ROOT&#x3002;</li>
<li>&#x5C06;TX&#x8D4B;&#x503C;&#x4E3A;&#x533A;&#x5757;&#x7684;&#x4EA4;&#x6613;&#x5217;&#x8868;&#xFF0C;&#x4E00;&#x5171;&#x6709;n&#x7B14;&#x4EA4;&#x6613;&#x3002;&#x5BF9;&#x4E8E;&#x5C5E;&#x4E8E;0&#x2026;&#x2026;n-1&#x7684;i&#xFF0C;&#x8FDB;&#x884C;&#x72B6;&#x6001;&#x8F6C;&#x6362;S[i+1] = APPLY(S[i],TX[i])&#x3002;&#x5982;&#x679C;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x8F6C;&#x6362;&#x53D1;&#x751F;&#x9519;&#x8BEF;&#xFF0C;&#x6216;&#x8005;&#x7A0B;&#x5E8F;&#x6267;&#x884C;&#x5230;&#x6B64;&#x5904;&#x6240;&#x82B1;&#x8D39;&#x7684;&#x71C3;&#x6599;&#xFF08;gas&#xFF09;&#x8D85;&#x8FC7;&#x4E86;GASLIMIT&#xFF0C;&#x8FD4;&#x56DE;&#x9519;&#x8BEF;&#x3002;</li>
<li>&#x7528;S[n]&#x7ED9;S_FINAL&#x8D4B;&#x503C;, &#x5411;&#x77FF;&#x5DE5;&#x652F;&#x4ED8;&#x533A;&#x5757;&#x5956;&#x52B1;&#x3002;</li>
<li>&#x68C0;&#x67E5;S-FINAL&#x662F;&#x5426;&#x4E0E;STATE_ROOT&#x76F8;&#x540C;&#x3002;&#x5982;&#x679C;&#x76F8;&#x540C;&#xFF0C;&#x533A;&#x5757;&#x662F;&#x6709;&#x6548;&#x7684;&#x3002;&#x5426;&#x5219;&#xFF0C;&#x533A;&#x5757;&#x662F;&#x65E0;&#x6548;&#x7684;&#x3002;</li>
</ol>
<p>&#x8FD9;&#x4E00;&#x786E;&#x8BA4;&#x65B9;&#x6CD5;&#x4E4D;&#x770B;&#x8D77;&#x6765;&#x4F3C;&#x4E4E;&#x6548;&#x7387;&#x5F88;&#x4F4E;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x9700;&#x8981;&#x5B58;&#x50A8;&#x6BCF;&#x4E2A;&#x533A;&#x5757;&#x7684;&#x6240;&#x6709;&#x72B6;&#x6001;&#xFF0C;&#x4F46;&#x662F;&#x4E8B;&#x5B9E;&#x4E0A;&#x4EE5;&#x592A;&#x574A;&#x7684;&#x786E;&#x8BA4;&#x6548;&#x7387;&#x53EF;&#x4EE5;&#x4E0E;&#x6BD4;&#x7279;&#x5E01;&#x76F8;&#x63D0;&#x5E76;&#x8BBA;&#x3002;&#x539F;&#x56E0;&#x662F;&#x72B6;&#x6001;&#x5B58;&#x50A8;&#x5728;&#x6811;&#x7ED3;&#x6784;&#x4E2D;&#xFF08;tree   structure&#xFF09;&#xFF0C;&#x6BCF;&#x589E;&#x52A0;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#x53EA;&#x9700;&#x8981;&#x6539;&#x53D8;&#x6811;&#x7ED3;&#x6784;&#x7684;&#x4E00;&#x5C0F;&#x90E8;&#x5206;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x4E00;&#x822C;&#x800C;&#x8A00;&#xFF0C;&#x4E24;&#x4E2A;&#x76F8;&#x90BB;&#x7684;&#x533A;&#x5757;&#x7684;&#x6811;&#x7ED3;&#x6784;&#x7684;&#x5927;&#x90E8;&#x5206;&#x5E94;&#x8BE5;&#x662F;&#x76F8;&#x540C;&#x7684;&#xFF0C;&#x56E0;&#x6B64;&#x5B58;&#x50A8;&#x4E00;&#x6B21;&#x6570;&#x636E;&#xFF0C;&#x53EF;&#x4EE5;&#x5229;&#x7528;&#x6307;&#x9488;&#xFF08;&#x5373;&#x5B50;&#x6811;&#x54C8;&#x5E0C;&#xFF09;&#x5F15;&#x7528;&#x4E24;&#x6B21;&#x3002;&#x4E00;&#x79CD;&#x88AB;&#x79F0;&#x4E3A;&#x201C;&#x5E15;&#x7279;&#x91CC;&#x590F;&#x6811;&#x201D;&#xFF08;&#x201C;Patricia   Tree&#x201D;&#xFF09;&#x7684;&#x6811;&#x7ED3;&#x6784;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x8FD9;&#x4E00;&#x70B9;&#xFF0C;&#x5176;&#x4E2D;&#x5305;&#x62EC;&#x4E86;&#x5BF9;&#x9ED8;&#x514B;&#x5C14;&#x6811;&#x6982;&#x5FF5;&#x7684;&#x4FEE;&#x6539;&#xFF0C;&#x4E0D;&#x4EC5;&#x5141;&#x8BB8;&#x6539;&#x53D8;&#x8282;&#x70B9;&#xFF0C;&#x800C;&#x4E14;&#x8FD8;&#x53EF;&#x4EE5;&#x63D2;&#x5165;&#x548C;&#x5220;&#x9664;&#x8282;&#x70B9;&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x56E0;&#x4E3A;&#x6240;&#x6709;&#x7684;&#x72B6;&#x6001;&#x4FE1;&#x606F;&#x662F;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x6240;&#x4EE5;&#x6CA1;&#x6709;&#x5FC5;&#x8981;&#x5B58;&#x50A8;&#x5168;&#x90E8;&#x7684;&#x533A;&#x5757;&#x5386;&#x53F2;-&#x8FD9;&#x4E00;&#x65B9;&#x6CD5;&#x5982;&#x679C;&#x80FD;&#x591F;&#x53EF;&#x4EE5;&#x5E94;&#x7528;&#x5230;&#x6BD4;&#x7279;&#x5E01;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x7ECF;&#x8BA1;&#x7B97;&#x53EF;&#x4EE5;&#x5BF9;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#x6709;10-20&#x500D;&#x7684;&#x8282;&#x7701;&#x3002;</p>
<h2 id="&#x5E94;&#x7528;">&#x5E94;&#x7528;</h2>
<p>&#x4E00;&#x822C;&#x6765;&#x8BB2;&#xFF0C;&#x4EE5;&#x592A;&#x574A;&#x4E4B;&#x4E0A;&#x6709;&#x4E09;&#x79CD;&#x5E94;&#x7528;&#x3002;&#x7B2C;&#x4E00;&#x7C7B;&#x662F;&#x91D1;&#x878D;&#x5E94;&#x7528;&#xFF0C;&#x4E3A;&#x7528;&#x6237;&#x63D0;&#x4F9B;&#x66F4;&#x5F3A;&#x5927;&#x7684;&#x7528;&#x4ED6;&#x4EEC;&#x7684;&#x94B1;&#x7BA1;&#x7406;&#x548C;&#x53C2;&#x4E0E;&#x5408;&#x7EA6;&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x5305;&#x62EC;&#x5B50;&#x8D27;&#x5E01;&#xFF0C;&#x91D1;&#x878D;&#x884D;&#x751F;&#x54C1;&#xFF0C;&#x5BF9;&#x51B2;&#x5408;&#x7EA6;&#xFF0C;&#x50A8;&#x84C4;&#x94B1;&#x5305;&#xFF0C;&#x9057;&#x5631;&#xFF0C;&#x751A;&#x81F3;&#x4E00;&#x4E9B;&#x79CD;&#x7C7B;&#x7684;&#x5168;&#x9762;&#x7684;&#x96C7;&#x4F63;&#x5408;&#x7EA6;&#x3002;&#x7B2C;&#x4E8C;&#x7C7B;&#x662F;&#x534A;&#x91D1;&#x878D;&#x5E94;&#x7528;&#xFF0C;&#x8FD9;&#x91CC;&#x6709;&#x94B1;&#x7684;&#x5B58;&#x5728;&#x4F46;&#x4E5F;&#x6709;&#x5F88;&#x91CD;&#x7684;&#x975E;&#x91D1;&#x94B1;&#x7684;&#x65B9;&#x9762;&#xFF0C;&#x4E00;&#x4E2A;&#x5B8C;&#x7F8E;&#x7684;&#x4F8B;&#x5B50;&#x662F;&#x4E3A;&#x89E3;&#x51B3;&#x8BA1;&#x7B97;&#x95EE;&#x9898;&#x800C;&#x8BBE;&#x7684;&#x81EA;&#x6211;&#x5F3A;&#x5236;&#x60AC;&#x8D4F;&#x3002;&#x6700;&#x540E;&#xFF0C;&#x8FD8;&#x6709;&#x5728;&#x7EBF;&#x6295;&#x7968;&#x548C;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x6CBB;&#x7406;&#x8FD9;&#x6837;&#x7684;&#x5B8C;&#x5168;&#x7684;&#x975E;&#x91D1;&#x878D;&#x5E94;&#x7528;&#x3002;</p>
<h3 id="&#x4EE4;&#x724C;&#x7CFB;&#x7EDF;">&#x4EE4;&#x724C;&#x7CFB;&#x7EDF;</h3>
<p>&#x94FE;&#x4E0A;&#x4EE4;&#x724C;&#x7CFB;&#x7EDF;&#x6709;&#x5F88;&#x591A;&#x5E94;&#x7528;&#xFF0C;&#x4ECE;&#x4EE3;&#x8868;&#x5982;&#x7F8E;&#x5143;&#x6216;&#x9EC4;&#x91D1;&#x7B49;&#x8D44;&#x4EA7;&#x7684;&#x5B50;&#x8D27;&#x5E01;&#x5230;&#x516C;&#x53F8;&#x80A1;&#x7968;&#xFF0C;&#x5355;&#x72EC;&#x7684;&#x4EE4;&#x724C;&#x4EE3;&#x8868;&#x667A;&#x80FD;&#x8D44;&#x4EA7;&#xFF0C;&#x5B89;&#x5168;&#x7684;&#x4E0D;&#x53EF;&#x4F2A;&#x9020;&#x7684;&#x4F18;&#x60E0;&#x5238;&#xFF0C;&#x751A;&#x81F3;&#x4E0E;&#x4F20;&#x7EDF;&#x4EF7;&#x503C;&#x5B8C;&#x5168;&#x6CA1;&#x6709;&#x8054;&#x7CFB;&#x7684;&#x7528;&#x6765;&#x8FDB;&#x884C;&#x79EF;&#x5206;&#x5956;&#x52B1;&#x7684;&#x4EE4;&#x724C;&#x7CFB;&#x7EDF;&#x3002;&#x5728;&#x4EE5;&#x592A;&#x574A;&#x4E2D;&#x5B9E;&#x65BD;&#x4EE4;&#x724C;&#x7CFB;&#x7EDF;&#x5BB9;&#x6613;&#x5F97;&#x8BA9;&#x4EBA;&#x5403;&#x60CA;&#x3002;&#x5173;&#x952E;&#x7684;&#x4E00;&#x70B9;&#x662F;&#x7406;&#x89E3;&#xFF0C;&#x6240;&#x6709;&#x7684;&#x8D27;&#x5E01;&#x6216;&#x8005;&#x4EE4;&#x724C;&#x7CFB;&#x7EDF;&#xFF0C;&#x4ECE;&#x6839;&#x672C;&#x4E0A;&#x6765;&#x8BF4;&#x662F;&#x4E00;&#x4E2A;&#x5E26;&#x6709;&#x5982;&#x4E0B;&#x64CD;&#x4F5C;&#x7684;&#x6570;&#x636E;&#x5E93;&#xFF1A;&#x4ECE;A&#x4E2D;&#x51CF;&#x53BB;X&#x5355;&#x4F4D;&#x5E76;&#x628A;X&#x5355;&#x4F4D;&#x52A0;&#x5230;B&#x4E0A;&#xFF0C;&#x524D;&#x63D0;&#x6761;&#x4EF6;&#x662F;(1)A&#x5728;&#x4EA4;&#x6613;&#x4E4B;&#x524D;&#x6709;&#x81F3;&#x5C11;X&#x5355;&#x4F4D;&#x4EE5;&#x53CA;(2)&#x4EA4;&#x6613;&#x88AB;A&#x6279;&#x51C6;&#x3002;&#x5B9E;&#x65BD;&#x4E00;&#x4E2A;&#x4EE4;&#x724C;&#x7CFB;&#x7EDF;&#x5C31;&#x662F;&#x628A;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x903B;&#x8F91;&#x5B9E;&#x65BD;&#x5230;&#x4E00;&#x4E2A;&#x5408;&#x7EA6;&#x4E2D;&#x53BB;&#x3002;</p>
<p>&#x7528;Serpent&#x8BED;&#x8A00;&#x5B9E;&#x65BD;&#x4E00;&#x4E2A;&#x4EE4;&#x724C;&#x7CFB;&#x7EDF;&#x7684;&#x57FA;&#x672C;&#x4EE3;&#x7801;&#x5982;&#x4E0B;&#xFF1A;</p>
<pre><code>from = msg.sender

to = msg.data[0]

value = msg.data[1]

if contract.storage[from] &gt;= value:

contract.storage[from] = contract.storage[from] value

contract.storage[to] = contract.storage[to] + value
</code></pre><p>&#x8FD9;&#x4ECE;&#x672C;&#x8D28;&#x4E0A;&#x6765;&#x8BF4;&#x662F;&#x672C;&#x6587;&#x5C06;&#x8981;&#x8FDB;&#x4E00;&#x6B65;&#x63CF;&#x8FF0;&#x7684;&#x201C;&#x94F6;&#x884C;&#x7CFB;&#x7EDF;&#x201D;&#x72B6;&#x6001;&#x8F6C;&#x53D8;&#x529F;&#x80FD;&#x7684;&#x4E00;&#x4E2A;&#x6700;&#x5C0F;&#x5316;&#x5B9E;&#x65BD;&#x3002;&#x9700;&#x8981;&#x589E;&#x52A0;&#x4E00;&#x4E9B;&#x989D;&#x5916;&#x7684;&#x4EE3;&#x7801;&#x4EE5;&#x63D0;&#x4F9B;&#x5728;&#x521D;&#x59CB;&#x548C;&#x5176;&#x5B83;&#x4E00;&#x4E9B;&#x8FB9;&#x7F18;&#x60C5;&#x51B5;&#x4E0B;&#x5206;&#x53D1;&#x8D27;&#x5E01;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x7406;&#x60F3;&#x60C5;&#x51B5;&#x4E0B;&#x4F1A;&#x589E;&#x52A0;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#x8BA9;&#x5176;&#x5B83;&#x5408;&#x7EA6;&#x6765;&#x67E5;&#x8BE2;&#x4E00;&#x4E2A;&#x5730;&#x5740;&#x7684;&#x4F59;&#x989D;&#x3002;&#x5C31;&#x8DB3;&#x591F;&#x4E86;&#x3002;&#x7406;&#x8BBA;&#x4E0A;&#xFF0C;&#x57FA;&#x4E8E;&#x4EE5;&#x592A;&#x574A;&#x7684;&#x5145;&#x5F53;&#x5B50;&#x8D27;&#x5E01;&#x7684;&#x4EE4;&#x724C;&#x7CFB;&#x7EDF;&#x53EF;&#x80FD;&#x5305;&#x62EC;&#x4E00;&#x4E2A;&#x57FA;&#x4E8E;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x94FE;&#x4E0A;&#x5143;&#x5E01;&#x6240;&#x7F3A;&#x4E4F;&#x7684;&#x91CD;&#x8981;&#x529F;&#x80FD;&#xFF1A;&#x76F4;&#x63A5;&#x7528;&#x8FD9;&#x79CD;&#x8D27;&#x5E01;&#x652F;&#x4ED8;&#x4EA4;&#x6613;&#x8D39;&#x7684;&#x80FD;&#x529B;&#x3002;&#x5B9E;&#x73B0;&#x8FD9;&#x79CD;&#x80FD;&#x529B;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#x5728;&#x5408;&#x7EA6;&#x91CC;&#x7EF4;&#x62A4;&#x4E00;&#x4E2A;&#x4EE5;&#x592A;&#x5E01;&#x8D26;&#x6237;&#x4EE5;&#x7528;&#x6765;&#x4E3A;&#x53D1;&#x9001;&#x8005;&#x652F;&#x4ED8;&#x4EA4;&#x6613;&#x8D39;&#xFF0C;&#x901A;&#x8FC7;&#x6536;&#x96C6;&#x88AB;&#x7528;&#x6765;&#x5145;&#x5F53;&#x4EA4;&#x6613;&#x8D39;&#x7528;&#x7684;&#x5185;&#x90E8;&#x8D27;&#x5E01;&#x5E76;&#x628A;&#x5B83;&#x4EEC;&#x5728;&#x4E00;&#x4E2A;&#x4E0D;&#x65AD;&#x8FD0;&#x884C;&#x7684;&#x62CD;&#x5356;&#x4E2D;&#x62CD;&#x5356;&#x6389;&#xFF0C;&#x5408;&#x7EA6;&#x4E0D;&#x65AD;&#x4E3A;&#x8BE5;&#x4EE5;&#x592A;&#x5E01;&#x8D26;&#x6237;&#x6CE8;&#x8D44;&#x3002;&#x8FD9;&#x6837;&#x7528;&#x6237;&#x9700;&#x8981;&#x7528;&#x4EE5;&#x592A;&#x5E01;&#x201C;&#x6FC0;&#x6D3B;&#x201D;&#x4ED6;&#x4EEC;&#x7684;&#x8D26;&#x6237;&#xFF0C;&#x4F46;&#x4E00;&#x65E6;&#x8D26;&#x6237;&#x4E2D;&#x6709;&#x4EE5;&#x592A;&#x5E01;&#x5B83;&#x5C06;&#x4F1A;&#x88AB;&#x91CD;&#x590D;&#x4F7F;&#x7528;&#x56E0;&#x4E3A;&#x6BCF;&#x6B21;&#x5408;&#x7EA6;&#x90FD;&#x4F1A;&#x4E3A;&#x5176;&#x5145;&#x503C;&#x3002;</p>
<h3 id="&#x91D1;&#x878D;&#x884D;&#x751F;&#x54C1;&#x548C;&#x4EF7;&#x503C;&#x7A33;&#x5B9A;&#x7684;&#x8D27;&#x5E01;">&#x91D1;&#x878D;&#x884D;&#x751F;&#x54C1;&#x548C;&#x4EF7;&#x503C;&#x7A33;&#x5B9A;&#x7684;&#x8D27;&#x5E01;</h3>
<p>&#x91D1;&#x878D;&#x884D;&#x751F;&#x54C1;&#x662F;&#x201C;&#x667A;&#x80FD;&#x5408;&#x7EA6;&#x201D;&#x7684;&#x6700;&#x666E;&#x904D;&#x7684;&#x5E94;&#x7528;&#xFF0C;&#x4E5F;&#x662F;&#x6700;&#x6613;&#x4E8E;&#x7528;&#x4EE3;&#x7801;&#x5B9E;&#x73B0;&#x7684;&#x4E4B;&#x4E00;&#x3002;&#x5B9E;&#x73B0;&#x91D1;&#x878D;&#x5408;&#x7EA6;&#x7684;&#x4E3B;&#x8981;&#x6311;&#x6218;&#x662F;&#x5B83;&#x4EEC;&#x4E2D;&#x7684;&#x5927;&#x90E8;&#x5206;&#x9700;&#x8981;&#x53C2;&#x7167;&#x4E00;&#x4E2A;&#x5916;&#x90E8;&#x7684;&#x4EF7;&#x683C;&#x53D1;&#x5E03;&#x5668;&#xFF1B;&#x4F8B;&#x5982;&#xFF0C;&#x4E00;&#x4E2A;&#x9700;&#x6C42;&#x975E;&#x5E38;&#x5927;&#x7684;&#x5E94;&#x7528;&#x662F;&#x4E00;&#x4E2A;&#x7528;&#x6765;&#x5BF9;&#x51B2;&#x4EE5;&#x592A;&#x5E01;&#xFF08;&#x6216;&#x5176;&#x5B83;&#x5BC6;&#x7801;&#x5B66;&#x8D27;&#x5E01;&#xFF09;&#x76F8;&#x5BF9;&#x7F8E;&#x5143;&#x4EF7;&#x683C;&#x6CE2;&#x52A8;&#x7684;&#x667A;&#x80FD;&#x5408;&#x7EA6;&#xFF0C;&#x4F46;&#x8BE5;&#x5408;&#x7EA6;&#x9700;&#x8981;&#x77E5;&#x9053;&#x4EE5;&#x592A;&#x5E01;&#x76F8;&#x5BF9;&#x7F8E;&#x5143;&#x7684;&#x4EF7;&#x683C;&#x3002;&#x6700;&#x7B80;&#x5355;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#x901A;&#x8FC7;&#x7531;&#x67D0;&#x7279;&#x5B9A;&#x673A;&#x6784;&#xFF08;&#x4F8B;&#x5982;&#x7EB3;&#x65AF;&#x8FBE;&#x514B;&#xFF09;&#x7EF4;&#x62A4;&#x7684;&#x201C;&#x6570;&#x636E;&#x63D0;&#x4F9B;&#x201C;&#x5408;&#x7EA6;&#x8FDB;&#x884C;&#xFF0C;&#x8BE5;&#x5408;&#x7EA6;&#x7684;&#x8BBE;&#x8BA1;&#x4F7F;&#x5F97;&#x8BE5;&#x673A;&#x6784;&#x80FD;&#x591F;&#x6839;&#x636E;&#x9700;&#x8981;&#x66F4;&#x65B0;&#x5408;&#x7EA6;&#xFF0C;&#x5E76;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x63A5;&#x53E3;&#x4F7F;&#x5F97;&#x5176;&#x5B83;&#x5408;&#x7EA6;&#x80FD;&#x591F;&#x901A;&#x8FC7;&#x53D1;&#x9001;&#x4E00;&#x4E2A;&#x6D88;&#x606F;&#x7ED9;&#x8BE5;&#x5408;&#x7EA6;&#x4EE5;&#x83B7;&#x53D6;&#x5305;&#x542B;&#x4EF7;&#x683C;&#x4FE1;&#x606F;&#x7684;&#x56DE;&#x590D;&#x3002;</p>
<p>&#x5F53;&#x8FD9;&#x4E9B;&#x5173;&#x952E;&#x8981;&#x7D20;&#x90FD;&#x9F50;&#x5907;&#xFF0C;&#x5BF9;&#x51B2;&#x5408;&#x7EA6;&#x770B;&#x8D77;&#x6765;&#x4F1A;&#x662F;&#x4E0B;&#x9762;&#x7684;&#x6837;&#x5B50;&#xFF1A;</p>
<p>&#x7B49;&#x5F85;A&#x8F93;&#x5165;1000&#x4EE5;&#x592A;&#x5E01;&#x3002;.</p>
<p>&#x7B49;&#x5F85;B &#x8F93;&#x5165;1000&#x4EE5;&#x592A;&#x5E01;&#x3002;</p>
<p>&#x901A;&#x8FC7;&#x67E5;&#x8BE2;&#x6570;&#x636E;&#x63D0;&#x4F9B;&#x5408;&#x7EA6;&#xFF0C;&#x5C06;1000&#x4EE5;&#x592A;&#x5E01;&#x7684;&#x7F8E;&#x5143;&#x4EF7;&#x503C;&#xFF0C;&#x4F8B;&#x5982;&#xFF0C;x&#x7F8E;&#x5143;&#xFF0C;&#x8BB0;&#x5F55;&#x81F3;&#x5B58;&#x50A8;&#x5668;&#x3002;</p>
<p>30&#x5929;&#x540E;&#xFF0C;&#x5141;&#x8BB8;A&#x6216;B&#x201C;&#x91CD;&#x65B0;&#x6FC0;&#x6D3B;&#x201C;&#x5408;&#x7EA6;&#x4EE5;&#x53D1;&#x9001;&#x4EF7;&#x503C;x&#x7F8E;&#x5143;&#x7684;&#x4EE5;&#x592A;&#x5E01;&#xFF08;&#x91CD;&#x65B0;&#x67E5;&#x8BE2;&#x6570;&#x636E;&#x63D0;&#x4F9B;&#x5408;&#x7EA6;&#xFF0C;&#x4EE5;&#x83B7;&#x53D6;&#x65B0;&#x4EF7;&#x683C;&#x5E76;&#x8BA1;&#x7B97;&#xFF09;&#x7ED9;A&#x5E76;&#x5C06;&#x5269;&#x4F59;&#x7684;&#x4EE5;&#x592A;&#x5E01;&#x53D1;&#x9001;&#x7ED9;B&#x3002;</p>
<p>&#x8FD9;&#x6837;&#x7684;&#x5408;&#x7EA6;&#x5728;&#x5BC6;&#x7801;&#x5B66;&#x5546;&#x52A1;&#x4E2D;&#x6709;&#x975E;&#x540C;&#x5BFB;&#x5E38;&#x7684;&#x6F5C;&#x529B;&#x3002;&#x5BC6;&#x7801;&#x5B66;&#x8D27;&#x5E01;&#x7ECF;&#x5E38;&#x88AB;&#x8BDF;&#x75C5;&#x7684;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#x5C31;&#x662F;&#x5176;&#x4EF7;&#x683C;&#x7684;&#x6CE2;&#x52A8;&#x6027;&#xFF1B;&#x867D;&#x7136;&#x5927;&#x91CF;&#x7684;&#x7528;&#x6237;&#x548C;&#x5546;&#x5BB6;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x5BC6;&#x7801;&#x5B66;&#x8D44;&#x4EA7;&#x6240;&#x5E26;&#x6765;&#x7684;&#x5B89;&#x5168;&#x548C;&#x4FBF;&#x5229;&#xFF0C;&#x53EF;&#x4ED6;&#x4EEC;&#x4E0D;&#x592A;&#x4F1A;&#x4E50;&#x610F;&#x9762;&#x5BF9;&#x4E00;&#x5929;&#x4E2D;&#x8D44;&#x4EA7;&#x8DCC;&#x53BB;23%&#x4EF7;&#x503C;&#x7684;&#x60C5;&#x5F62;&#x3002;&#x76F4;&#x5230;&#x73B0;&#x5728;&#xFF0C;&#x6700;&#x4E3A;&#x5E38;&#x89C1;&#x7684;&#x63A8;&#x8350;&#x65B9;&#x6848;&#x662F;&#x53D1;&#x884C;&#x8005;&#x80CC;&#x4E66;&#x8D44;&#x4EA7;&#xFF1B;&#x601D;&#x60F3;&#x662F;&#x53D1;&#x884C;&#x8005;&#x521B;&#x5EFA;&#x4E00;&#x79CD;&#x5B50;&#x8D27;&#x5E01;&#xFF0C;&#x5BF9;&#x6B64;&#x79CD;&#x5B50;&#x8D27;&#x5E01;&#x4ED6;&#x4EEC;&#x6709;&#x6743;&#x53D1;&#x884C;&#x548C;&#x8D4E;&#x56DE;&#xFF0C;&#x7ED9;&#x4E88;&#xFF08;&#x7EBF;&#x4E0B;&#xFF09;&#x63D0;&#x4F9B;&#x7ED9;&#x4ED6;&#x4EEC;&#x4E00;&#x4E2A;&#x5355;&#x4F4D;&#x7279;&#x5B9A;&#x76F8;&#x5173;&#x8D44;&#x4EA7;&#xFF08;&#x4F8B;&#x5982;&#x9EC4;&#x91D1;&#xFF0C;&#x7F8E;&#x5143;&#xFF09;&#x7684;&#x4EBA;&#x4E00;&#x4E2A;&#x5355;&#x4F4D;&#x5B50;&#x8D27;&#x5E01;&#x3002;&#x53D1;&#x884C;&#x8005;&#x627F;&#x8BFA;&#x5F53;&#x4EFB;&#x4F55;&#x4EBA;&#x9001;&#x8FD8;&#x4E00;&#x4E2A;&#x5355;&#x4F4D;&#x5BC6;&#x7801;&#x5B66;&#x8D44;&#x4EA7;&#x65F6;&#x3002;&#x53D1;&#x8FD8;&#x4E00;&#x4E2A;&#x5355;&#x4F4D;&#x7684;&#x76F8;&#x5173;&#x8D44;&#x4EA7;&#x3002;&#x8FD9;&#x79CD;&#x673A;&#x5236;&#x80FD;&#x591F;&#x4F7F;&#x4EFB;&#x4F55;&#x975E;&#x5BC6;&#x7801;&#x5B66;&#x8D44;&#x4EA7;&#x88AB;&#x201C;&#x5347;&#x7EA7;&#x201C;&#x4E3A;&#x5BC6;&#x7801;&#x5B66;&#x8D44;&#x4EA7;&#xFF0C;&#x5982;&#x679C;&#x53D1;&#x884C;&#x8005;&#x503C;&#x5F97;&#x4FE1;&#x4EFB;&#x7684;&#x8BDD;&#x3002;</p>
<p>&#x7136;&#x800C;&#x5B9E;&#x8DF5;&#x4E2D;&#x53D1;&#x884C;&#x8005;&#x5E76;&#x975E;&#x603B;&#x662F;&#x503C;&#x5F97;&#x4FE1;&#x4EFB;&#x7684;&#xFF0C;&#x5E76;&#x4E14;&#x4E00;&#x4E9B;&#x60C5;&#x51B5;&#x4E0B;&#x94F6;&#x884C;&#x4F53;&#x7CFB;&#x592A;&#x8106;&#x5F31;&#xFF0C;&#x6216;&#x8005;&#x4E0D;&#x591F;&#x8BDA;&#x5B9E;&#x5B88;&#x4FE1;&#x4ECE;&#x800C;&#x4F7F;&#x8FD9;&#x6837;&#x7684;&#x670D;&#x52A1;&#x65E0;&#x6CD5;&#x5B58;&#x5728;&#x3002;&#x91D1;&#x878D;&#x884D;&#x751F;&#x54C1;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x79CD;&#x66FF;&#x4EE3;&#x65B9;&#x6848;&#x3002;&#x8FD9;&#x91CC;&#x5C06;&#x4E0D;&#x518D;&#x6709;&#x63D0;&#x4F9B;&#x50A8;&#x5907;&#x4EE5;&#x652F;&#x6491;&#x4E00;&#x79CD;&#x8D44;&#x4EA7;&#x7684;&#x5355;&#x72EC;&#x7684;&#x53D1;&#x884C;&#x8005;&#xFF0C;&#x53D6;&#x800C;&#x4EE3;&#x4E4B;&#x7684;&#x662F;&#x4E00;&#x4E2A;&#x7531;&#x8D4C;&#x4E00;&#x79CD;&#x5BC6;&#x7801;&#x5B66;&#x8D44;&#x4EA7;&#x7684;&#x4EF7;&#x683C;&#x4F1A;&#x4E0A;&#x5347;&#x7684;&#x6295;&#x673A;&#x8005;&#x6784;&#x6210;&#x7684;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x5E02;&#x573A;&#x3002;&#x4E0E;&#x53D1;&#x884C;&#x8005;&#x4E0D;&#x540C;&#xFF0C;&#x6295;&#x673A;&#x8005;&#x4E00;&#x65B9;&#x6CA1;&#x6709;&#x8BA8;&#x4EF7;&#x8FD8;&#x4EF7;&#x7684;&#x6743;&#x5229;&#xFF0C;&#x56E0;&#x4E3A;&#x5BF9;&#x51B2;&#x5408;&#x7EA6;&#x628A;&#x4ED6;&#x4EEC;&#x7684;&#x50A8;&#x5907;&#x51BB;&#x7ED3;&#x5728;&#x4E86;&#x5951;&#x7EA6;&#x4E2D;&#x3002;&#x6CE8;&#x610F;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x5E76;&#x975E;&#x662F;&#x5B8C;&#x5168;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x4F9D;&#x7136;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x53EF;&#x4FE1;&#x4EFB;&#x7684;&#x63D0;&#x4F9B;&#x4EF7;&#x683C;&#x4FE1;&#x606F;&#x7684;&#x6570;&#x636E;&#x6E90;&#xFF0C;&#x5C3D;&#x7BA1;&#x4F9D;&#x7136;&#x6709;&#x4E89;&#x8BAE;&#x8FD9;&#x4F9D;&#x7136;&#x662F;&#x5728;&#x964D;&#x4F4E;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x9700;&#x6C42;&#xFF08;&#x4E0E;&#x53D1;&#x884C;&#x8005;&#x4E0D;&#x540C;&#xFF0C;&#x4E00;&#x4E2A;&#x4EF7;&#x683C;&#x53D1;&#x5E03;&#x5668;&#x4E0D;&#x9700;&#x8981;&#x724C;&#x7167;&#x5E76;&#x4E14;&#x4F3C;&#x4E4E;&#x53EF;&#x5F52;&#x4E3A;&#x81EA;&#x7531;&#x8A00;&#x8BBA;&#x4E00;&#x7C7B;&#xFF09;&#x548C;&#x964D;&#x4F4E;&#x6F5C;&#x5728;&#x6B3A;&#x8BC8;&#x98CE;&#x9669;&#x65B9;&#x9762;&#x7684;&#x4E00;&#x4E2A;&#x5DE8;&#x5927;&#x7684;&#x8FDB;&#x6B65;&#x3002;</p>
<h3 id="&#x8EAB;&#x4EFD;&#x548C;&#x4FE1;&#x8A89;&#x7CFB;&#x7EDF;">&#x8EAB;&#x4EFD;&#x548C;&#x4FE1;&#x8A89;&#x7CFB;&#x7EDF;</h3>
<p>&#x6700;&#x65E9;&#x7684;&#x66FF;&#x4EE3;&#x5E01;&#xFF0C;&#x57DF;&#x540D;&#x5E01;&#xFF0C;&#x5C1D;&#x8BD5;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x7C7B;&#x6BD4;&#x7279;&#x5E01;&#x5757;&#x94FE;&#x6765;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x540D;&#x79F0;&#x6CE8;&#x518C;&#x7CFB;&#x7EDF;&#xFF0C;&#x5728;&#x90A3;&#x91CC;&#x7528;&#x6237;&#x53EF;&#x4EE5;&#x5C06;&#x4ED6;&#x4EEC;&#x7684;&#x540D;&#x79F0;&#x548C;&#x5176;&#x5B83;&#x6570;&#x636E;&#x4E00;&#x8D77;&#x5728;&#x4E00;&#x4E2A;&#x516C;&#x5171;&#x6570;&#x636E;&#x5E93;&#x6CE8;&#x518C;&#x3002;&#x6700;&#x5E38;&#x7528;&#x7684;&#x5E94;&#x7528;&#x6848;&#x4F8B;&#x628A;&#x8C61;&#x201C;bitcoin.org&#x201C;&#xFF08;&#x6216;&#x8005;&#x518D;&#x57DF;&#x540D;&#x5E01;&#x4E2D;&#xFF0C;&#x201D;bitcoin.bit&#x201C;&#xFF09;&#x4E00;&#x6837;&#x7684;&#x57DF;&#x540D;&#x4E0E;&#x4E00;&#x4E2A;IP&#x5730;&#x5740;&#x5BF9;&#x5E94;&#x7684;&#x57DF;&#x540D;&#x7CFB;&#x7EDF;&#x3002;&#x5176;&#x5B83;&#x7684;&#x5E94;&#x7528;&#x6848;&#x4F8B;&#x5305;&#x62EC;&#x7535;&#x5B50;&#x90AE;&#x4EF6;&#x9A8C;&#x8BC1;&#x7CFB;&#x7EDF;&#x548C;&#x6F5C;&#x5728;&#x7684;&#x66F4;&#x5148;&#x8FDB;&#x7684;&#x4FE1;&#x8A89;&#x7CFB;&#x7EDF;&#x3002;&#x8FD9;&#x91CC;&#x662F;&#x4EE5;&#x592A;&#x574A;&#x4E2D;&#x63D0;&#x4F9B;&#x4E0E;&#x57DF;&#x540D;&#x5E01;&#x7C7B;&#x4F3C;&#x7684;&#x7684;&#x540D;&#x79F0;&#x6CE8;&#x518C;&#x7CFB;&#x7EDF;&#x7684;&#x57FA;&#x7840;&#x5408;&#x7EA6;&#xFF1A;</p>
<pre><code>if !contract.storage[tx.data[0]]:

contract.storage[tx.data[0]] = tx.data[1]
</code></pre><p>&#x5408;&#x7EA6;&#x975E;&#x5E38;&#x7B80;&#x5355;&#xFF1B;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x4EE5;&#x592A;&#x574A;&#x7F51;&#x7EDC;&#x4E2D;&#x7684;&#x53EF;&#x4EE5;&#x88AB;&#x6DFB;&#x52A0;&#x4F46;&#x4E0D;&#x80FD;&#x88AB;&#x4FEE;&#x6539;&#x6216;&#x79FB;&#x9664;&#x7684;&#x6570;&#x636E;&#x5E93;&#x3002;&#x4EFB;&#x4F55;&#x4EBA;&#x90FD;&#x53EF;&#x4EE5;&#x628A;&#x4E00;&#x4E2A;&#x540D;&#x79F0;&#x6CE8;&#x518C;&#x4E3A;&#x4E00;&#x4E2A;&#x503C;&#x5E76;&#x6C38;&#x8FDC;&#x4E0D;&#x53D8;&#x3002;&#x4E00;&#x4E2A;&#x66F4;&#x590D;&#x6742;&#x7684;&#x540D;&#x79F0;&#x6CE8;&#x518C;&#x5408;&#x7EA6;&#x5C06;&#x5305;&#x542B;&#x5141;&#x8BB8;&#x5176;&#x4ED6;&#x5408;&#x7EA6;&#x67E5;&#x8BE2;&#x7684;&#x201C;&#x529F;&#x80FD;&#x6761;&#x6B3E;&#x201C;&#xFF0C;&#x4EE5;&#x53CA;&#x4E00;&#x4E2A;&#x8BA9;&#x4E00;&#x4E2A;&#x540D;&#x79F0;&#x7684;&#x201D;&#x62E5;&#x6709;&#x8005;&#x201C;&#xFF08;&#x5373;&#x7B2C;&#x4E00;&#x4E2A;&#x6CE8;&#x518C;&#x8005;&#xFF09;&#x4FEE;&#x6539;&#x6570;&#x636E;&#x6216;&#x8005;&#x8F6C;&#x8BA9;&#x6240;&#x6709;&#x6743;&#x7684;&#x673A;&#x5236;&#x3002;&#x751A;&#x81F3;&#x53EF;&#x4EE5;&#x5728;&#x5176;&#x4E0A;&#x6DFB;&#x52A0;&#x4FE1;&#x8A89;&#x548C;&#x4FE1;&#x4EFB;&#x7F51;&#x7EDC;&#x529F;&#x80FD;&#x3002;</p>
<h3 id="&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x5B58;&#x50A8;">&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x5B58;&#x50A8;</h3>
<p>&#x5728;&#x8FC7;&#x53BB;&#x7684;&#x51E0;&#x5E74;&#x91CC;&#x51FA;&#x73B0;&#x4E86;&#x4E00;&#x4E9B;&#x5927;&#x4F17;&#x5316;&#x7684;&#x5728;&#x7EBF;&#x6587;&#x4EF6;&#x5B58;&#x50A8;&#x521D;&#x521B;&#x516C;&#x53F8;&#xFF0C;&#x6700;&#x7A81;&#x51FA;&#x7684;&#x662F;Dropbox&#xFF0C;&#x5B83;&#x5BFB;&#x6C42;&#x5141;&#x8BB8;&#x7528;&#x6237;&#x4E0A;&#x4F20;&#x4ED6;&#x4EEC;&#x7684;&#x786C;&#x76D8;&#x5907;&#x4EFD;&#xFF0C;&#x63D0;&#x4F9B;&#x5907;&#x4EFD;&#x5B58;&#x50A8;&#x670D;&#x52A1;&#x5E76;&#x5141;&#x8BB8;&#x7528;&#x6237;&#x8BBF;&#x95EE;&#x4ECE;&#x800C;&#x6309;&#x6708;&#x5411;&#x7528;&#x6237;&#x6536;&#x53D6;&#x8D39;&#x7528;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x5728;&#x8FD9;&#x4E00;&#x70B9;&#x4E0A;&#x8FD9;&#x4E2A;&#x6587;&#x4EF6;&#x5B58;&#x50A8;&#x5E02;&#x573A;&#x6709;&#x65F6;&#x76F8;&#x5BF9;&#x4F4E;&#x6548;&#xFF1B;&#x5BF9;&#x73B0;&#x5B58;&#x670D;&#x52A1;&#x7684;&#x7C97;&#x7565;&#x89C2;&#x5BDF;&#x8868;&#x660E;&#xFF0C;&#x7279;&#x522B;&#x5730;&#x5728;&#x201C;&#x795E;&#x79D8;&#x8C37;&#x201C;20-200GB&#x8FD9;&#x4E00;&#x65E2;&#x6CA1;&#x6709;&#x514D;&#x8D39;&#x7A7A;&#x95F4;&#x4E5F;&#x6CA1;&#x6709;&#x4F01;&#x4E1A;&#x7EA7;&#x7528;&#x6237;&#x6298;&#x6263;&#x7684;&#x6C34;&#x5E73;&#x4E0A;&#xFF0C;&#x4E3B;&#x6D41;&#x6587;&#x4EF6;&#x5B58;&#x50A8;&#x6210;&#x672C;&#x6BCF;&#x6708;&#x7684;&#x4EF7;&#x683C;&#x610F;&#x5473;&#x7740;&#x652F;&#x4ED8;&#x5728;&#x4E00;&#x4E2A;&#x6708;&#x91CC;&#x652F;&#x4ED8;&#x6574;&#x4E2A;&#x786C;&#x76D8;&#x7684;&#x6210;&#x672C;&#x3002;&#x4EE5;&#x592A;&#x574A;&#x5408;&#x7EA6;&#x5141;&#x8BB8;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x5B58;&#x50A8;&#x751F;&#x6001;&#x7684;&#x5F00;&#x53D1;&#xFF0C;&#x8FD9;&#x6837;&#x7528;&#x6237;&#x901A;&#x8FC7;&#x5C06;&#x4ED6;&#x4EEC;&#x81EA;&#x5DF1;&#x7684;&#x786C;&#x76D8;&#x6216;&#x672A;&#x7528;&#x7684;&#x7F51;&#x7EDC;&#x7A7A;&#x95F4;&#x79DF;&#x51FA;&#x53BB;&#x4EE5;&#x83B7;&#x5F97;&#x5C11;&#x91CF;&#x6536;&#x76CA;&#xFF0C;&#x4ECE;&#x800C;&#x964D;&#x4F4E;&#x4E86;&#x6587;&#x4EF6;&#x5B58;&#x50A8;&#x7684;&#x6210;&#x672C;&#x3002;</p>
<p>&#x8FD9;&#x6837;&#x7684;&#x8BBE;&#x65BD;&#x7684;&#x57FA;&#x7840;&#x6027;&#x6784;&#x4EF6;&#x5C31;&#x662F;&#x6211;&#x4EEC;&#x6240;&#x8C13;&#x7684;&#x201C;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;Dropbox&#x5408;&#x7EA6;&#x201C;&#x3002;&#x8FD9;&#x4E2A;&#x5408;&#x7EA6;&#x5DE5;&#x4F5C;&#x539F;&#x7406;&#x5982;&#x4E0B;&#x3002;&#x9996;&#x5148;&#xFF0C;&#x67D0;&#x4EBA;&#x5C06;&#x9700;&#x8981;&#x4E0A;&#x4F20;&#x7684;&#x6570;&#x636E;&#x5206;&#x6210;&#x5757;&#xFF0C;&#x5BF9;&#x6BCF;&#x4E00;&#x5757;&#x6570;&#x636E;&#x52A0;&#x5BC6;&#x4EE5;&#x4FDD;&#x62A4;&#x9690;&#x79C1;&#xFF0C;&#x5E76;&#x4E14;&#x4EE5;&#x6B64;&#x6784;&#x5EFA;&#x4E00;&#x4E2A;&#x9ED8;&#x514B;&#x5C14;&#x6811;&#x3002;&#x7136;&#x540E;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x542B;&#x4EE5;&#x4E0B;&#x89C4;&#x5219;&#x7684;&#x5408;&#x7EA6;&#xFF0C;&#x6BCF;N&#x4E2A;&#x5757;&#xFF0C;&#x5408;&#x7EA6;&#x5C06;&#x4ECE;&#x9ED8;&#x514B;&#x5C14;&#x6811;&#x4E2D;&#x62BD;&#x53D6;&#x4E00;&#x4E2A;&#x968F;&#x673A;&#x7D22;&#x5F15;&#xFF08;&#x4F7F;&#x7528;&#x80FD;&#x591F;&#x88AB;&#x5408;&#x7EA6;&#x4EE3;&#x7801;&#x8BBF;&#x95EE;&#x7684;&#x4E0A;&#x4E00;&#x4E2A;&#x5757;&#x7684;&#x54C8;&#x5E0C;&#x6765;&#x63D0;&#x4F9B;&#x968F;&#x673A;&#x6027;&#xFF09;&#xFF0C;   &#x7136;&#x540E;&#x7ED9;&#x7B2C;&#x4E00;&#x4E2A;&#x5B9E;&#x4F53;X&#x4EE5;&#x592A;&#x4EE5;&#x652F;&#x6491;&#x4E00;&#x4E2A;&#x5E26;&#x6709;&#x7C7B;&#x4F3C;&#x7B80;&#x5316;&#x9A8C;&#x8BC1;&#x652F;&#x4ED8;&#xFF08;SPV&#xFF09;&#x7684;&#x5728;&#x6811;&#x4E2D;&#x7279;&#x5B9A;&#x7D22;&#x5F15;&#x5904;&#x7684;&#x5757;&#x7684;&#x6240;&#x6709;&#x6743;&#x8BC1;&#x660E;&#x3002;&#x5F53;&#x4E00;&#x4E2A;&#x7528;&#x6237;&#x60F3;&#x91CD;&#x65B0;&#x4E0B;&#x8F7D;&#x4ED6;&#x7684;&#x6587;&#x4EF6;&#xFF0C;&#x4ED6;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5FAE;&#x652F;&#x4ED8;&#x901A;&#x9053;&#x534F;&#x8BAE;&#xFF08;&#x4F8B;&#x5982;&#x6BCF;32k&#x5B57;&#x8282;&#x652F;&#x4ED8;1&#x8428;&#x535A;&#xFF09;&#x6062;&#x590D;&#x6587;&#x4EF6;&#xFF1B;&#x4ECE;&#x8D39;&#x7528;&#x4E0A;&#x8BB2;&#x6700;&#x9AD8;&#x6548;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#x652F;&#x4ED8;&#x8005;&#x4E0D;&#x5230;&#x6700;&#x540E;&#x4E0D;&#x53D1;&#x5E03;&#x4EA4;&#x6613;&#xFF0C;&#x800C;&#x662F;&#x7528;&#x4E00;&#x4E2A;&#x7565;&#x5FAE;&#x66F4;&#x5408;&#x7B97;&#x7684;&#x5E26;&#x6709;&#x540C;&#x6837;&#x968F;&#x673A;&#x6570;&#x7684;&#x4EA4;&#x6613;&#x5728;&#x6BCF;32k&#x5B57;&#x8282;&#x4E4B;&#x540E;&#x6765;&#x4EE3;&#x66FF;&#x539F;&#x4EA4;&#x6613;&#x3002;</p>
<p>&#x8FD9;&#x4E2A;&#x534F;&#x8BAE;&#x7684;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x7279;&#x5F81;&#x662F;&#xFF0C;&#x867D;&#x7136;&#x770B;&#x8D77;&#x6765;&#x8C61;&#x662F;&#x4E00;&#x4E2A;&#x4EBA;&#x4FE1;&#x4EFB;&#x8BB8;&#x591A;&#x4E0D;&#x51C6;&#x5907;&#x4E22;&#x5931;&#x6587;&#x4EF6;&#x7684;&#x968F;&#x673A;&#x8282;&#x70B9;&#xFF0C;&#x4F46;&#x662F;&#x4ED6;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x79D8;&#x5BC6;&#x5206;&#x4EAB;&#x628A;&#x6587;&#x4EF6;&#x5206;&#x6210;&#x8BB8;&#x591A;&#x5C0F;&#x5757;&#xFF0C;&#x7136;&#x540E;&#x901A;&#x8FC7;&#x76D1;&#x89C6;&#x5408;&#x540C;&#x5F97;&#x77E5;&#x6BCF;&#x4E2A;&#x5C0F;&#x5757;&#x90FD;&#x8FD8;&#x88AB;&#x67D0;&#x4E2A;&#x8282;&#x70B9;&#x7684;&#x4FDD;&#x5B58;&#x7740;&#x3002;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x5408;&#x7EA6;&#x4F9D;&#x7136;&#x5728;&#x4ED8;&#x6B3E;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x63D0;&#x4F9B;&#x4E86;&#x67D0;&#x4E2A;&#x4EBA;&#x4F9D;&#x7136;&#x5728;&#x4FDD;&#x5B58;&#x6587;&#x4EF6;&#x7684;&#x8BC1;&#x636E;&#x3002;</p>
<h3 id="&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x81EA;&#x6CBB;&#x7EC4;&#x7EC7;&#xFF08;dao&#xFF09;">&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x81EA;&#x6CBB;&#x7EC4;&#x7EC7;&#xFF08;DAO&#xFF09;</h3>
<p>&#x901A;&#x5E38;&#x610F;&#x4E49;&#x4E0A;&#x201C;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x81EA;&#x6CBB;&#x7EC4;&#x7EC7;&#xFF08;DAO, decentralized autonomous  organization&#xFF09;&#x201D;&#x7684;&#x6982;&#x5FF5;&#x6307;&#x7684;&#x662F;&#x4E00;&#x4E2A;&#x62E5;&#x6709;&#x4E00;&#x5B9A;&#x6570;&#x91CF;&#x6210;&#x5458;&#x6216;&#x80A1;&#x4E1C;&#x7684;&#x865A;&#x62DF;&#x5B9E;&#x4F53;&#xFF0C;&#x4F9D;&#x9760;&#x6BD4;&#x5982;67%&#x591A;&#x6570;&#x6765;&#x51B3;&#x5B9A;&#x82B1;&#x94B1;&#x4EE5;&#x53CA;&#x4FEE;&#x6539;&#x4EE3;&#x7801;&#x3002;&#x6210;&#x5458;&#x4F1A;&#x96C6;&#x4F53;&#x51B3;&#x5B9A;&#x7EC4;&#x7EC7;&#x5982;&#x4F55;&#x5206;&#x914D;&#x8D44;&#x91D1;&#x3002;&#x5206;&#x914D;&#x8D44;&#x91D1;&#x7684;&#x65B9;&#x6CD5;&#x53EF;&#x80FD;&#x662F;&#x60AC;&#x8D4F;&#xFF0C;&#x5DE5;&#x8D44;&#x6216;&#x8005;&#x66F4;&#x6709;&#x5438;&#x5F15;&#x529B;&#x7684;&#x673A;&#x5236;&#x6BD4;&#x5982;&#x7528;&#x5185;&#x90E8;&#x8D27;&#x5E01;&#x5956;&#x52B1;&#x5DE5;&#x4F5C;&#x3002;&#x8FD9;&#x4EC5;&#x4EC5;&#x4F7F;&#x7528;&#x5BC6;&#x7801;&#x5B66;&#x5757;&#x94FE;&#x6280;&#x672F;&#x5C31;&#x4ECE;&#x6839;&#x672C;&#x4E0A;&#x590D;&#x5236;&#x4E86;&#x4F20;&#x7EDF;&#x516C;&#x53F8;&#x6216;&#x8005;&#x975E;&#x8425;&#x5229;&#x7EC4;&#x7EC7;&#x7684;&#x6CD5;&#x5F8B;&#x610F;&#x4E49;&#x4EE5;&#x5B9E;&#x73B0;&#x5F3A;&#x5236;&#x6267;&#x884C;&#x3002;&#x81F3;&#x6B64;&#x8BB8;&#x591A;&#x56F4;&#x7ED5;DAO&#x7684;&#x8BA8;&#x8BBA;&#x90FD;&#x662F;&#x56F4;&#x7ED5;&#x4E00;&#x4E2A;&#x5E26;&#x6709;&#x63A5;&#x53D7;&#x5206;&#x7EA2;&#x7684;&#x80A1;&#x4E1C;&#x548C;&#x53EF;&#x4EA4;&#x6613;&#x7684;&#x80A1;&#x4EFD;&#x7684;&#x201C;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x81EA;&#x6CBB;&#x516C;&#x53F8;&#xFF08;DAC&#xFF0C;decentralized  autonomous corporation&#xFF09;&#x201D;&#x7684;&#x201C;&#x8D44;&#x672C;&#x5BB6;&#x201D;&#x6A21;&#x5F0F;&#xFF1B;&#x4F5C;&#x4E3A;&#x66FF;&#x4EE3;&#x8005;&#xFF0C;&#x4E00;&#x4E2A;&#x88AB;&#x63CF;&#x8FF0;&#x4E3A;&#x201C;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x81EA;&#x6CBB;&#x793E;&#x533A;&#xFF08;decentralized  autonomous  community&#xFF09;&#x201D;&#x7684;&#x5B9E;&#x4F53;&#x5C06;&#x4F7F;&#x6240;&#x6709;&#x6210;&#x5458;&#x90FD;&#x5728;&#x51B3;&#x7B56;&#x4E0A;&#x62E5;&#x6709;&#x540C;&#x7B49;&#x7684;&#x6743;&#x5229;&#x5E76;&#x4E14;&#x5728;&#x589E;&#x51CF;&#x6210;&#x5458;&#x65F6;&#x8981;&#x6C42;67%&#x591A;&#x6570;&#x540C;&#x610F;&#x3002;&#x6BCF;&#x4E2A;&#x4EBA;&#x90FD;&#x53EA;&#x80FD;&#x62E5;&#x6709;&#x4E00;&#x4E2A;&#x6210;&#x5458;&#x8D44;&#x683C;&#x8FD9;&#x4E00;&#x89C4;&#x5219;&#x9700;&#x8981;&#x88AB;&#x7FA4;&#x4F53;&#x5F3A;&#x5236;&#x5B9E;&#x65BD;&#x3002;</p>
<p>&#x4E0B;&#x9762;&#x662F;&#x4E00;&#x4E2A;&#x5982;&#x4F55;&#x7528;&#x4EE3;&#x7801;&#x5B9E;&#x73B0;DO&#x7684;&#x7EB2;&#x8981;&#x3002;&#x6700;&#x7B80;&#x5355;&#x7684;&#x8BBE;&#x8BA1;&#x5C31;&#x662F;&#x4E00;&#x6BB5;&#x5982;&#x679C;&#x4E09;&#x5206;&#x4E4B;&#x4E8C;&#x6210;&#x5458;&#x540C;&#x610F;&#x5C31;&#x53EF;&#x4EE5;&#x81EA;&#x6211;&#x4FEE;&#x6539;&#x7684;&#x4EE3;&#x7801;&#x3002;&#x867D;&#x7136;&#x7406;&#x8BBA;&#x4E0A;&#x4EE3;&#x7801;&#x662F;&#x4E0D;&#x53EF;&#x66F4;&#x6539;&#x7684;&#xFF0C;&#x7136;&#x800C;&#x901A;&#x8FC7;&#x628A;&#x4EE3;&#x7801;&#x4E3B;&#x5E72;&#x653E;&#x5728;&#x4E00;&#x4E2A;&#x5355;&#x72EC;&#x7684;&#x5408;&#x7EA6;&#x5185;&#x5E76;&#x4E14;&#x628A;&#x5408;&#x7EA6;&#x8C03;&#x7528;&#x7684;&#x5730;&#x5740;&#x6307;&#x5411;&#x4E00;&#x4E2A;&#x53EF;&#x66F4;&#x6539;&#x7684;&#x5B58;&#x50A8;&#x4F9D;&#x7136;&#x53EF;&#x4EE5;&#x5BB9;&#x6613;&#x5730;&#x7ED5;&#x5F00;&#x969C;&#x788D;&#x800C;&#x4F7F;&#x4EE3;&#x7801;&#x53D8;&#x5F97;&#x53EF;&#x4FEE;&#x6539;&#xFF0C;&#x5728;&#x4E00;&#x4E2A;&#x8FD9;&#x6837;&#x7684;DAO&#x5408;&#x7EA6;&#x7684;&#x7B80;&#x5355;&#x5B9E;&#x73B0;&#x4E2D;&#x6709;&#x4E09;&#x79CD;&#x4EA4;&#x6613;&#x7C7B;&#x578B;&#xFF0C;&#x7531;&#x4EA4;&#x6613;&#x63D0;&#x4F9B;&#x7684;&#x6570;&#x636E;&#x533A;&#x5206;&#xFF1A;</p>
<ul>
<li>[0,i,K,V] &#x6CE8;&#x518C;&#x7D22;&#x5F15;&#x4E3A;i &#x7684;&#x5BF9;&#x5B58;&#x50A8;&#x5730;&#x5740;&#x7D22;&#x5F15;&#x4E3A;K &#x81F3; v &#x7684;&#x5185;&#x5BB9;&#x7684;&#x66F4;&#x6539;&#x5EFA;&#x8BAE;&#x3002;</li>
<li>[0,i] &#x6CE8;&#x518C;&#x5BF9;&#x5EFA;&#x8BAE;i &#x7684;&#x6295;&#x7968;&#x3002;</li>
<li>[2,i] &#x5982;&#x6709;&#x8DB3;&#x591F;&#x6295;&#x7968;&#x5219;&#x786E;&#x8BA4;&#x5EFA;&#x8BAE;i&#x3002;</li>
</ul>
<p>&#x7136;&#x540E;&#x5408;&#x7EA6;&#x5BF9;&#x6BCF;&#x4E00;&#x9879;&#x90FD;&#x6709;&#x5177;&#x4F53;&#x7684;&#x6761;&#x6B3E;&#x3002;&#x5B83;&#x5C06;&#x7EF4;&#x62A4;&#x4E00;&#x4E2A;&#x6240;&#x6709;&#x5F00;&#x653E;&#x5B58;&#x50A8;&#x7684;&#x66F4;&#x6539;&#x8BB0;&#x5F55;&#x4EE5;&#x53CA;&#x4E00;&#x4E2A;&#x8C01;&#x6295;&#x7968;&#x8868;&#x51B3;&#x7684;&#x8868;&#x3002;&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x6240;&#x6709;&#x6210;&#x5458;&#x7684;&#x8868;&#x3002;&#x5F53;&#x4EFB;&#x4F55;&#x5B58;&#x50A8;&#x5185;&#x5BB9;&#x7684;&#x66F4;&#x6539;&#x83B7;&#x5F97;&#x4E86;&#x4E09;&#x5206;&#x4E4B;&#x4E8C;&#x591A;&#x6570;&#x540C;&#x610F;&#xFF0C;&#x4E00;&#x4E2A;&#x6700;&#x7EC8;&#x7684;&#x4EA4;&#x6613;&#x5C06;&#x6267;&#x884C;&#x8FD9;&#x9879;&#x66F4;&#x6539;&#x3002;&#x4E00;&#x4E2A;&#x66F4;&#x52A0;&#x590D;&#x6742;&#x7684;&#x6846;&#x67B6;&#x4F1A;&#x589E;&#x52A0;&#x5185;&#x7F6E;&#x7684;&#x9009;&#x4E3E;&#x529F;&#x80FD;&#x4EE5;&#x5B9E;&#x73B0;&#x5982;&#x53D1;&#x9001;&#x4EA4;&#x6613;&#xFF0C;&#x589E;&#x51CF;&#x6210;&#x5458;&#xFF0C;&#x751A;&#x81F3;&#x63D0;&#x4F9B;&#x59D4;&#x4EFB;&#x5236;&#x6C11;&#x4E3B;&#x4E00;&#x7C7B;&#x7684;&#x6295;&#x7968;&#x4EE3;&#x8868;&#xFF08;&#x5373;&#x4EFB;&#x4F55;&#x4EBA;&#x90FD;&#x53EF;&#x4EE5;&#x59D4;&#x6258;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x4EBA;&#x6765;&#x4EE3;&#x8868;&#x81EA;&#x5DF1;&#x6295;&#x7968;&#xFF0C;&#x800C;&#x4E14;&#x8FD9;&#x79CD;&#x59D4;&#x6258;&#x5173;&#x7CFB;&#x662F;&#x53EF;&#x4EE5;&#x4F20;&#x9012;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x5982;&#x679C;A&#x59D4;&#x6258;&#x4E86;B&#x7136;&#x540E;B&#x59D4;&#x6258;&#x4E86;C&#x90A3;&#x4E48;C&#x5C06;&#x51B3;&#x5B9A;A&#x7684;&#x6295;&#x7968;&#xFF09;&#x3002;&#x8FD9;&#x79CD;&#x8BBE;&#x8BA1;&#x5C06;&#x4F7F;DAO&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x793E;&#x533A;&#x6709;&#x673A;&#x5730;&#x6210;&#x957F;&#xFF0C;  &#x4F7F;&#x4EBA;&#x4EEC;&#x6700;&#x7EC8;&#x80FD;&#x591F;&#x628A;&#x6311;&#x9009;&#x5408;&#x9002;&#x4EBA;&#x9009;&#x7684;&#x4EFB;&#x52A1;&#x4EA4;&#x7ED9;&#x4E13;&#x5BB6;&#xFF0C;&#x4E0E;&#x5F53;&#x524D;&#x7CFB;&#x7EDF;&#x4E0D;&#x540C;&#xFF0C;&#x968F;&#x7740;&#x793E;&#x533A;&#x6210;&#x5458;&#x4E0D;&#x65AD;&#x6539;&#x53D8;&#x4ED6;&#x4EEC;&#x7684;&#x7AD9;&#x961F;&#x5047;&#x4EE5;&#x65F6;&#x65E5;&#x4E13;&#x5BB6;&#x4F1A;&#x5BB9;&#x6613;&#x5730;&#x51FA;&#x73B0;&#x548C;&#x6D88;&#x5931;&#x3002;</p>
<p>&#x4E00;&#x4E2A;&#x66FF;&#x4EE3;&#x7684;&#x6A21;&#x5F0F;&#x662F;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x516C;&#x53F8;&#xFF0C;&#x90A3;&#x91CC;&#x4EFB;&#x4F55;&#x8D26;&#x6237;&#x53EF;&#x4EE5;&#x62E5;&#x6709;0&#x5230;&#x66F4;&#x591A;&#x7684;&#x80A1;&#x4EFD;&#xFF0C;&#x51B3;&#x7B56;&#x9700;&#x8981;&#x4E09;&#x5206;&#x4E4B;&#x4E8C;&#x591A;&#x6570;&#x7684;&#x80A1;&#x4EFD;&#x540C;&#x610F;&#x3002;&#x4E00;&#x4E2A;&#x5B8C;&#x6574;&#x7684;&#x6846;&#x67B6;&#x5C06;&#x5305;&#x62EC;&#x8D44;&#x4EA7;&#x7BA1;&#x7406;&#x529F;&#x80FD;-&#x53EF;&#x4EE5;&#x63D0;&#x4EA4;&#x4E70;&#x5356;&#x80A1;&#x4EFD;&#x7684;&#x8BA2;&#x5355;&#x4EE5;&#x53CA;&#x63A5;&#x53D7;&#x8FD9;&#x79CD;&#x8BA2;&#x5355;&#x7684;&#x529F;&#x80FD;&#xFF08;&#x524D;&#x63D0;&#x662F;&#x5408;&#x7EA6;&#x91CC;&#x6709;&#x8BA2;&#x5355;&#x5339;&#x914D;&#x673A;&#x5236;&#xFF09;&#x3002;&#x4EE3;&#x8868;&#x4F9D;&#x7136;&#x4EE5;&#x59D4;&#x4EFB;&#x5236;&#x6C11;&#x4E3B;&#x7684;&#x65B9;&#x5F0F;&#x5B58;&#x5728;&#xFF0C;&#x4EA7;&#x751F;&#x4E86;&#x201C;&#x8463;&#x4E8B;&#x4F1A;&#x201D;&#x7684;&#x6982;&#x5FF5;&#x3002;</p>
<p>&#x66F4;&#x5148;&#x8FDB;&#x7684;&#x7EC4;&#x7EC7;&#x6CBB;&#x7406;&#x673A;&#x5236;&#x53EF;&#x80FD;&#x4F1A;&#x5728;&#x5C06;&#x6765;&#x5B9E;&#x73B0;&#xFF1B;&#x73B0;&#x5728;&#x4E00;&#x4E2A;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x7EC4;&#x7EC7;&#xFF08;DO&#xFF09;&#x53EF;&#x4EE5;&#x4ECE;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x81EA;&#x6CBB;&#x7EC4;&#x7EC7;&#xFF08;DAO&#xFF09;&#x5F00;&#x59CB;&#x63CF;&#x8FF0;&#x3002;DO&#x548C;DAO&#x7684;&#x533A;&#x522B;&#x662F;&#x6A21;&#x7CCA;&#x7684;&#xFF0C;&#x4E00;&#x4E2A;&#x5927;&#x81F4;&#x7684;&#x5206;&#x5272;&#x7EBF;&#x662F;&#x6CBB;&#x7406;&#x662F;&#x5426;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4E00;&#x4E2A;&#x7C7B;&#x4F3C;&#x653F;&#x6CBB;&#x7684;&#x8FC7;&#x7A0B;&#x6216;&#x8005;&#x4E00;&#x4E2A;&#x201C;&#x81EA;&#x52A8;&#x201D;&#x8FC7;&#x7A0B;&#x5B9E;&#x73B0;&#xFF0C;&#x4E00;&#x4E2A;&#x4E0D;&#x9519;&#x7684;&#x76F4;&#x89C9;&#x6D4B;&#x8BD5;&#x662F;&#x201C;&#x65E0;&#x901A;&#x7528;&#x8BED;&#x8A00;&#x201D;&#x6807;&#x51C6;&#xFF1A;&#x5982;&#x679C;&#x4E24;&#x4E2A;&#x6210;&#x5458;&#x4E0D;&#x8BF4;&#x540C;&#x6837;&#x7684;&#x8BED;&#x8A00;&#x7EC4;&#x7EC7;&#x8FD8;&#x80FD;&#x6B63;&#x5E38;&#x8FD0;&#x884C;&#x5417;&#xFF1F;&#x663E;&#x7136;&#xFF0C;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x4F20;&#x7EDF;&#x7684;&#x6301;&#x80A1;&#x5F0F;&#x516C;&#x53F8;&#x4F1A;&#x5931;&#x8D25;&#xFF0C;&#x800C;&#x50CF;&#x6BD4;&#x7279;&#x5E01;&#x534F;&#x8BAE;&#x8FD9;&#x6837;&#x7684;&#x5374;&#x5F88;&#x53EF;&#x80FD;&#x6210;&#x529F;&#xFF0C;&#x7F57;&#x5BBE;&#xB7;&#x6C49;&#x68EE;&#x7684;&#x201C;futarchy&#x201D;&#xFF0C;&#x4E00;&#x4E2A;&#x901A;&#x8FC7;&#x9884;&#x6D4B;&#x5E02;&#x573A;&#x5B9E;&#x73B0;&#x7EC4;&#x7EC7;&#x5316;&#x6CBB;&#x7406;&#x7684;&#x673A;&#x5236;&#x662F;&#x4E00;&#x4E2A;&#x771F;&#x6B63;&#x7684;&#x8BF4;&#x660E;&#x201C;&#x81EA;&#x6CBB;&#x201D;&#x5F0F;&#x6CBB;&#x7406;&#x53EF;&#x80FD;&#x662F;&#x4EC0;&#x4E48;&#x6837;&#x5B50;&#x7684;&#x597D;&#x4F8B;&#x5B50;&#x3002;&#x6CE8;&#x610F;&#x4E00;&#x4E2A;&#x4EBA;&#x65E0;&#x9700;&#x5047;&#x8BBE;&#x6240;&#x6709;DAO&#x6BD4;&#x6240;&#x6709;DO&#x4F18;&#x8D8A;&#xFF1B;&#x81EA;&#x6CBB;&#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x5728;&#x4E00;&#x4E9B;&#x7279;&#x5B9A;&#x573A;&#x666F;&#x4E0B;&#x6709;&#x5F88;&#x5927;&#x4F18;&#x52BF;&#x7684;&#xFF0C;&#x4F46;&#x5728;&#x5176;&#x5B83;&#x5730;&#x65B9;&#x672A;&#x5FC5;&#x53EF;&#x884C;&#x7684;&#x8303;&#x5F0F;&#xFF0C;&#x8BB8;&#x591A;&#x534A;DAO&#x53EF;&#x80FD;&#x5B58;&#x5728;&#x3002;</p>
<h3 id=""> </h3>
<p>&#x8FDB;&#x4E00;&#x6B65;&#x7684;&#x5E94;&#x7528;</p>
<ol>
<li>&#x50A8;&#x84C4;&#x94B1;&#x5305;&#x3002; 
&#x5047;&#x8BBE;Alice&#x60F3;&#x786E;&#x4FDD;&#x5979;&#x7684;&#x8D44;&#x91D1;&#x5B89;&#x5168;&#xFF0C;&#x4F46;&#x5979;&#x62C5;&#x5FC3;&#x4E22;&#x5931;&#x6216;&#x8005;&#x88AB;&#x9ED1;&#x5BA2;&#x76D7;&#x8D70;&#x79C1;&#x94A5;&#x3002;&#x5979;&#x628A;&#x4EE5;&#x592A;&#x5E01;&#x653E;&#x5230;&#x548C;Bob&#x7B7E;&#x8BA2;&#x7684;&#x4E00;&#x4E2A;&#x5408;&#x7EA6;&#x91CC;&#xFF0C;&#x5982;&#x4E0B;&#x6240;&#x793A;&#xFF0C;&#x8FD9;&#x5408;&#x540C;&#x662F;&#x4E00;&#x4E2A;&#x94F6;&#x884C;&#xFF1A;</li>
</ol>
<pre><code>Alice&#x5355;&#x72EC;&#x6BCF;&#x5929;&#x6700;&#x591A;&#x53EF;&#x63D0;&#x53D6;1%&#x7684;&#x8D44;&#x91D1;&#x3002;
Bob&#x5355;&#x72EC;&#x6BCF;&#x5929;&#x6700;&#x591A;&#x53EF;&#x63D0;&#x53D6;1%&#x7684;&#x8D44;&#x91D1;&#xFF0C;&#x4F46;Alice&#x53EF;&#x4EE5;&#x7528;&#x5979;&#x7684;&#x79C1;&#x94A5;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x4EA4;&#x6613;&#x53D6;&#x6D88;Bob&#x7684;&#x63D0;&#x73B0;&#x6743;&#x9650;&#x3002;
Alice &#x548C; Bob &#x4E00;&#x8D77;&#x53EF;&#x4EE5;&#x4EFB;&#x610F;&#x63D0;&#x53D6;&#x8D44;&#x91D1;&#x3002;
&#x4E00;&#x822C;&#x6765;&#x8BB2;&#xFF0C;&#x6BCF;&#x5929;1%&#x5BF9;Alice&#x8DB3;&#x591F;&#x4E86;&#xFF0C;&#x5982;&#x679C;Alice&#x60F3;&#x63D0;&#x73B0;&#x66F4;&#x591A;&#x5979;&#x53EF;&#x4EE5;&#x8054;&#x7CFB;Bob&#x5BFB;&#x6C42;&#x5E2E;&#x52A9;&#x3002;&#x5982;&#x679C;Alice&#x7684;&#x79C1;&#x94A5;&#x88AB;&#x76D7;&#xFF0C;&#x5979;&#x53EF;&#x4EE5;&#x7ACB;&#x5373;&#x627E;&#x5230;Bob&#x628A;&#x5979;&#x7684;&#x8D44;&#x91D1;&#x8F6C;&#x79FB;&#x5230;&#x4E00;&#x4E2A;&#x65B0;&#x5408;&#x540C;&#x91CC;&#x3002;&#x5982;&#x679C;&#x5979;&#x5F04;&#x4E22;&#x4E86;&#x5979;&#x7684;&#x79C1;&#x94A5;&#xFF0C;Bob&#x53EF;&#x4EE5;&#x6162;&#x6162;&#x5730;&#x628A;&#x94B1;&#x63D0;&#x51FA;&#x3002;&#x5982;&#x679C;Bob&#x8868;&#x73B0;&#x51FA;&#x4E86;&#x6076;&#x610F;&#xFF0C;&#x5979;&#x53EF;&#x4EE5;&#x5173;&#x6389;&#x4ED6;&#x7684;&#x63D0;&#x73B0;&#x6743;&#x9650;&#x3002;
</code></pre><ol>
<li><p>&#x4F5C;&#x7269;&#x4FDD;&#x9669;&#x3002;&#x4E00;&#x4E2A;&#x4EBA;&#x53EF;&#x4EE5;&#x5F88;&#x5BB9;&#x6613;&#x5730;&#x4EE5;&#x5929;&#x6C14;&#x60C5;&#x51B5;&#x800C;&#x4E0D;&#x662F;&#x4EFB;&#x4F55;&#x4EF7;&#x683C;&#x6307;&#x6570;&#x4F5C;&#x4E3A;&#x6570;&#x636E;&#x8F93;&#x5165;&#x6765;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x91D1;&#x878D;&#x884D;&#x751F;&#x54C1;&#x5408;&#x7EA6;&#x3002;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x7231;&#x8377;&#x534E;&#x7684;&#x519C;&#x6C11;&#x8D2D;&#x4E70;&#x4E86;&#x4E00;&#x4E2A;&#x57FA;&#x4E8E;&#x7231;&#x8377;&#x534E;&#x7684;&#x964D;&#x96E8;&#x60C5;&#x51B5;&#x8FDB;&#x884C;&#x53CD;&#x5411;&#x8D54;&#x4ED8;&#x7684;&#x91D1;&#x878D;&#x884D;&#x751F;&#x54C1;&#xFF0C;&#x90A3;&#x4E48;&#x5982;&#x679C;&#x9047;&#x5230;&#x5E72;&#x65F1;&#xFF0C;&#x8BE5;&#x519C;&#x6C11;&#x5C06;&#x81EA;&#x52A8;&#x5730;&#x6536;&#x5230;&#x8D54;&#x4ED8;&#x8D44;&#x91D1;&#x800C;&#x5982;&#x679C;&#x6709;&#x8DB3;&#x91CF;&#x7684;&#x964D;&#x96E8;&#x4ED6;&#x4F1A;&#x5F88;&#x5F00;&#x5FC3;&#x56E0;&#x4E3A;&#x4ED6;&#x7684;&#x4F5C;&#x7269;&#x6536;&#x6210;&#x4F1A;&#x5F88;&#x597D;&#x3002;</p>
</li>
<li><p>&#x4E00;&#x4E2A;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x7684;&#x6570;&#x636E;&#x53D1;&#x5E03;&#x5668;&#x3002; 
&#x5BF9;&#x4E8E;&#x57FA;&#x4E8E;&#x5DEE;&#x5F02;&#x7684;&#x91D1;&#x878D;&#x5408;&#x7EA6;&#xFF0C;&#x4E8B;&#x5B9E;&#x4E0A;&#x901A;&#x8FC7;&#x8FC7;&#x201C;&#x8C22;&#x6797;&#x70B9;&#x201D;&#x534F;&#x8BAE;&#x5C06;&#x6570;&#x636E;&#x53D1;&#x5E03;&#x5668;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x662F;&#x53EF;&#x80FD;&#x7684;&#x3002;&#x8C22;&#x6797;&#x70B9;&#x7684;&#x5DE5;&#x4F5C;&#x539F;&#x7406;&#x5982;&#x4E0B;&#xFF1A;N&#x65B9;&#x4E3A;&#x67D0;&#x4E2A;&#x6307;&#x5B9A;&#x7684;&#x6570;&#x636E;&#x63D0;&#x4F9B;&#x8F93;&#x5165;&#x503C;&#x5230;&#x7CFB;&#x7EDF;&#xFF08;&#x4F8B;&#x5982;ETH/USD&#x4EF7;&#x683C;&#xFF09;&#xFF0C;&#x6240;&#x6709;&#x7684;&#x503C;&#x88AB;&#x6392;&#x5E8F;&#xFF0C;&#x6BCF;&#x4E2A;&#x63D0;&#x4F9B;25%&#x5230;75%&#x4E4B;&#x95F4;&#x7684;&#x503C;&#x7684;&#x8282;&#x70B9;&#x90FD;&#x4F1A;&#x83B7;&#x5F97;&#x5956;&#x52B1;&#xFF0C;&#x6BCF;&#x4E2A;&#x4EBA;&#x90FD;&#x6709;&#x6FC0;&#x52B1;&#x53BB;&#x63D0;&#x4F9B;&#x4ED6;&#x4EBA;&#x5C06;&#x63D0;&#x4F9B;&#x7684;&#x7B54;&#x6848;&#xFF0C;&#x5927;&#x91CF;&#x73A9;&#x5BB6;&#x53EF;&#x4EE5;&#x771F;&#x6B63;&#x540C;&#x610F;&#x7684;&#x7B54;&#x6848;&#x660E;&#x663E;&#x9ED8;&#x8BA4;&#x5C31;&#x662F;&#x6B63;&#x786E;&#x7B54;&#x6848;&#xFF0C;&#x8FD9;&#x6784;&#x9020;&#x4E86;&#x4E00;&#x4E2A;&#x53EF;&#x4EE5;&#x5728;&#x7406;&#x8BBA;&#x4E0A;&#x63D0;&#x4F9B;&#x5F88;&#x591A;&#x6570;&#x503C;&#xFF0C;&#x5305;&#x62EC;ETH/USD&#x4EF7;&#x683C;&#xFF0C;&#x67CF;&#x6797;&#x7684;&#x6E29;&#x5EA6;&#x751A;&#x81F3;&#x67D0;&#x4E2A;&#x7279;&#x522B;&#x56F0;&#x96BE;&#x7684;&#x8BA1;&#x7B97;&#x7684;&#x7ED3;&#x679C;&#x7684;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x534F;&#x8BAE;&#x3002;</p>
</li>
<li><p>&#x591A;&#x91CD;&#x7B7E;&#x540D;&#x667A;&#x80FD;&#x5951;&#x7EA6;&#x3002;&#x6BD4;&#x7279;&#x5E01;&#x5141;&#x8BB8;&#x57FA;&#x4E8E;&#x591A;&#x91CD;&#x7B7E;&#x540D;&#x7684;&#x4EA4;&#x6613;&#x5408;&#x7EA6;&#xFF0C;&#x4F8B;&#x5982;&#xFF0C;5&#x628A;&#x79C1;&#x94A5;&#x91CC;&#x96C6;&#x9F50;3&#x628A;&#x5C31;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x8D44;&#x91D1;&#x3002;&#x4EE5;&#x592A;&#x574A;&#x53EF;&#x4EE5;&#x505A;&#x5F97;&#x66F4;&#x7EC6;&#x5316;&#xFF0C;&#x4F8B;&#x5982;&#xFF0C;5&#x628A;&#x79C1;&#x94A5;&#x91CC;&#x96C6;&#x9F50;4&#x628A;&#x53EF;&#x4EE5;&#x82B1;&#x5168;&#x90E8;&#x8D44;&#x91D1;&#xFF0C;&#x5982;&#x679C;&#x53EA;3&#x628A;&#x5219;&#x6BCF;&#x5929;&#x6700;&#x591A;&#x82B1;10%&#x7684;&#x8D44;&#x91D1;&#xFF0C;&#x53EA;&#x6709;2&#x628A;&#x5C31;&#x53EA;&#x80FD;&#x6BCF;&#x5929;&#x82B1;0.5%&#x7684;&#x8D44;&#x91D1;&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x4EE5;&#x592A;&#x574A;&#x91CC;&#x7684;&#x591A;&#x91CD;&#x7B7E;&#x540D;&#x662F;&#x5F02;&#x6B65;&#x7684;&#xFF0C;&#x610F;&#x601D;&#x662F;&#x8BF4;&#xFF0C;&#x53CC;&#x65B9;&#x53EF;&#x4EE5;&#x5728;&#x4E0D;&#x540C;&#x65F6;&#x95F4;&#x5728;&#x533A;&#x5757;&#x94FE;&#x4E0A;&#x6CE8;&#x518C;&#x7B7E;&#x540D;&#xFF0C;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x7B7E;&#x540D;&#x5230;&#x4F4D;&#x540E;&#x5C31;&#x4F1A;&#x81EA;&#x52A8;&#x53D1;&#x9001;&#x4EA4;&#x6613;&#x3002;</p>
</li>
<li><p>&#x4E91;&#x8BA1;&#x7B97;&#x3002;EVM&#x6280;&#x672F;&#x8FD8;&#x53EF;&#x88AB;&#x7528;&#x6765;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x53EF;&#x9A8C;&#x8BC1;&#x7684;&#x8BA1;&#x7B97;&#x73AF;&#x5883;&#xFF0C;&#x5141;&#x8BB8;&#x7528;&#x6237;&#x9080;&#x8BF7;&#x4ED6;&#x4EBA;&#x8FDB;&#x884C;&#x8BA1;&#x7B97;&#x7136;&#x540E;&#x9009;&#x62E9;&#x6027;&#x5730;&#x8981;&#x6C42;&#x63D0;&#x4F9B;&#x5728;&#x4E00;&#x5B9A;&#x7684;&#x968F;&#x673A;&#x9009;&#x62E9;&#x7684;&#x68C0;&#x67E5;&#x70B9;&#x4E0A;&#x8BA1;&#x7B97;&#x88AB;&#x6B63;&#x786E;&#x5B8C;&#x6210;&#x7684;&#x8BC1;&#x636E;&#x3002;&#x8FD9;&#x4F7F;&#x5F97;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x4EFB;&#x4F55;&#x7528;&#x6237;&#x90FD;&#x53EF;&#x4EE5;&#x7528;&#x4ED6;&#x4EEC;&#x7684;&#x53F0;&#x5F0F;&#x673A;&#xFF0C;&#x7B14;&#x8BB0;&#x672C;&#x7535;&#x8111;&#x6216;&#x8005;&#x4E13;&#x7528;&#x670D;&#x52A1;&#x5668;&#x53C2;&#x4E0E;&#x7684;&#x4E91;&#x8BA1;&#x7B97;&#x5E02;&#x573A;&#x6210;&#x4E3A;&#x53EF;&#x80FD;&#xFF0C;&#x73B0;&#x573A;&#x68C0;&#x67E5;&#x548C;&#x5B89;&#x5168;&#x4FDD;&#x8BC1;&#x91D1;&#x53EF;&#x4EE5;&#x88AB;&#x7528;&#x6765;&#x786E;&#x4FDD;&#x7CFB;&#x7EDF;&#x662F;&#x503C;&#x5F97;&#x4FE1;&#x4EFB;&#x7684;&#xFF08;&#x5373;&#x6CA1;&#x6709;&#x8282;&#x70B9;&#x53EF;&#x4EE5;&#x56E0;&#x6B3A;&#x9A97;&#x83B7;&#x5229;&#xFF09;&#x3002;&#x867D;&#x7136;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x7CFB;&#x7EDF;&#x53EF;&#x80FD;&#x5E76;&#x4E0D;&#x9002;&#x7528;&#x6240;&#x6709;&#x4EFB;&#x52A1;&#xFF1B;&#x4F8B;&#x5982;&#xFF0C;&#x9700;&#x8981;&#x9AD8;&#x7EA7;&#x8FDB;&#x7A0B;&#x95F4;&#x901A;&#x4FE1;&#x7684;&#x4EFB;&#x52A1;&#x5C31;&#x4E0D;&#x6613;&#x5728;&#x4E00;&#x4E2A;&#x5927;&#x7684;&#x8282;&#x70B9;&#x4E91;&#x4E0A;&#x5B8C;&#x6210;&#x3002;&#x7136;&#x800C;&#x4E00;&#x4E9B;&#x5176;&#x5B83;&#x7684;&#x4EFB;&#x52A1;&#x5C31;&#x5F88;&#x5BB9;&#x6613;&#x5B9E;&#x73B0;&#x5E76;&#x884C;&#xFF1B;SETI@home,
folding@home&#x548C;&#x57FA;&#x56E0;&#x7B97;&#x6CD5;&#x8FD9;&#x6837;&#x7684;&#x9879;&#x76EE;&#x5C31;&#x5F88;&#x5BB9;&#x6613;&#x5728;&#x8FD9;&#x6837;&#x7684;&#x5E73;&#x53F0;&#x4E0A;&#x8FDB;&#x884C;&#x3002;</p>
</li>
<li><p>&#x70B9;&#x5BF9;&#x70B9;&#x8D4C;&#x535A;&#x3002;&#x4EFB;&#x610F;&#x6570;&#x91CF;&#x7684;&#x70B9;&#x5BF9;&#x70B9;&#x8D4C;&#x535A;&#x534F;&#x8BAE;&#x90FD;&#x53EF;&#x4EE5;&#x642C;&#x5230;&#x4EE5;&#x592A;&#x574A;&#x7684;&#x533A;&#x5757;&#x94FE;&#x4E0A;&#xFF0C;&#x4F8B;&#x5982;Frank Stajano&#x548C;Richard 
Clayton&#x7684;Cyberdice&#x3002; &#x6700;&#x7B80;&#x5355;&#x7684;&#x8D4C;&#x535A;&#x534F;&#x8BAE;&#x4E8B;&#x5B9E;&#x4E0A;&#x662F;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x5408;&#x7EA6;&#xFF0C;&#x5B83;&#x7528;&#x6765;&#x8D4C;&#x4E0B;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#x7684;&#x54C8;&#x7A00;&#x503C;&#x4E0E;&#x731C;&#x6D4B;&#x503C;&#x4E4B;&#x95F4;&#x7684;&#x5DEE;&#x989D;, 
&#x636E;&#x6B64;&#x53EF;&#x4EE5;&#x521B;&#x5EFA;&#x66F4;&#x590D;&#x6742;&#x7684;&#x8D4C;&#x535A;&#x534F;&#x8BAE;&#xFF0C;&#x4EE5;&#x5B9E;&#x73B0;&#x8FD1;&#x4E4E;&#x96F6;&#x8D39;&#x7528;&#x548C;&#x65E0;&#x6B3A;&#x9A97;&#x7684;&#x8D4C;&#x535A;&#x670D;&#x52A1;&#x3002;</p>
</li>
<li><p>&#x9884;&#x6D4B;&#x5E02;&#x573A;&#x3002; &#x4E0D;&#x7BA1;&#x662F;&#x6709;&#x795E;&#x8C15;&#x8FD8;&#x662F;&#x6709;&#x8C22;&#x6797;&#x5E01;&#xFF0C;&#x9884;&#x6D4B;&#x5E02;&#x573A;&#x90FD;&#x4F1A;&#x5F88;&#x5BB9;&#x6613;&#x5B9E;&#x73B0;&#xFF0C;&#x5E26;&#x6709;&#x8C22;&#x6797;&#x5E01;&#x7684;&#x9884;&#x6D4B;&#x5E02;&#x573A;&#x53EF;&#x80FD;&#x4F1A;&#x88AB;&#x8BC1;&#x660E;&#x662F;&#x7B2C;&#x4E00;&#x4E2A;&#x4E3B;&#x6D41;&#x7684;&#x4F5C;&#x4E3A;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x7EC4;&#x7EC7;&#x7BA1;&#x7406;&#x534F;&#x8BAE;&#x7684;&#x201C; 
futarchy&#x201D;&#x5E94;&#x7528;&#x3002;</p>
</li>
<li><p>&#x94FE;&#x4E0A;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x5E02;&#x573A;&#xFF0C;&#x4EE5;&#x8EAB;&#x4EFD;&#x548C;&#x4FE1;&#x8A89;&#x7CFB;&#x7EDF;&#x4E3A;&#x57FA;&#x7840;&#x3002;</p>
</li>
</ol>
<h2 id="&#x6742;&#x9879;&#x548C;&#x5173;&#x6CE8;">&#x6742;&#x9879;&#x548C;&#x5173;&#x6CE8;</h2>
<h3 id="&#x6539;&#x8FDB;&#x7248;&#x5E7D;&#x7075;&#x534F;&#x8BAE;&#x7684;&#x5B9E;&#x65BD;">&#x6539;&#x8FDB;&#x7248;&#x5E7D;&#x7075;&#x534F;&#x8BAE;&#x7684;&#x5B9E;&#x65BD;</h3>
<p>&#x201C;&#x5E7D;&#x7075;&#x201C;&#x534F;&#x8BAE;&#xFF08;&#x201D;Greedy Heaviest Observed Subtree&#x201D; (GHOST) protocol&#xFF09;&#x662F;&#x7531;Yonatan  Sompolinsky &#x548C; Aviv  Zohar&#x5728;2013&#x5E74;12&#x6708;&#x5F15;&#x5165;&#x7684;&#x521B;&#x65B0;&#x3002;&#x5E7D;&#x7075;&#x534F;&#x8BAE;&#x63D0;&#x51FA;&#x7684;&#x52A8;&#x673A;&#x662F;&#x5F53;&#x524D;&#x5FEB;&#x901F;&#x786E;&#x8BA4;&#x7684;&#x5757;&#x94FE;&#x56E0;&#x4E3A;&#x533A;&#x5757;&#x7684;&#x9AD8;&#x4F5C;&#x5E9F;&#x7387;&#x800C;&#x53D7;&#x5230;&#x4F4E;&#x5B89;&#x5168;&#x6027;&#x56F0;&#x6270;&#xFF1B;&#x56E0;&#x4E3A;&#x533A;&#x5757;&#x9700;&#x8981;&#x82B1;&#x4E00;&#x5B9A;&#x65F6;&#x95F4;&#xFF08;&#x8BBE;&#x4E3A;t&#xFF09;&#x6269;&#x6563;&#x81F3;&#x5168;&#x7F51;&#xFF0C;&#x5982;&#x679C;&#x77FF;&#x5DE5;A&#x6316;&#x51FA;&#x4E86;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#x7136;&#x540E;&#x77FF;&#x5DE5;B&#x78B0;&#x5DE7;&#x5728;A&#x7684;&#x533A;&#x5757;&#x6269;&#x6563;&#x81F3;B&#x4E4B;&#x524D;&#x6316;&#x51FA;&#x4E86;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#xFF0C;&#x77FF;&#x5DE5;B&#x7684;&#x533A;&#x5757;&#x5C31;&#x4F1A;&#x4F5C;&#x5E9F;&#x5E76;&#x4E14;&#x6CA1;&#x6709;&#x5BF9;&#x7F51;&#x7EDC;&#x5B89;&#x5168;&#x4F5C;&#x51FA;&#x8D21;&#x732E;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x8FD9;&#x91CC;&#x8FD8;&#x6709;&#x4E2D;&#x5FC3;&#x5316;&#x95EE;&#x9898;&#xFF1A;&#x5982;&#x679C;A&#x662F;&#x4E00;&#x4E2A;&#x62E5;&#x6709;&#x5168;&#x7F51;30%&#x7B97;&#x529B;&#x7684;&#x77FF;&#x6C60;&#x800C;B&#x62E5;&#x6709;10%&#x7684;&#x7B97;&#x529B;&#xFF0C;A&#x5C06;&#x9762;&#x4E34;70%&#x7684;&#x65F6;&#x95F4;&#x90FD;&#x5728;&#x4EA7;&#x751F;&#x4F5C;&#x5E9F;&#x533A;&#x5757;&#x7684;&#x98CE;&#x9669;&#x800C;B&#x5728;90%&#x7684;&#x65F6;&#x95F4;&#x91CC;&#x90FD;&#x5728;&#x4EA7;&#x751F;&#x4F5C;&#x5E9F;&#x533A;&#x5757;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5982;&#x679C;&#x4F5C;&#x5E9F;&#x7387;&#x9AD8;&#xFF0C;A&#x5C06;&#x7B80;&#x5355;&#x5730;&#x56E0;&#x4E3A;&#x66F4;&#x9AD8;&#x7684;&#x7B97;&#x529B;&#x4EFD;&#x989D;&#x800C;&#x66F4;&#x6709;&#x6548;&#x7387;&#xFF0C;&#x7EFC;&#x5408;&#x8FD9;&#x4E24;&#x4E2A;&#x56E0;&#x7D20;&#xFF0C;&#x533A;&#x5757;&#x4EA7;&#x751F;&#x901F;&#x5EA6;&#x5FEB;&#x7684;&#x5757;&#x94FE;&#x5F88;&#x53EF;&#x80FD;&#x5BFC;&#x81F4;&#x4E00;&#x4E2A;&#x77FF;&#x6C60;&#x62E5;&#x6709;&#x5B9E;&#x9645;&#x4E0A;&#x80FD;&#x591F;&#x63A7;&#x5236;&#x6316;&#x77FF;&#x8FC7;&#x7A0B;&#x7684;&#x7B97;&#x529B;&#x4EFD;&#x989D;&#x3002;</p>
<p>&#x6B63;&#x5982;Sompolinsky &#x548C;  Zohar&#x6240;&#x63CF;&#x8FF0;&#x7684;&#xFF0C;&#x901A;&#x8FC7;&#x5728;&#x8BA1;&#x7B97;&#x54EA;&#x6761;&#x94FE;&#x201C;&#x6700;&#x957F;&#x201D;&#x7684;&#x65F6;&#x5019;&#x628A;&#x5E9F;&#x533A;&#x5757;&#x4E5F;&#x5305;&#x542B;&#x8FDB;&#x6765;&#xFF0C;&#x5E7D;&#x7075;&#x534F;&#x8BAE;&#x89E3;&#x51B3;&#x4E86;&#x964D;&#x4F4E;&#x7F51;&#x7EDC;&#x5B89;&#x5168;&#x6027;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#xFF1B;&#x8FD9;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x4E0D;&#x4EC5;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#x7684;&#x7236;&#x533A;&#x5757;&#x548C;&#x66F4;&#x65E9;&#x7684;&#x7956;&#x5148;&#x5757;&#xFF0C;&#x7956;&#x5148;&#x5757;&#x7684;&#x4F5C;&#x5E9F;&#x7684;&#x540E;&#x4EE3;&#x533A;&#x5757;&#xFF08;&#x4EE5;&#x592A;&#x574A;&#x672F;&#x8BED;&#x4E2D;&#x79F0;&#x4E4B;&#x4E3A;&#x201C;&#x53D4;&#x533A;&#x5757;&#x201D;&#xFF09;&#x4E5F;&#x88AB;&#x52A0;&#x8FDB;&#x6765;&#x4EE5;&#x8BA1;&#x7B97;&#x54EA;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#x62E5;&#x6709;&#x652F;&#x6301;&#x5176;&#x7684;&#x6700;&#x5927;&#x5DE5;&#x4F5C;&#x91CF;&#x8BC1;&#x660E;&#x3002;&#x6211;&#x4EEC;&#x8D85;&#x8D8A;&#x4E86;Sompolinsky  &#x548C; Zohar&#x6240;&#x63CF;&#x8FF0;&#x7684;&#x534F;&#x8BAE;&#x4EE5;&#x89E3;&#x51B3;&#x7B2C;&#x4E8C;&#x4E2A;&#x95EE;&#x9898; &#x2013;  &#x4E2D;&#x5FC3;&#x5316;&#x503E;&#x5411;&#xFF0C;&#x4EE5;&#x592A;&#x574A;&#x4ED8;&#x7ED9;&#x4EE5;&#x201C;&#x53D4;&#x533A;&#x5757;&#x201D;&#x8EAB;&#x4EFD;&#x4E3A;&#x65B0;&#x5757;&#x786E;&#x8BA4;&#x4F5C;&#x51FA;&#x8D21;&#x732E;&#x7684;&#x5E9F;&#x533A;&#x5757;87.5%&#x7684;&#x5956;&#x52B1;&#xFF0C;&#x628A;&#x5B83;&#x4EEC;&#x7EB3;&#x5165;&#x8BA1;&#x7B97;&#x7684;&#x201C;&#x4F84;&#x5B50;&#x533A;&#x5757;&#x201D;&#x5C06;&#x83B7;&#x5F97;&#x5956;&#x52B1;&#x7684;12.5%&#xFF0C;&#x4E0D;&#x8FC7;&#xFF0C;&#x4EA4;&#x6613;&#x8D39;&#x7528;&#x4E0D;&#x5956;&#x52B1;&#x7ED9;&#x53D4;&#x533A;&#x5757;&#x3002;</p>
<p>&#x4EE5;&#x592A;&#x574A;&#x5B9E;&#x65BD;&#x4E86;&#x4E00;&#x4E2A;&#x53EA;&#x4E0B;&#x63A2;&#x5230;&#x7B2C;&#x4E94;&#x5C42;&#x7684;&#x7B80;&#x5316;&#x7248;&#x672C;&#x7684;&#x5E7D;&#x7075;&#x534F;&#x8BAE;&#x3002;&#x5176;&#x7279;&#x70B9;&#x662F;&#xFF0C;&#x5E9F;&#x533A;&#x5757;&#x53EA;&#x80FD;&#x4EE5;&#x53D4;&#x533A;&#x5757;&#x7684;&#x8EAB;&#x4EFD;&#x88AB;&#x5176;&#x7236;&#x6BCD;&#x7684;&#x7B2C;&#x4E8C;&#x4EE3;&#x81F3;&#x7B2C;&#x4E94;&#x4EE3;&#x540E;&#x8F88;&#x533A;&#x5757;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x66F4;&#x8FDC;&#x5173;&#x7CFB;&#x7684;&#x540E;&#x8F88;&#x533A;&#x5757;&#xFF08;&#x4F8B;&#x5982;&#x7236;&#x6BCD;&#x533A;&#x5757;&#x7684;&#x7B2C;&#x516D;&#x4EE3;&#x540E;&#x8F88;&#x533A;&#x5757;&#xFF0C;&#x6216;&#x7956;&#x7236;&#x533A;&#x5757;&#x7684;&#x7B2C;&#x4E09;&#x4EE3;&#x540E;&#x8F88;&#x533A;&#x5757;&#xFF09;&#x7EB3;&#x5165;&#x8BA1;&#x7B97;&#x3002;&#x8FD9;&#x6837;&#x505A;&#x6709;&#x51E0;&#x4E2A;&#x539F;&#x56E0;&#x3002;&#x9996;&#x5148;&#xFF0C;&#x65E0;&#x6761;&#x4EF6;&#x7684;&#x5E7D;&#x7075;&#x534F;&#x8BAE;&#x5C06;&#x7ED9;&#x8BA1;&#x7B97;&#x7ED9;&#x5B9A;&#x533A;&#x5757;&#x7684;&#x54EA;&#x4E00;&#x4E2A;&#x53D4;&#x533A;&#x5757;&#x5408;&#x6CD5;&#x5E26;&#x6765;&#x8FC7;&#x591A;&#x7684;&#x590D;&#x6742;&#x6027;&#x3002;&#x5176;&#x6B21;&#xFF0C;&#x5E26;&#x6709;&#x4EE5;&#x592A;&#x574A;&#x6240;&#x4F7F;&#x7528;&#x7684;&#x8865;&#x507F;&#x7684;&#x65E0;&#x6761;&#x4EF6;&#x7684;&#x5E7D;&#x7075;&#x534F;&#x8BAE;&#x5265;&#x593A;&#x4E86;&#x77FF;&#x5DE5;&#x5728;&#x4E3B;&#x94FE;&#x800C;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x516C;&#x5F00;&#x653B;&#x51FB;&#x8005;&#x7684;&#x94FE;&#x4E0A;&#x6316;&#x77FF;&#x7684;&#x6FC0;&#x52B1;&#x3002;&#x6700;&#x540E;&#xFF0C;&#x8BA1;&#x7B97;&#x8868;&#x660E;&#x5E26;&#x6709;&#x6FC0;&#x52B1;&#x7684;&#x4E94;&#x5C42;&#x5E7D;&#x7075;&#x534F;&#x8BAE;&#x5373;&#x4F7F;&#x5728;&#x51FA;&#x5757;&#x65F6;&#x95F4;&#x4E3A;15s&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x4E5F;&#x5B9E;&#x73B0;&#x4E86;&#x4E86;95%&#x4EE5;&#x4E0A;&#x7684;&#x6548;&#x7387;&#xFF0C;&#x800C;&#x62E5;&#x6709;25%&#x7B97;&#x529B;&#x7684;&#x77FF;&#x5DE5;&#x4ECE;&#x4E2D;&#x5FC3;&#x5316;&#x5F97;&#x5230;&#x7684;&#x76CA;&#x5904;&#x5C0F;&#x4E8E;3%&#x3002;</p>
<h3 id="&#x8D39;&#x7528;">&#x8D39;&#x7528;</h3>
<p>&#x56E0;&#x4E3A;&#x6BCF;&#x4E2A;&#x53D1;&#x5E03;&#x5230;&#x533A;&#x5757;&#x94FE;&#x7684;&#x4EA4;&#x6613;&#x90FD;&#x5360;&#x7528;&#x4E86;&#x4E0B;&#x8F7D;&#x548C;&#x9A8C;&#x8BC1;&#x7684;&#x6210;&#x672C;&#xFF0C;&#x9700;&#x8981;&#x6709;&#x4E00;&#x4E2A;&#x5305;&#x62EC;&#x4EA4;&#x6613;&#x8D39;&#x7684;&#x89C4;&#x8303;&#x673A;&#x5236;&#x6765;&#x9632;&#x8303;&#x6EE5;&#x53D1;&#x4EA4;&#x6613;&#x3002;&#x6BD4;&#x7279;&#x5E01;&#x4F7F;&#x7528;&#x7684;&#x9ED8;&#x8BA4;&#x65B9;&#x6CD5;&#x662F;&#x7EAF;&#x81EA;&#x613F;&#x7684;&#x4EA4;&#x6613;&#x8D39;&#x7528;&#xFF0C;&#x4F9D;&#x9760;&#x77FF;&#x5DE5;&#x62C5;&#x5F53;&#x5B88;&#x95E8;&#x4EBA;&#x5E76;&#x8BBE;&#x5B9A;&#x52A8;&#x6001;&#x7684;&#x6700;&#x4F4E;&#x8D39;&#x7528;&#x3002;&#x56E0;&#x4E3A;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x662F;&#x201C;&#x57FA;&#x4E8E;&#x5E02;&#x573A;&#x7684;&#x201D;&#xFF0C;&#x4F7F;&#x5F97;&#x77FF;&#x5DE5;&#x548C;&#x4EA4;&#x6613;&#x53D1;&#x9001;&#x8005;&#x80FD;&#x591F;&#x6309;&#x4F9B;&#x9700;&#x6765;&#x51B3;&#x5B9A;&#x4EF7;&#x683C;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x5728;&#x6BD4;&#x7279;&#x5E01;&#x793E;&#x533A;&#x88AB;&#x5F88;&#x987A;&#x5229;&#x5730;&#x63A5;&#x53D7;&#x4E86;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x8FD9;&#x4E2A;&#x903B;&#x8F91;&#x7684;&#x95EE;&#x9898;&#x5728;&#x4E8E;&#xFF0C;&#x4EA4;&#x6613;&#x5904;&#x7406;&#x5E76;&#x975E;&#x4E00;&#x4E2A;&#x5E02;&#x573A;&#xFF1B;&#x867D;&#x7136;&#x6839;&#x636E;&#x76F4;&#x89C9;&#x628A;&#x4EA4;&#x6613;&#x5904;&#x7406;&#x89E3;&#x91CA;&#x6210;&#x77FF;&#x5DE5;&#x7ED9;&#x53D1;&#x9001;&#x8005;&#x63D0;&#x4F9B;&#x7684;&#x670D;&#x52A1;&#x662F;&#x5F88;&#x6709;&#x5438;&#x5F15;&#x529B;&#x7684;&#xFF0C;&#x4F46;&#x4E8B;&#x5B9E;&#x4E0A;&#x4E00;&#x4E2A;&#x77FF;&#x5DE5;&#x6536;&#x5F55;&#x7684;&#x4EA4;&#x6613;&#x662F;&#x9700;&#x8981;&#x7F51;&#x7EDC;&#x4E2D;&#x6BCF;&#x4E2A;&#x8282;&#x70B9;&#x5904;&#x7406;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x4EA4;&#x6613;&#x5904;&#x7406;&#x4E2D;&#x6700;&#x5927;&#x90E8;&#x5206;&#x7684;&#x6210;&#x672C;&#x662F;&#x7531;&#x7B2C;&#x4E09;&#x65B9;&#x800C;&#x4E0D;&#x662F;&#x51B3;&#x5B9A;&#x662F;&#x5426;&#x6536;&#x5F55;&#x4EA4;&#x6613;&#x7684;&#x77FF;&#x5DE5;&#x627F;&#x62C5;&#x7684;&#x3002;&#x4E8E;&#x662F;&#xFF0C;&#x975E;&#x5E38;&#x6709;&#x53EF;&#x80FD;&#x53D1;&#x751F;&#x516C;&#x5730;&#x60B2;&#x5267;&#x3002;</p>
<p>&#x7136;&#x800C;&#xFF0C;&#x5F53;&#x7ED9;&#x51FA;&#x4E00;&#x4E2A;&#x7279;&#x6B8A;&#x7684;&#x4E0D;&#x591F;&#x7CBE;&#x786E;&#x7684;&#x7B80;&#x5316;&#x5047;&#x8BBE;&#x65F6;&#xFF0C;&#x8FD9;&#x4E2A;&#x57FA;&#x4E8E;&#x5E02;&#x573A;&#x7684;&#x673A;&#x5236;&#x7684;&#x6F0F;&#x6D1E;&#x5F88;&#x795E;&#x5947;&#x5730;&#x6D88;&#x9664;&#x4E86;&#x81EA;&#x5DF1;&#x7684;&#x5F71;&#x54CD;&#x3002;&#x8BBA;&#x8BC1;&#x5982;&#x4E0B;&#x3002;&#x5047;&#x8BBE;&#xFF1A;</p>
<ol>
<li>&#x4E00;&#x4E2A;&#x4EA4;&#x6613;&#x5E26;&#x6765; k &#x6B65;&#x64CD;&#x4F5C;, &#x63D0;&#x4F9B;&#x5956;&#x52B1; kR&#x7ED9;&#x4EFB;&#x4F55;&#x6536;&#x5F55;&#x8BE5;&#x4EA4;&#x6613;&#x7684;&#x77FF;&#x5DE5;&#xFF0C;&#x8FD9;&#x91CC; R &#x7531;&#x4EA4;&#x6613;&#x53D1;&#x5E03;&#x8005;&#x8BBE;&#x5B9A;&#xFF0C; k &#x548C; R &#x5BF9;&#x4E8E;&#x77FF;&#x5DE5;&#x90FD;&#x662F;&#x4E8B;&#x5148;&#xFF08;&#x5927;&#x81F4;&#x4E0A;&#xFF09;&#x53EF;&#x89C1;&#x7684;&#x3002;</li>
<li>&#x6BCF;&#x4E2A;&#x8282;&#x70B9;&#x5904;&#x7406;&#x6BCF;&#x6B65;&#x64CD;&#x4F5C;&#x7684;&#x6210;&#x672C;&#x90FD;&#x662F; C (&#x5373;&#x6240;&#x6709;&#x8282;&#x70B9;&#x7684;&#x6548;&#x7387;&#x4E00;&#x81F4;)&#x3002;</li>
<li>&#x6709; N &#x4E2A;&#x6316;&#x77FF;&#x8282;&#x70B9;&#xFF0C;&#x6BCF;&#x4E2A;&#x7B97;&#x529B;&#x4E00;&#x81F4;(&#x5373;&#x5168;&#x7F51;&#x7B97;&#x529B;&#x7684;1/N)&#x3002;</li>
<li>&#x6CA1;&#x6709;&#x4E0D;&#x6316;&#x77FF;&#x7684;&#x5168;&#x8282;&#x70B9;&#x3002;</li>
</ol>
<p>&#x5F53;&#x9884;&#x671F;&#x5956;&#x52B1;&#x5927;&#x4E8E;&#x6210;&#x672C;&#x65F6;&#xFF0C;&#x77FF;&#x5DE5;&#x613F;&#x610F;&#x6316;&#x77FF;&#x3002;&#x8FD9;&#x6837;&#xFF0C;&#x56E0;&#x4E3A;&#x77FF;&#x5DE5;&#x6709;1/N &#x7684;&#x673A;&#x4F1A;&#x5904;&#x7406;&#x4E0B;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#xFF0C;&#x6240;&#x4EE5;&#x9884;&#x671F;&#x7684;&#x6536;&#x76CA;&#x662F; kR/N , &#x77FF;&#x5DE5;&#x7684;&#x5904;&#x7406;&#x6210;&#x672C;&#x7B80;&#x5355;&#x4E3A;  kC. &#x8FD9;&#x6837;&#x5F53; kR/N &gt; kC&#xFF0C; &#x5373; R &gt; NC&#x65F6;&#x3002;&#x77FF;&#x5DE5;&#x613F;&#x610F;&#x6536;&#x5F55;&#x4EA4;&#x6613;&#x3002;&#x6CE8;&#x610F; R  &#x662F;&#x7531;&#x4EA4;&#x6613;&#x53D1;&#x9001;&#x8005;&#x63D0;&#x4F9B;&#x7684;&#x6BCF;&#x6B65;&#x8D39;&#x7528;&#xFF0C;&#x662F;&#x77FF;&#x5DE5;&#x4ECE;&#x5904;&#x7406;&#x4EA4;&#x6613;&#x4E2D;&#x83B7;&#x76CA;&#x7684;&#x4E0B;&#x9650;&#x3002; NC &#x662F;&#x5168;&#x7F51;&#x5904;&#x7406;&#x4E00;&#x4E2A;&#x64CD;&#x4F5C;&#x7684;&#x6210;&#x672C;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x77FF;&#x5DE5;&#x4EC5;&#x6709;&#x52A8;&#x673A;&#x53BB;&#x6536;&#x5F55;&#x90A3;&#x4E9B;&#x6536;&#x76CA;&#x5927;&#x4E8E;&#x6210;&#x672C;&#x7684;&#x4EA4;&#x6613;&#x3002;</p>
<p>&#x7136;&#x800C;&#xFF0C;&#x8FD9;&#x4E9B;&#x5047;&#x8BBE;&#x4E0E;&#x5B9E;&#x9645;&#x60C5;&#x51B5;&#x6709;&#x51E0;&#x70B9;&#x91CD;&#x8981;&#x7684;&#x504F;&#x79BB;&#xFF1A;</p>
<p>1&#xFF0C;&#x56E0;&#x4E3A;&#x989D;&#x5916;&#x7684;&#x9A8C;&#x8BC1;&#x65F6;&#x95F4;&#x5EF6;&#x8FDF;&#x4E86;&#x5757;&#x7684;&#x5E7F;&#x64AD;&#x56E0;&#x800C;&#x589E;&#x52A0;&#x4E86;&#x5757;&#x6210;&#x4E3A;&#x5E9F;&#x5757;&#x7684;&#x673A;&#x4F1A;&#xFF0C;&#x5904;&#x7406;&#x4EA4;&#x6613;&#x7684;&#x77FF;&#x5DE5;&#x6BD4;&#x5176;&#x5B83;&#x7684;&#x9A8C;&#x8BC1;&#x8282;&#x70B9;&#x4ED8;&#x51FA;&#x4E86;&#x66F4;&#x9AD8;&#x7684;&#x6210;&#x672C;&#x3002;</p>
<p>2&#xFF0C;&#x4E0D;&#x6316;&#x77FF;&#x7684;&#x5168;&#x8282;&#x70B9;&#x662F;&#x5B58;&#x5728;&#x7684;&#x3002;</p>
<p>3&#xFF0C;&#x5B9E;&#x8DF5;&#x4E2D;&#x7B97;&#x529B;&#x5206;&#x5E03;&#x53EF;&#x80FD;&#x6700;&#x540E;&#x662F;&#x6781;&#x7AEF;&#x4E0D;&#x5E73;&#x5747;&#x7684;&#x3002;</p>
<p>4&#xFF0C;&#x4EE5;&#x7834;&#x574F;&#x7F51;&#x7EDC;&#x4E3A;&#x5DF1;&#x4EFB;&#x7684;&#x6295;&#x673A;&#x8005;&#xFF0C;&#x653F;&#x654C;&#x548C;&#x75AF;&#x5B50;&#x786E;&#x5B9E;&#x5B58;&#x5728;&#xFF0C;&#x5E76;&#x4E14;&#x4ED6;&#x4EEC;&#x80FD;&#x591F;&#x806A;&#x660E;&#x5730;&#x8BBE;&#x7F6E;&#x5408;&#x540C;&#x4F7F;&#x5F97;&#x4ED6;&#x4EEC;&#x7684;&#x6210;&#x672C;&#x6BD4;&#x5176;&#x5B83;&#x9A8C;&#x8BC1;&#x8282;&#x70B9;&#x4F4E;&#x5F97;&#x591A;&#x3002;</p>
<p>&#x4E0A;&#x9762;&#x7B2C;1&#x70B9;&#x9A71;&#x4F7F;&#x77FF;&#x5DE5;&#x6536;&#x5F55;&#x66F4;&#x5C11;&#x7684;&#x4EA4;&#x6613;&#xFF0C;&#x7B2C;2&#x70B9;&#x589E;&#x52A0;&#x4E86; NC; &#x56E0;&#x6B64;&#x8FD9;&#x4E24;&#x70B9;&#x7684;&#x5F71;&#x54CD;&#x81F3;&#x5C11;&#x90E8;&#x5206;&#x4E92;&#x76F8;&#x62B5;&#x6D88;&#x4E86;.  &#x7B2C;3&#x70B9;&#x548C;&#x7B2C;4&#x70B9;&#x662F;&#x4E3B;&#x8981;&#x95EE;&#x9898;&#xFF1B;&#x4F5C;&#x4E3A;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x6211;&#x4EEC;&#x7B80;&#x5355;&#x5730;&#x5EFA;&#x7ACB;&#x4E86;&#x4E00;&#x4E2A;&#x6D6E;&#x52A8;&#x7684;&#x4E0A;&#x9650;&#xFF1A;&#x6CA1;&#x6709;&#x533A;&#x5757;&#x80FD;&#x591F;&#x5305;&#x542B;&#x6BD4;BLK_LIMIT_FACTOR  &#x500D;&#x957F;&#x671F;&#x6307;&#x6570;&#x79FB;&#x52A8;&#x5E73;&#x5747;&#x503C;&#x66F4;&#x591A;&#x7684;&#x64CD;&#x4F5C;&#x6570;&#x3002;&#x5177;&#x4F53;&#x5730;&#xFF1A;</p>
<pre><code>blk.oplimit = floor((blk.parent.oplimit * (EMAFACTOR &#x2013; 1) + floor(parent.opcount * BLK_LIMIT_FACTOR)) /EMA_FACTOR)

BLK_LIMIT_FACTOR &#x548C; EMA_FACTOR &#x662F;&#x6682;&#x4E14;&#x88AB;&#x8BBE;&#x4E3A; 65536 &#x548C; 1.5 &#x7684;&#x5E38;&#x6570;&#xFF0C;&#x4F46;&#x53EF;&#x80FD;&#x4F1A;&#x5728;&#x66F4;&#x6DF1;&#x5165;&#x7684;&#x5206;&#x6790;&#x540E;&#x8C03;&#x6574;&#x3002;
</code></pre><h3 id="&#x8BA1;&#x7B97;&#x548C;&#x56FE;&#x7075;&#x5B8C;&#x5907;">&#x8BA1;&#x7B97;&#x548C;&#x56FE;&#x7075;&#x5B8C;&#x5907;</h3>
<p>&#x9700;&#x8981;&#x5F3A;&#x8C03;&#x7684;&#x662F;&#x4EE5;&#x592A;&#x574A;&#x865A;&#x62DF;&#x673A;&#x662F;&#x56FE;&#x7075;&#x5B8C;&#x5907;&#x7684;&#xFF1B;  &#x8FD9;&#x610F;&#x5473;&#x7740;EVM&#x4EE3;&#x7801;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x4EFB;&#x4F55;&#x53EF;&#x4EE5;&#x60F3;&#x8C61;&#x7684;&#x8BA1;&#x7B97;&#xFF0C;&#x5305;&#x62EC;&#x65E0;&#x9650;&#x5FAA;&#x73AF;&#x3002;EVM&#x4EE3;&#x7801;&#x6709;&#x4E24;&#x79CD;&#x65B9;&#x5F0F;&#x5B9E;&#x73B0;&#x5FAA;&#x73AF;&#x3002;&#x9996;&#x5148;&#xFF0C;JUMP  &#x6307;&#x4EE4;&#x53EF;&#x4EE5;&#x8BA9;&#x7A0B;&#x5E8F;&#x8DF3;&#x56DE;&#x81F3;&#x4EE3;&#x7801;&#x524D;&#x9762;&#x67D0;&#x5904;&#xFF0C;&#x8FD8;&#x6709;&#x5141;&#x8BB8;&#x5982; while x &lt; 27: x = x * 2  &#x4E00;&#x6837;&#x7684;&#x6761;&#x4EF6;&#x8BED;&#x53E5;&#x7684;JUMPI  &#x6307;&#x4EE4;&#x5B9E;&#x73B0;&#x6761;&#x4EF6;&#x8DF3;&#x8F6C;&#x3002;&#x5176;&#x6B21;&#xFF0C;&#x5408;&#x7EA6;&#x53EF;&#x4EE5;&#x8C03;&#x7528;&#x5176;&#x5B83;&#x5408;&#x7EA6;&#xFF0C;&#x6709;&#x901A;&#x8FC7;&#x9012;&#x5F52;&#x5B9E;&#x73B0;&#x5FAA;&#x73AF;&#x7684;&#x6F5C;&#x529B;&#x3002;&#x8FD9;&#x5F88;&#x81EA;&#x7136;&#x5730;&#x5BFC;&#x81F4;&#x4E86;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#xFF1A;&#x6076;&#x610F;&#x7528;&#x6237;&#x80FD;&#x591F;&#x901A;&#x8FC7;&#x8FEB;&#x4F7F;&#x77FF;&#x5DE5;&#x548C;&#x5168;&#x8282;&#x70B9;&#x8FDB;&#x5165;&#x65E0;&#x9650;&#x5FAA;&#x73AF;&#x800C;&#x4E0D;&#x5F97;&#x4E0D;&#x5173;&#x673A;&#x5417;&#xFF1F;  &#x8FD9;&#x95EE;&#x9898;&#x51FA;&#x73B0;&#x662F;&#x56E0;&#x4E3A;&#x8BA1;&#x7B97;&#x673A;&#x79D1;&#x5B66;&#x4E2D;&#x4E00;&#x4E2A;&#x53EB;&#x505C;&#x673A;&#x95EE;&#x9898;&#x7684;&#x95EE;&#x9898;&#xFF1A;&#x4E00;&#x822C;&#x610F;&#x4E49;&#x4E0A;&#x6CA1;&#x6709;&#x529E;&#x6CD5;&#x77E5;&#x9053;&#xFF0C;&#x4E00;&#x4E2A;&#x7ED9;&#x5B9A;&#x7684;&#x7A0B;&#x5E8F;&#x662F;&#x5426;&#x80FD;&#x5728;&#x6709;&#x9650;&#x7684;&#x65F6;&#x95F4;&#x5185;&#x7ED3;&#x675F;&#x8FD0;&#x884C;&#x3002;</p>
<p>&#x6B63;&#x5982;&#x5728;&#x72B6;&#x6001;&#x8F6C;&#x6362;&#x7AE0;&#x8282;&#x6240;&#x8FF0;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x65B9;&#x6848;&#x901A;&#x8FC7;&#x4E3A;&#x6BCF;&#x4E00;&#x4E2A;&#x4EA4;&#x6613;&#x8BBE;&#x5B9A;&#x8FD0;&#x884C;&#x6267;&#x884C;&#x7684;&#x6700;&#x5927;&#x8BA1;&#x7B97;&#x6B65;&#x6570;&#x6765;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#xFF0C;&#x5982;&#x679C;&#x8D85;&#x8FC7;&#x5219;&#x8BA1;&#x7B97;&#x88AB;&#x6062;&#x590D;&#x539F;&#x72B6;&#x4F46;&#x4F9D;&#x7136;&#x8981;&#x652F;&#x4ED8;&#x8D39;&#x7528;&#x3002;&#x6D88;&#x606F;&#x4EE5;&#x540C;&#x6837;&#x7684;&#x65B9;&#x5F0F;&#x5DE5;&#x4F5C;&#x3002;&#x4E3A;&#x663E;&#x793A;&#x8FD9;&#x4E00;&#x65B9;&#x6848;&#x80CC;&#x540E;&#x7684;&#x52A8;&#x673A;&#xFF0C;&#x8BF7;&#x8003;&#x8651;&#x4E0B;&#x9762;&#x7684;&#x4F8B;&#x5B50;&#xFF1A;</p>
<p>&#x4E00;&#x4E2A;&#x653B;&#x51FB;&#x8005;&#x521B;&#x5EFA;&#x4E86;&#x4E00;&#x4E2A;&#x8FD0;&#x884C;&#x65E0;&#x9650;&#x5FAA;&#x73AF;&#x7684;&#x5408;&#x7EA6;&#xFF0C;&#x7136;&#x540E;&#x53D1;&#x9001;&#x4E86;&#x4E00;&#x4E2A;&#x6FC0;&#x6D3B;&#x5FAA;&#x73AF;&#x7684;&#x4EA4;&#x6613;&#x7ED9;&#x77FF;&#x5DE5;&#xFF0C;&#x77FF;&#x5DE5;&#x5C06;&#x5904;&#x7406;&#x4EA4;&#x6613;&#xFF0C;&#x8FD0;&#x884C;&#x65E0;&#x9650;&#x5FAA;&#x73AF;&#x76F4;&#x5230;&#x71C3;&#x6599;&#x8017;&#x5C3D;&#x3002;&#x5373;&#x4F7F;&#x71C3;&#x6599;&#x8017;&#x5C3D;&#x4EA4;&#x6613;&#x534A;&#x9014;&#x505C;&#x6B62;&#xFF0C;&#x4EA4;&#x6613;&#x4F9D;&#x7136;&#x6B63;&#x786E;&#xFF08;&#x56DE;&#x5230;&#x539F;&#x5904;&#xFF09;&#x5E76;&#x4E14;&#x77FF;&#x5DE5;&#x4F9D;&#x7136;&#x4ECE;&#x653B;&#x51FB;&#x8005;&#x54EA;&#x91CC;&#x6323;&#x5230;&#x4E86;&#x6BCF;&#x4E00;&#x6B65;&#x8BA1;&#x7B97;&#x7684;&#x8D39;&#x7528;&#x3002;</p>
<p>&#x4E00;&#x4E2A;&#x653B;&#x51FB;&#x8005;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x957F;&#x7684;&#x65E0;&#x9650;&#x5FAA;&#x73AF;&#x610F;&#x56FE;&#x8FEB;&#x4F7F;&#x77FF;&#x5DE5;&#x957F;&#x65F6;&#x95F4;&#x5185;&#x4E00;&#x76F4;&#x8BA1;&#x7B97;&#x81F4;&#x4F7F;&#x5728;&#x8BA1;&#x7B97;&#x7ED3;&#x675F;&#x524D;&#x82E5;&#x5E72;&#x533A;&#x5757;&#x5DF2;&#x7ECF;&#x4EA7;&#x751F;&#x4E8E;&#x662F;&#x77FF;&#x5DE5;&#x65E0;&#x6CD5;&#x6536;&#x5F55;&#x4EA4;&#x6613;&#x4EE5;&#x8D5A;&#x53D6;&#x8D39;&#x7528;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x653B;&#x51FB;&#x8005;&#x9700;&#x8981;&#x53D1;&#x5E03;&#x4E00;&#x4E2A; STARTGAS &#x503C;&#x4EE5;&#x9650;&#x5236;&#x53EF;&#x6267;&#x884C;&#x6B65;&#x6570;&#xFF0C;&#x56E0;&#x800C;&#x77FF;&#x5DE5;&#x5C06;&#x63D0;&#x524D;&#x77E5;&#x9053;&#x8BA1;&#x7B97;&#x5C06;&#x8017;&#x8D39;&#x8FC7;&#x591A;&#x7684;&#x6B65;&#x6570;&#x3002;</p>
<p>&#x4E00;&#x4E2A;&#x653B;&#x51FB;&#x8005;&#x770B;&#x5230;&#x4E00;&#x4E2A;&#x5305;&#x542B;&#x8BF8;&#x5982; send(A,contract.storage[A]); contract.storage[A] =  0&#x683C;&#x5F0F;&#x7684;&#x5408;&#x7EA6;&#x7136;&#x540E;&#x53D1;&#x9001;&#x5E26;&#x6709;&#x53EA;&#x591F;&#x6267;&#x884C;&#x7B2C;&#x4E00;&#x6B65;&#x7684;&#x8D39;&#x7528;&#x7684;&#x800C;&#x4E0D;&#x591F;&#x6267;&#x884C;&#x7B2C;&#x4E8C;&#x6B65;&#x7684;&#x4EA4;&#x6613;&#xFF08;&#x5373;&#x63D0;&#x73B0;&#x4F46;&#x4E0D;&#x51CF;&#x5C11;&#x8D26;&#x6237;&#x4F59;&#x989D;&#xFF09;&#x3002;&#x5408;&#x7EA6;&#x4F5C;&#x8005;&#x65E0;&#x9700;&#x62C5;&#x5FC3;&#x9632;&#x536B;&#x7C7B;&#x4F3C;&#x653B;&#x51FB;&#xFF0C;&#x56E0;&#x4E3A;&#x5982;&#x679C;&#x6267;&#x884C;&#x4E2D;&#x9014;&#x505C;&#x6B62;&#x5219;&#x6240;&#x6709;&#x53D8;&#x66F4;&#x90FD;&#x88AB;&#x56DE;&#x590D;&#x3002;</p>
<p>&#x4E00;&#x4E2A;&#x91D1;&#x878D;&#x5408;&#x7EA6;&#x9760;&#x63D0;&#x53D6;&#x4E5D;&#x4E2A;&#x4E13;&#x7528;&#x6570;&#x636E;&#x53D1;&#x5E03;&#x5668;&#x7684;&#x4E2D;&#x503C;&#x6765;&#x5DE5;&#x4F5C;&#x4EE5;&#x6700;&#x5C0F;&#x5316;&#x98CE;&#x9669;&#xFF0C;&#x4E00;&#x4E2A;&#x653B;&#x51FB;&#x8005;&#x63A5;&#x7BA1;&#x4E86;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x63D0;&#x4F9B;&#x5668;&#xFF0C;&#x7136;&#x540E;&#x628A;&#x8FD9;&#x4E2A;&#x6309;DAO&#x7AE0;&#x8282;&#x6240;&#x8FF0;&#x7684;&#x53EF;&#x53D8;&#x5730;&#x5740;&#x8C03;&#x7528;&#x673A;&#x5236;&#x8BBE;&#x8BA1;&#x6210;&#x53EF;&#x66F4;&#x6539;&#x7684;&#x6570;&#x636E;&#x63D0;&#x4F9B;&#x5668;&#x8F6C;&#x4E3A;&#x8FD0;&#x884C;&#x4E00;&#x4E2A;&#x65E0;&#x9650;&#x5FAA;&#x73AF;&#xFF0C;&#x4EE5;&#x6C42;&#x5C1D;&#x8BD5;&#x903C;&#x8FEB;&#x4EFB;&#x4F55;&#x4ECE;&#x6B64;&#x91D1;&#x878D;&#x5408;&#x7EA6;&#x7D22;&#x8981;&#x8D44;&#x91D1;&#x7684;&#x5C1D;&#x8BD5;&#x90FD;&#x4F1A;&#x56E0;&#x71C3;&#x6599;&#x8017;&#x5C3D;&#x800C;&#x4E2D;&#x6B62;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x8BE5;&#x91D1;&#x878D;&#x5408;&#x7EA6;&#x53EF;&#x4EE5;&#x5728;&#x6D88;&#x606F;&#x91CC;&#x8BBE;&#x7F6E;&#x71C3;&#x6599;&#x9650;&#x5236;&#x4EE5;&#x9632;&#x8303;&#x6B64;&#x7C7B;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x56FE;&#x7075;&#x5B8C;&#x5907;&#x7684;&#x66FF;&#x4EE3;&#x662F;&#x56FE;&#x7075;&#x4E0D;&#x5B8C;&#x5907;&#xFF0C;&#x8FD9;&#x91CC; JUMP &#x548C; JUMPI  &#x6307;&#x4EE4;&#x4E0D;&#x5B58;&#x5728;&#x5E76;&#x4E14;&#x5728;&#x67D0;&#x4E2A;&#x7ED9;&#x5B9A;&#x65F6;&#x95F4;&#x6BCF;&#x4E2A;&#x5408;&#x7EA6;&#x53EA;&#x5141;&#x8BB8;&#x6709;&#x4E00;&#x4E2A;&#x62F7;&#x8D1D;&#x5B58;&#x5728;&#x4E8E;&#x8C03;&#x7528;&#x5806;&#x6808;&#x5185;&#x3002;&#x5728;&#x8FD9;&#x6837;&#x7684;&#x7CFB;&#x7EDF;&#x91CC;&#xFF0C;&#x4E0A;&#x8FF0;&#x7684;&#x8D39;&#x7528;&#x7CFB;&#x7EDF;&#x548C;&#x56F4;&#x7ED5;&#x6211;&#x4EEC;&#x7684;&#x65B9;&#x6848;&#x7684;&#x6548;&#x7387;&#x7684;&#x4E0D;&#x786E;&#x5B9A;&#x6027;&#x53EF;&#x80FD;&#x90FD;&#x662F;&#x4E0D;&#x9700;&#x8981;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x6267;&#x884C;&#x4E00;&#x4E2A;&#x5408;&#x7EA6;&#x7684;&#x6210;&#x672C;&#x5C06;&#x88AB;&#x5B83;&#x7684;&#x5927;&#x5C0F;&#x51B3;&#x5B9A;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x56FE;&#x7075;&#x4E0D;&#x5B8C;&#x5907;&#x751A;&#x81F3;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x5927;&#x7684;&#x9650;&#x5236;&#xFF0C;&#x5728;&#x6211;&#x4EEC;&#x5185;&#x90E8;&#x8BBE;&#x60F3;&#x7684;&#x6240;&#x6709;&#x5408;&#x7EA6;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x81F3;&#x4ECA;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x9700;&#x8981;&#x5FAA;&#x73AF;&#xFF0C;&#x800C;&#x4E14;&#x5373;&#x4F7F;&#x8FD9;&#x5FAA;&#x73AF;&#x4E5F;&#x53EF;&#x4EE5;&#x88AB;26&#x4E2A;&#x5355;&#x884C;&#x4EE3;&#x7801;&#x6BB5;&#x7684;&#x91CD;&#x590D;&#x6240;&#x4EE3;&#x66FF;&#x3002;&#x8003;&#x8651;&#x5230;&#x56FE;&#x7075;&#x5B8C;&#x5907;&#x5E26;&#x6765;&#x7684;&#x4E25;&#x91CD;&#x7684;&#x9EBB;&#x70E6;&#x548C;&#x6709;&#x9650;&#x7684;&#x76CA;&#x5904;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x4E0D;&#x7B80;&#x5355;&#x5730;&#x4F7F;&#x7528;&#x4E00;&#x79CD;&#x56FE;&#x7075;&#x4E0D;&#x5B8C;&#x5907;&#x8BED;&#x8A00;&#x5462;&#xFF1F;&#x4E8B;&#x5B9E;&#x4E0A;&#x56FE;&#x7075;&#x4E0D;&#x5B8C;&#x5907;&#x8FDC;&#x975E;&#x4E00;&#x4E2A;&#x7B80;&#x6D01;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x3002;&#x4E3A;&#x4EC0;&#x4E48;&#xFF1F;&#x8BF7;&#x8003;&#x8651;&#x4E0B;&#x9762;&#x7684;&#x5408;&#x7EA6;&#xFF1A;</p>
<pre><code>C0: call(C1)&#x37E; call(C1)&#x37E;

C1: call(C2)&#x37E; call(C2)&#x37E;

C2: call(C3)&#x37E; call(C3)&#x37E;

&#x2026;

C49: call(C50)&#x37E; call(C50)&#x37E;

C50: (run one step of a program and record the change in storage)
</code></pre><p>&#x73B0;&#x5728;&#xFF0C;&#x53D1;&#x9001;&#x4E00;&#x4E2A;&#x8FD9;&#x6837;&#x7684;&#x4EA4;&#x6613;&#x7ED9;A&#xFF0C;&#x8FD9;&#x6837;&#xFF0C;&#x5728;51&#x4E2A;&#x4EA4;&#x6613;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x6709;&#x4E86;&#x4E00;&#x4E2A;&#x9700;&#x8981;&#x82B1;&#x8D39;250  &#x6B65;&#x8BA1;&#x7B97;&#x7684;&#x5408;&#x7EA6;&#xFF0C;&#x77FF;&#x5DE5;&#x53EF;&#x80FD;&#x5C1D;&#x8BD5;&#x901A;&#x8FC7;&#x4E3A;&#x6BCF;&#x4E00;&#x4E2A;&#x5408;&#x7EA6;&#x7EF4;&#x62A4;&#x4E00;&#x4E2A;&#x6700;&#x9AD8;&#x53EF;&#x6267;&#x884C;&#x6B65;&#x6570;&#x5E76;&#x4E14;&#x5BF9;&#x4E8E;&#x9012;&#x5F52;&#x8C03;&#x7528;&#x5176;&#x5B83;&#x5408;&#x7EA6;&#x7684;&#x5408;&#x7EA6;&#x8BA1;&#x7B97;&#x53EF;&#x80FD;&#x6267;&#x884C;&#x6B65;&#x6570;&#x4ECE;&#x800C;&#x9884;&#x5148;&#x68C0;&#x6D4B;&#x8FD9;&#x6837;&#x7684;&#x903B;&#x8F91;&#x70B8;&#x5F39;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x4F1A;&#x4F7F;&#x77FF;&#x5DE5;&#x7981;&#x6B62;&#x521B;&#x5EFA;&#x5176;&#x5B83;&#x5408;&#x7EA6;&#x7684;&#x5408;&#x7EA6;&#xFF08;&#x56E0;&#x4E3A;&#x4E0A;&#x9762;26&#x4E2A;&#x5408;&#x7EA6;&#x7684;&#x521B;&#x5EFA;&#x548C;&#x6267;&#x884C;&#x53EF;&#x4EE5;&#x5F88;&#x5BB9;&#x6613;&#x5730;&#x653E;&#x5165;&#x4E00;&#x4E2A;&#x5355;&#x72EC;&#x5408;&#x7EA6;&#x5185;&#xFF09;&#x3002;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#x70B9;&#x662F;&#x4E00;&#x4E2A;&#x6D88;&#x606F;&#x7684;&#x5730;&#x5740;&#x5B57;&#x6BB5;&#x662F;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#xFF0C;&#x6240;&#x4EE5;&#x901A;&#x5E38;&#x6765;&#x8BB2;&#x53EF;&#x80FD;&#x751A;&#x81F3;&#x65E0;&#x6CD5;&#x9884;&#x5148;&#x77E5;&#x9053;&#x4E00;&#x4E2A;&#x5408;&#x7EA6;&#x5C06;&#x8981;&#x8C03;&#x7528;&#x7684;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x5408;&#x7EA6;&#x662F;&#x54EA;&#x4E00;&#x4E2A;&#x3002;&#x4E8E;&#x662F;&#xFF0C;&#x6700;&#x7EC8;&#x6211;&#x4EEC;&#x6709;&#x4E86;&#x4E00;&#x4E2A;&#x60CA;&#x4EBA;&#x7684;&#x7ED3;&#x8BBA;&#xFF1A;&#x56FE;&#x7075;&#x5B8C;&#x5907;&#x7684;&#x7BA1;&#x7406;&#x60CA;&#x4EBA;&#x5730;&#x5BB9;&#x6613;&#xFF0C;&#x800C;&#x5728;&#x7F3A;&#x4E4F;&#x540C;&#x6837;&#x7684;&#x63A7;&#x5236;&#x65F6;&#x56FE;&#x7075;&#x4E0D;&#x5B8C;&#x5907;&#x7684;&#x7BA1;&#x7406;&#x60CA;&#x4EBA;&#x5730;&#x56F0;&#x96BE;-  &#x90A3;&#x4E3A;&#x4EC0;&#x4E48;&#x4E0D;&#x8BA9;&#x534F;&#x8BAE;&#x56FE;&#x7075;&#x5B8C;&#x5907;&#x5462;&#xFF1F;</p>
<h3 id="&#x8D27;&#x5E01;&#x548C;&#x53D1;&#x884C;">&#x8D27;&#x5E01;&#x548C;&#x53D1;&#x884C;</h3>
<p>&#x4EE5;&#x592A;&#x574A;&#x7F51;&#x7EDC;&#x5305;&#x542B;&#x81EA;&#x8EAB;&#x7684;&#x5185;&#x7F6E;&#x8D27;&#x5E01;&#x4EE5;&#x592A;&#x5E01;&#xFF0C;&#x4EE5;&#x592A;&#x5E01;&#x626E;&#x6F14;&#x53CC;&#x91CD;&#x89D2;&#x8272;&#xFF0C;&#x4E3A;&#x5404;&#x79CD;&#x6570;&#x5B57;&#x8D44;&#x4EA7;&#x4EA4;&#x6613;&#x63D0;&#x4F9B;&#x4E3B;&#x8981;&#x7684;&#x6D41;&#x52A8;&#x6027;&#xFF0C;&#x66F4;&#x91CD;&#x8981;&#x7684;&#x662F;&#x63D0;&#x4F9B;&#x4E86;&#x4E86;&#x652F;&#x4ED8;&#x4EA4;&#x6613;&#x8D39;&#x7528;&#x7684;&#x4E00;&#x79CD;&#x673A;&#x5236;&#x3002;&#x4E3A;&#x4FBF;&#x5229;&#x53CA;&#x907F;&#x514D;&#x5C06;&#x6765;&#x7684;&#x4E89;&#x8BAE;&#x671F;&#x95F4;&#xFF08;&#x53C2;&#x89C1;&#x5F53;&#x524D;&#x7684;mBTC/uBTC/&#x806A;&#x7684;&#x4E89;&#x8BBA;&#xFF09;&#xFF0C;&#x4E0D;&#x540C;&#x9762;&#x503C;&#x7684;&#x540D;&#x79F0;&#x5C06;&#x88AB;&#x63D0;&#x524D;&#x8BBE;&#x7F6E;&#xFF1A;</p>
<ul>
<li>1: &#x4F1F;</li>
<li>10^12: &#x8428;&#x535A;</li>
<li>10^15: &#x82AC;&#x5C3C;</li>
<li>10^18: &#x4EE5;&#x592A;</li>
</ul>
<p>&#x8FD9;&#x5E94;&#x8BE5;&#x88AB;&#x5F53;&#x4F5C;&#x662F;&#x201C;&#x5143;&#x201D;&#x548C;&#x201C;&#x5206;&#x201D;&#x6216;&#x8005;&#x201C;&#x6BD4;&#x7279;&#x5E01;&#x201D;&#x548C;&#x201C;&#x806A;&#x201D;&#x7684;&#x6982;&#x5FF5;&#x7684;&#x6269;&#x5C55;&#x7248;&#xFF0C;&#x5728;&#x4E0D;&#x8FDC;&#x7684;&#x5C06;&#x6765;&#xFF0C;&#x6211;&#x4EEC;&#x671F;&#x671B;&#x201C;&#x4EE5;&#x592A;&#x201D;&#x88AB;&#x7528;&#x4F5C;&#x666E;&#x901A;&#x4EA4;&#x6613;&#xFF0C;&#x201C;&#x82AC;&#x5C3C;&#x201D;&#x7528;&#x6765;&#x8FDB;&#x884C;&#x5FAE;&#x4EA4;&#x6613;&#xFF0C;&#x201C;&#x8428;&#x535A;&#x201D;&#x548C;&#x201C;&#x4F1F;&#x201D;&#x7528;&#x6765;&#x8FDB;&#x884C;&#x5173;&#x4E8E;&#x8D39;&#x7528;&#x548C;&#x534F;&#x8BAE;&#x5B9E;&#x65BD;&#x7684;&#x8BA8;&#x8BBA;&#x3002;</p>
<p>&#x53D1;&#x884C;&#x6A21;&#x5F0F;&#x5982;&#x4E0B;&#xFF1A;</p>
<ul>
<li>&#x901A;&#x8FC7;&#x53D1;&#x552E;&#x6D3B;&#x52A8;&#xFF0C;&#x4EE5;&#x592A;&#x5E01;&#x5C06;&#x4EE5;&#x6BCF;BTC  1337-2000&#x4EE5;&#x592A;&#x7684;&#x4EF7;&#x683C;&#x53D1;&#x552E;&#xFF0C;&#x4E00;&#x4E2A;&#x65E8;&#x5728;&#x4E3A;&#x4EE5;&#x592A;&#x574A;&#x7EC4;&#x7EC7;&#x7B79;&#x8D44;&#x5E76;&#x4E14;&#x4E3A;&#x5F00;&#x53D1;&#x8005;&#x652F;&#x4ED8;&#x62A5;&#x916C;&#x7684;&#x673A;&#x5236;&#x5DF2;&#x7ECF;&#x5728;&#x5176;&#x5B83;&#x4E00;&#x4E9B;&#x5BC6;&#x7801;&#x5B66;&#x8D27;&#x5E01;&#x5E73;&#x53F0;&#x4E0A;&#x6210;&#x529F;&#x4F7F;&#x7528;&#x3002;&#x65E9;&#x671F;&#x8D2D;&#x4E70;&#x8005;&#x4F1A;&#x4EAB;&#x53D7;&#x8F83;&#x5927;&#x7684;&#x6298;&#x6263;&#xFF0C;&#x53D1;&#x552E;&#x6240;&#x5F97;&#x7684;BTC&#x5C06;&#x5B8C;&#x5168;&#x7528;&#x6765;&#x652F;&#x4ED8;&#x5F00;&#x53D1;&#x8005;&#x548C;&#x7814;&#x7A76;&#x8005;&#x7684;&#x5DE5;&#x8D44;&#x548C;&#x60AC;&#x8D4F;&#xFF0C;&#x4EE5;&#x53CA;&#x6295;&#x5165;&#x5BC6;&#x7801;&#x5B66;&#x8D27;&#x5E01;&#x751F;&#x6001;&#x7CFB;&#x7EDF;&#x7684;&#x9879;&#x76EE;&#x3002;</li>
<li>0.099x &#xFF08;x&#x4E3A;&#x53D1;&#x552E;&#x603B;&#x91CF;&#xFF09;&#x5C06;&#x88AB;&#x5206;&#x914D;&#x7ED9;BTC&#x878D;&#x8D44;&#x6216;&#x5176;&#x5B83;&#x7684;&#x786E;&#x5B9A;&#x6027;&#x878D;&#x8D44;&#x6210;&#x529F;&#x4E4B;&#x524D;&#x53C2;&#x4E0E;&#x5F00;&#x53D1;&#x7684;&#x65E9;&#x671F;&#x8D21;&#x732E;&#x8005;&#xFF0C;&#x53E6;&#x5916;&#x4E00;&#x4E2A;0.099x&#x5C06;&#x5206;&#x914D;&#x7ED9;&#x957F;&#x671F;&#x7814;&#x7A76;&#x9879;&#x76EE;&#x3002;</li>
<li>&#x81EA;&#x4E0A;&#x7EBF;&#x65F6;&#x8D77;&#x6BCF;&#x5E74;&#x90FD;&#x5C06;&#x6709;0.26x&#xFF08;x&#x4E3A;&#x53D1;&#x552E;&#x603B;&#x91CF;&#xFF09;&#x88AB;&#x77FF;&#x5DE5;&#x6316;&#x51FA;&#x3002;</li>
</ul>
<h3 id="&#x53D1;&#x884C;&#x5206;&#x89E3;">&#x53D1;&#x884C;&#x5206;&#x89E3;</h3>
<p>&#x6C38;&#x4E45;&#x7EBF;&#x6027;&#x589E;&#x957F;&#x6A21;&#x578B;&#x964D;&#x4F4E;&#x4E86;&#x5728;&#x6BD4;&#x7279;&#x5E01;&#x4E2D;&#x51FA;&#x73B0;&#x7684;&#x8D22;&#x5BCC;&#x8FC7;&#x4E8E;&#x96C6;&#x4E2D;&#x7684;&#x98CE;&#x9669;&#xFF0C;&#x5E76;&#x4E14;&#x7ED9;&#x4E88;&#x4E86;&#x6D3B;&#x5728;&#x5F53;&#x4E0B;&#x548C;&#x5C06;&#x6765;&#x7684;&#x4EBA;&#x516C;&#x5E73;&#x7684;&#x673A;&#x4F1A;&#x53BB;&#x83B7;&#x53D6;&#x8D27;&#x5E01;&#xFF0C;&#x540C;&#x65F6;&#x4FDD;&#x6301;&#x4E86;&#x5BF9;&#x83B7;&#x53D6;&#x548C;&#x6301;&#x6709;&#x4EE5;&#x592A;&#x5E01;&#x7684;&#x6FC0;&#x52B1;&#xFF0C;&#x56E0;&#x4E3A;&#x957F;&#x671F;&#x6765;&#x770B;&#x201C;&#x8D27;&#x5E01;&#x4F9B;&#x5E94;&#x589E;&#x957F;&#x7387;&#x201D;&#x662F;&#x8D8B;&#x4E8E;&#x96F6;&#x7684;&#x3002;&#x6211;&#x4EEC;&#x8FD8;&#x63A8;&#x65AD;&#xFF0C;&#x968F;&#x7740;&#x65F6;&#x95F4;&#x6D41;&#x901D;&#x603B;&#x4F1A;&#x53D1;&#x751F;&#x56E0;&#x4E3A;&#x7C97;&#x5FC3;&#x548C;&#x6B7B;&#x4EA1;&#x7B49;&#x539F;&#x56E0;&#x5E26;&#x6765;&#x7684;&#x5E01;&#x7684;&#x9057;&#x5931;&#xFF0C;&#x5047;&#x8BBE;&#x5E01;&#x7684;&#x9057;&#x5931;&#x662F;&#x6BCF;&#x5E74;&#x8D27;&#x5E01;&#x4F9B;&#x5E94;&#x91CF;&#x7684;&#x4E00;&#x4E2A;&#x56FA;&#x5B9A;&#x6BD4;&#x4F8B;&#xFF0C;&#x5219;&#x6700;&#x7EC8;&#x603B;&#x7684;&#x6D41;&#x901A;&#x4E2D;&#x7684;&#x8D27;&#x5E01;&#x4F9B;&#x5E94;&#x91CF;&#x4F1A;&#x7A33;&#x5B9A;&#x5728;&#x4E00;&#x4E2A;&#x7B49;&#x4E8E;&#x5E74;&#x8D27;&#x5E01;&#x53D1;&#x884C;&#x91CF;&#x9664;&#x4EE5;&#x9057;&#x5931;&#x7387;&#x7684;&#x503C;&#x4E0A;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x5F53;&#x9057;&#x5931;&#x7387;&#x4E3A;1%&#x65F6;&#xFF0C;&#x5F53;&#x4F9B;&#x5E94;&#x91CF;&#x8FBE;&#x5230;30x&#x65F6;&#xFF0C;&#x6BCF;&#x5E74;&#x6709;0.3x&#x88AB;&#x6316;&#x51FA;&#x540C;&#x65F6;&#x6709;0.3x&#x4E22;&#x5931;&#xFF0C;&#x8FBE;&#x5230;&#x4E00;&#x4E2A;&#x5747;&#x8861;&#xFF09;&#x3002;</p>
<p>&#x9664;&#x4E86;&#x7EBF;&#x6027;&#x7684;&#x53D1;&#x884C;&#x65B9;&#x5F0F;&#x5916;&#xFF0C;&#x548C;&#x6BD4;&#x7279;&#x5E01;&#x4E00;&#x6837;&#x4EE5;&#x592A;&#x5E01;&#x7684;&#x7684;&#x4F9B;&#x5E94;&#x91CF;&#x589E;&#x957F;&#x7387;&#x957F;&#x671F;&#x6765;&#x770B;&#x4E5F;&#x8D8B;&#x4E8E;&#x96F6;&#x3002;</p>
<h3 id="&#x6316;&#x77FF;&#x7684;&#x4E2D;&#x5FC3;&#x5316;">&#x6316;&#x77FF;&#x7684;&#x4E2D;&#x5FC3;&#x5316;</h3>
<p>&#x6BD4;&#x7279;&#x5E01;&#x6316;&#x77FF;&#x7B97;&#x6CD5;&#x57FA;&#x672C;&#x4E0A;&#x662F;&#x8BA9;&#x77FF;&#x5DE5;&#x5343;&#x4E07;&#x6B21;&#x5730;&#x8F7B;&#x5FAE;&#x6539;&#x52A8;&#x533A;&#x5757;&#x5934;&#xFF0C;&#x76F4;&#x5230;&#x6700;&#x7EC8;&#x67D0;&#x4E2A;&#x8282;&#x70B9;&#x7684;&#x6539;&#x52A8;&#x7248;&#x672C;&#x7684;&#x54C8;&#x5E0C;&#x5C0F;&#x4E8E;&#x76EE;&#x6807;&#x503C;&#xFF08;&#x76EE;&#x524D;&#x662F;&#x5927;&#x7EA6;2190&#xFF09;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x8FD9;&#x79CD;&#x6316;&#x77FF;&#x7B97;&#x6CD5;&#x5BB9;&#x6613;&#x88AB;&#x4E24;&#x79CD;&#x5F62;&#x5F0F;&#x7684;&#x4E2D;&#x5FC3;&#x5316;&#x653B;&#x51FB;&#x3002;&#x7B2C;&#x4E00;&#x79CD;&#xFF0C;&#x6316;&#x77FF;&#x751F;&#x6001;&#x7CFB;&#x7EDF;&#x88AB;&#x4E13;&#x95E8;&#x8BBE;&#x8BA1;&#x7684;&#x56E0;&#x800C;&#x5728;&#x6BD4;&#x7279;&#x5E01;&#x6316;&#x77FF;&#x8FD9;&#x4E00;&#x7279;&#x6B8A;&#x4EFB;&#x52A1;&#x4E0A;&#x6548;&#x7387;&#x63D0;&#x9AD8;&#x4E0A;&#x5343;&#x500D;&#x7684;ASICs&#xFF08;&#x4E13;&#x7528;&#x96C6;&#x6210;&#x7535;&#x8DEF;&#xFF09;&#x548C;&#x7535;&#x8111;&#x82AF;&#x7247;&#x63A7;&#x5236;&#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x6BD4;&#x7279;&#x5E01;&#x6316;&#x77FF;&#x4E0D;&#x518D;&#x662F;&#x9AD8;&#x5EA6;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x7684;&#x548C;&#x8FFD;&#x6C42;&#x5E73;&#x7B49;&#x4E3B;&#x4E49;&#x7684;&#xFF0C;&#x800C;&#x662F;&#x9700;&#x8981;&#x5DE8;&#x989D;&#x8D44;&#x672C;&#x7684;&#x6709;&#x6548;&#x53C2;&#x4E0E;&#x3002;&#x7B2C;&#x4E8C;&#x79CD;&#xFF0C;&#x5927;&#x90E8;&#x5206;&#x6BD4;&#x7279;&#x5E01;&#x77FF;&#x5DE5;&#x4E8B;&#x5B9E;&#x4E0A;&#x4E0D;&#x518D;&#x5728;&#x672C;&#x5730;&#x5B8C;&#x6210;&#x533A;&#x5757;&#x9A8C;&#x8BC1;&#xFF1B;&#x800C;&#x662F;&#x4F9D;&#x8D56;&#x4E2D;&#x5FC3;&#x5316;&#x7684;&#x77FF;&#x6C60;&#x63D0;&#x4F9B;&#x533A;&#x5757;&#x5934;&#x3002;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x53EF;&#x4EE5;&#x8BF4;&#x5F88;&#x4E25;&#x91CD;&#xFF1A;&#x5728;&#x672C;&#x6587;&#x5199;&#x4F5C;&#x65F6;&#xFF0C;&#x6700;&#x5927;&#x7684;&#x4E24;&#x4E2A;&#x77FF;&#x6C60;&#x95F4;&#x63A5;&#x5730;&#x63A7;&#x5236;&#x4E86;&#x5927;&#x7EA6;&#x5168;&#x7F51;50%&#x7684;&#x7B97;&#x529B;&#xFF0C;&#x867D;&#x7136;&#x5F53;&#x4E00;&#x4E2A;&#x77FF;&#x6C60;&#x6216;&#x8054;&#x5408;&#x4F53;&#x5C1D;&#x8BD5;51%&#x653B;&#x51FB;&#x65F6;&#x77FF;&#x5DE5;&#x53EF;&#x4EE5;&#x8F6C;&#x6362;&#x5230;&#x5176;&#x5B83;&#x77FF;&#x6C60;&#x8FD9;&#x4E00;&#x4E8B;&#x5B9E;&#x51CF;&#x8F7B;&#x4E86;&#x95EE;&#x9898;&#x7684;&#x4E25;&#x91CD;&#x6027;&#x3002;</p>
<p>&#x4EE5;&#x592A;&#x574A;&#x73B0;&#x5728;&#x7684;&#x76EE;&#x7684;&#x662F;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x57FA;&#x4E8E;&#x4E3A;&#x6BCF;1000&#x4E2A;&#x968F;&#x673A;&#x6570;&#x968F;&#x673A;&#x4EA7;&#x751F;&#x552F;&#x4E00;&#x54C8;&#x5E0C;&#x7684;&#x51FD;&#x6570;&#x7684;&#x6316;&#x77FF;&#x7B97;&#x6CD5;&#xFF0C;&#x7528;&#x8DB3;&#x591F;&#x5BBD;&#x7684;&#x8BA1;&#x7B97;&#x57DF;&#xFF0C;&#x53BB;&#x9664;&#x4E13;&#x7528;&#x786C;&#x4EF6;&#x7684;&#x4F18;&#x52BF;&#x3002;&#x8FD9;&#x6837;&#x7684;&#x7B56;&#x7565;&#x5F53;&#x7136;&#x4E0D;&#x4F1A;&#x4F7F;&#x4E2D;&#x5FC3;&#x5316;&#x7684;&#x6536;&#x76CA;&#x51CF;&#x5C11;&#x4E3A;&#x96F6;&#xFF0C;&#x4F46;&#x662F;&#x4E5F;&#x4E0D;&#x9700;&#x8981;&#x3002;&#x6CE8;&#x610F;&#x6BCF;&#x5355;&#x4E2A;&#x7528;&#x6237;&#x4F7F;&#x7528;&#x4ED6;&#x4EEC;&#x7684;&#x79C1;&#x4EBA;&#x7B14;&#x8BB0;&#x672C;&#x7535;&#x8111;&#x6216;&#x53F0;&#x5F0F;&#x673A;&#x5C31;&#x53EF;&#x4EE5;&#x51E0;&#x4E4E;&#x514D;&#x8D39;&#x5730;&#x5B8C;&#x6210;&#x4E00;&#x5B9A;&#x91CF;&#x7684;&#x6316;&#x77FF;&#x6D3B;&#x52A8;&#xFF0C;&#x4F46;&#x5F53;&#x5230;&#x4E86;100%&#x7684;CPU&#x4F7F;&#x7528;&#x7387;&#x4E4B;&#x540E;&#x66F4;&#x591A;&#x5730;&#x6316;&#x77FF;&#x5C31;&#x4F1A;&#x9700;&#x8981;&#x4ED6;&#x4EEC;&#x652F;&#x4ED8;&#x7535;&#x529B;&#x548C;&#x786C;&#x4EF6;&#x6210;&#x672C;&#x3002;ASIC&#x6316;&#x77FF;&#x516C;&#x53F8;&#x9700;&#x8981;&#x4ECE;&#x7B2C;&#x4E00;&#x4E2A;&#x54C8;&#x5E0C;&#x5F00;&#x59CB;&#x5C31;&#x4E3A;&#x7535;&#x529B;&#x548C;&#x786C;&#x4EF6;&#x652F;&#x4ED8;&#x6210;&#x672C;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x5982;&#x679C;&#x4E2D;&#x5FC3;&#x5316;&#x6536;&#x76CA;&#x80FD;&#x591F;&#x4FDD;&#x6301;&#x5728;(E  + H) /E  &#x4EE5;&#x4E0B;&#xFF0C;&#x90A3;&#x4E48;&#x5373;&#x4F7F;ASICs&#x88AB;&#x5236;&#x9020;&#x51FA;&#x6765;&#x666E;&#x901A;&#x77FF;&#x5DE5;&#x4F9D;&#x7136;&#x6709;&#x751F;&#x5B58;&#x7A7A;&#x95F4;&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x6211;&#x4EEC;&#x8BA1;&#x5212;&#x5C06;&#x6316;&#x77FF;&#x7B97;&#x6CD5;&#x8BBE;&#x8BA1;&#x6210;&#x6316;&#x77FF;&#x9700;&#x8981;&#x8BBF;&#x95EE;&#x6574;&#x4E2A;&#x533A;&#x5757;&#x94FE;&#xFF0C;&#x8FEB;&#x4F7F;&#x77FF;&#x5DE5;&#x5B58;&#x50A8;&#x5B8C;&#x6210;&#x7684;&#x533A;&#x5757;&#x94FE;&#x6216;&#x8005;&#x81F3;&#x5C11;&#x80FD;&#x591F;&#x9A8C;&#x8BC1;&#x6BCF;&#x7B14;&#x4EA4;&#x6613;&#x3002;&#x8FD9;&#x53BB;&#x9664;&#x4E86;&#x5BF9;&#x4E2D;&#x5FC3;&#x5316;&#x77FF;&#x6C60;&#x7684;&#x9700;&#x8981;&#xFF1B;&#x867D;&#x7136;&#x77FF;&#x6C60;&#x4F9D;&#x7136;&#x53EF;&#x4EE5;&#x626E;&#x6F14;&#x5E73;&#x6ED1;&#x6536;&#x76CA;&#x5206;&#x914D;&#x7684;&#x968F;&#x673A;&#x6027;&#x7684;&#x89D2;&#x8272;&#xFF0C;&#x4F46;&#x8FD9;&#x529F;&#x80FD;&#x53EF;&#x4EE5;&#x88AB;&#x6CA1;&#x6709;&#x4E2D;&#x5FC3;&#x5316;&#x63A7;&#x5236;&#x7684;P2P&#x77FF;&#x6C60;&#x5B8C;&#x6210;&#x5730;&#x540C;&#x6837;&#x597D;&#x3002;&#x8FD9;&#x6837;&#x5373;&#x4F7F;&#x5927;&#x90E8;&#x5206;&#x666E;&#x901A;&#x7528;&#x6237;&#x4F9D;&#x7136;&#x503E;&#x5411;&#x9009;&#x62E9;&#x8F7B;&#x5BA2;&#x6237;&#x7AEF;&#xFF0C;&#x901A;&#x8FC7;&#x589E;&#x52A0;&#x7F51;&#x7EDC;&#x4E2D;&#x7684;&#x5168;&#x8282;&#x70B9;&#x6570;&#x91CF;&#x4E5F;&#x6709;&#x52A9;&#x4E8E;&#x62B5;&#x5FA1;&#x4E2D;&#x5FC3;&#x5316;&#x3002;</p>
<h3 id="&#x6269;&#x5C55;&#x6027;">&#x6269;&#x5C55;&#x6027;</h3>
<p>&#x6269;&#x5C55;&#x6027;&#x95EE;&#x9898;&#x662F;&#x4EE5;&#x592A;&#x574A;&#x5E38;&#x88AB;&#x5173;&#x6CE8;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x4E0E;&#x6BD4;&#x7279;&#x5E01;&#x4E00;&#x6837;&#xFF0C;&#x4EE5;&#x592A;&#x574A;&#x4E5F;&#x906D;&#x53D7;&#x7740;&#x6BCF;&#x4E2A;&#x4EA4;&#x6613;&#x90FD;&#x9700;&#x8981;&#x7F51;&#x7EDC;&#x4E2D;&#x7684;&#x6BCF;&#x4E2A;&#x8282;&#x70B9;&#x5904;&#x7406;&#x8FD9;&#x4E00;&#x56F0;&#x5883;&#x7684;&#x6298;&#x78E8;&#x3002;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x5F53;&#x524D;&#x533A;&#x5757;&#x94FE;&#x5927;&#x5C0F;&#x7EA6;&#x4E3A;20GB&#xFF0C;&#x4EE5;&#x6BCF;&#x5C0F;&#x65F6;1MB&#x7684;&#x901F;&#x5EA6;&#x589E;&#x957F;&#x3002;&#x5982;&#x679C;&#x6BD4;&#x7279;&#x5E01;&#x7F51;&#x7EDC;&#x5904;&#x7406;Visa&#x7EA7;&#x7684;2000tps&#x7684;&#x4EA4;&#x6613;&#xFF0C;&#x5B83;&#x5C06;&#x4EE5;&#x6BCF;&#x4E09;&#x79D2;1MB&#x7684;&#x901F;&#x5EA6;&#x589E;&#x957F;&#xFF08;1GB&#x6BCF;&#x5C0F;&#x65F6;&#xFF0C;8TB&#x6BCF;&#x5E74;&#xFF09;&#x3002;&#x4EE5;&#x592A;&#x574A;&#x53EF;&#x80FD;&#x4E5F;&#x4F1A;&#x7ECF;&#x5386;&#x76F8;&#x4F3C;&#x7684;&#x751A;&#x81F3;&#x66F4;&#x7CDF;&#x7684;&#x589E;&#x957F;&#x6A21;&#x5F0F;&#xFF0C;&#x56E0;&#x4E3A;&#x5728;&#x4EE5;&#x592A;&#x574A;&#x533A;&#x5757;&#x94FE;&#x4E4B;&#x4E0A;&#x8FD8;&#x6709;&#x5F88;&#x591A;&#x5E94;&#x7528;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x50CF;&#x6BD4;&#x7279;&#x5E01;&#x53EA;&#x662F;&#x7B80;&#x5355;&#x7684;&#x8D27;&#x5E01;&#xFF0C;&#x4F46;&#x4EE5;&#x592A;&#x574A;&#x5168;&#x8282;&#x70B9;&#x53EA;&#x9700;&#x5B58;&#x50A8;&#x72B6;&#x6001;&#x800C;&#x4E0D;&#x662F;&#x5B8C;&#x6574;&#x7684;&#x533A;&#x5757;&#x94FE;&#x5386;&#x53F2;&#x8FD9;&#x4E00;&#x4E8B;&#x5B9E;&#x8BA9;&#x60C5;&#x51B5;&#x5F97;&#x5230;&#x4E86;&#x6539;&#x5584;&#x3002;</p>
<p>&#x5927;&#x533A;&#x5757;&#x94FE;&#x7684;&#x95EE;&#x9898;&#x662F;&#x4E2D;&#x5FC3;&#x5316;&#x98CE;&#x9669;&#x3002;&#x5982;&#x679C;&#x5757;&#x94FE;&#x5927;&#x5C0F;&#x589E;&#x52A0;&#x81F3;&#x6BD4;&#x5982;100TB&#xFF0C;&#x53EF;&#x80FD;&#x7684;&#x573A;&#x666F;&#x5C06;&#x662F;&#x53EA;&#x6709;&#x975E;&#x5E38;&#x5C0F;&#x6570;&#x76EE;&#x7684;&#x5927;&#x5546;&#x5BB6;&#x4F1A;&#x8FD0;&#x884C;&#x5168;&#x8282;&#x70B9;&#xFF0C;&#x800C;&#x5E38;&#x89C4;&#x7528;&#x6237;&#x4F7F;&#x7528;&#x8F7B;&#x7684;SPV&#x8282;&#x70B9;&#x3002;&#x8FD9;&#x4F1A;&#x589E;&#x52A0;&#x5BF9;&#x5168;&#x8282;&#x70B9;&#x5408;&#x4F19;&#x6B3A;&#x8BC8;&#x725F;&#x5229;&#xFF08;&#x4F8B;&#x5982;&#x66F4;&#x6539;&#x533A;&#x5757;&#x5956;&#x52B1;&#xFF0C;&#x7ED9;&#x4ED6;&#x4EEC;&#x81EA;&#x5DF1;BTC&#xFF09;&#x7684;&#x98CE;&#x9669;&#x7684;&#x62C5;&#x5FE7;&#x3002;&#x8F7B;&#x8282;&#x70B9;&#x5C06;&#x6CA1;&#x6709;&#x529E;&#x6CD5;&#x7ACB;&#x523B;&#x68C0;&#x6D4B;&#x5230;&#x8FD9;&#x79CD;&#x6B3A;&#x8BC8;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x81F3;&#x5C11;&#x53EF;&#x80FD;&#x5B58;&#x5728;&#x4E00;&#x4E2A;&#x8BDA;&#x5B9E;&#x7684;&#x5168;&#x8282;&#x70B9;&#xFF0C;&#x5E76;&#x4E14;&#x51E0;&#x4E2A;&#x5C0F;&#x65F6;&#x4E4B;&#x540E;&#x6709;&#x5173;&#x8BC8;&#x9A97;&#x7684;&#x4FE1;&#x606F;&#x4F1A;&#x901A;&#x8FC7;Reddit&#x8FD9;&#x6837;&#x7684;&#x6E20;&#x9053;&#x6CC4;&#x9732;&#xFF0C;&#x4F46;&#x8FD9;&#x65F6;&#x5DF2;&#x7ECF;&#x592A;&#x665A;&#xFF1A;&#x4EFB;&#x51ED;&#x666E;&#x901A;&#x7528;&#x6237;&#x505A;&#x51FA;&#x600E;&#x6837;&#x7684;&#x52AA;&#x529B;&#x53BB;&#x5E9F;&#x9664;&#x5DF2;&#x7ECF;&#x4EA7;&#x751F;&#x7684;&#x533A;&#x5757;&#xFF0C;&#x4ED6;&#x4EEC;&#x90FD;&#x4F1A;&#x9047;&#x5230;&#x4E0E;&#x53D1;&#x52A8;&#x4E00;&#x6B21;&#x6210;&#x529F;&#x7684;51%&#x653B;&#x51FB;&#x540C;&#x7B49;&#x89C4;&#x6A21;&#x7684;&#x5DE8;&#x5927;&#x7684;&#x4E0D;&#x53EF;&#x884C;&#x7684;&#x534F;&#x8C03;&#x95EE;&#x9898;&#x3002;&#x5728;&#x6BD4;&#x7279;&#x5E01;&#x8FD9;&#x91CC;&#xFF0C;&#x73B0;&#x5728;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x4F46;Peter  Todd&#x5EFA;&#x8BAE;&#x7684;&#x4E00;&#x4E2A;&#x6539;&#x52A8;&#x53EF;&#x4EE5;&#x7F13;&#x89E3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x8FD1;&#x671F;&#xFF0C;&#x4EE5;&#x592A;&#x574A;&#x4F1A;&#x4F7F;&#x7528;&#x4E24;&#x4E2A;&#x9644;&#x52A0;&#x7684;&#x7B56;&#x7565;&#x4EE5;&#x5E94;&#x5BF9;&#x6B64;&#x95EE;&#x9898;&#x3002;&#x9996;&#x5148;&#xFF0C;&#x56E0;&#x4E3A;&#x57FA;&#x4E8E;&#x533A;&#x5757;&#x94FE;&#x7684;&#x6316;&#x77FF;&#x7B97;&#x6CD5;&#xFF0C;&#x81F3;&#x5C11;&#x6BCF;&#x4E2A;&#x77FF;&#x5DE5;&#x4F1A;&#x88AB;&#x8FEB;&#x6210;&#x4E3A;&#x4E00;&#x4E2A;&#x5168;&#x8282;&#x70B9;&#xFF0C;&#x8FD9;&#x4FDD;&#x8BC1;&#x4E86;&#x4E00;&#x5B9A;&#x6570;&#x91CF;&#x7684;&#x5168;&#x8282;&#x70B9;&#x3002;&#x5176;&#x6B21;&#xFF0C;&#x66F4;&#x91CD;&#x8981;&#x7684;&#x662F;&#xFF0C;&#x5904;&#x7406;&#x5B8C;&#x6BCF;&#x7B14;&#x4EA4;&#x6613;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x628A;&#x4E00;&#x4E2A;&#x4E2D;&#x95F4;&#x72B6;&#x6001;&#x6811;&#x7684;&#x6839;&#x5305;&#x542B;&#x8FDB;&#x533A;&#x5757;&#x94FE;&#x3002;&#x5373;&#x4F7F;&#x533A;&#x5757;&#x9A8C;&#x8BC1;&#x662F;&#x4E2D;&#x5FC3;&#x5316;&#x7684;&#xFF0C;&#x53EA;&#x8981;&#x6709;&#x4E00;&#x4E2A;&#x8BDA;&#x5B9E;&#x7684;&#x9A8C;&#x8BC1;&#x8282;&#x70B9;&#x5B58;&#x5728;&#xFF0C;&#x4E2D;&#x5FC3;&#x5316;&#x7684;&#x95EE;&#x9898;&#x5C31;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4E00;&#x4E2A;&#x9A8C;&#x8BC1;&#x534F;&#x8BAE;&#x907F;&#x514D;&#x3002;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x77FF;&#x5DE5;&#x53D1;&#x5E03;&#x4E86;&#x4E00;&#x4E2A;&#x4E0D;&#x6B63;&#x786E;&#x7684;&#x533A;&#x5757;&#xFF0C;&#x8FD9;&#x533A;&#x5757;&#x8981;&#x4E48;&#x662F;&#x683C;&#x5F0F;&#x9519;&#xFF0C;&#x8981;&#x4E48;&#x72B6;&#x6001;S[n]&#x662F;&#x9519;&#x7684;&#x3002;&#x56E0;&#x4E3A;S[0]&#x662F;&#x6B63;&#x786E;&#x7684;&#xFF0C;&#x5FC5;&#x7136;&#x6709;&#x7B2C;&#x4E00;&#x4E2A;&#x9519;&#x8BEF;&#x72B6;&#x6001;S[i]&#x4F46;S[i-1]&#x662F;&#x6B63;&#x786E;&#x7684;&#xFF0C;&#x9A8C;&#x8BC1;&#x8282;&#x70B9;&#x5C06;&#x63D0;&#x4F9B;&#x7D22;&#x5F15;i&#xFF0C;&#x4E00;&#x8D77;&#x63D0;&#x4F9B;&#x7684;&#x8FD8;&#x6709;&#x5904;&#x7406;APPLY(S[i-1],TX[i])  -&gt; S[i]&#x6240;&#x9700;&#x7684;&#x5E15;&#x7279;&#x91CC;&#x590F;&#x6811;&#x8282;&#x70B9;&#x7684;&#x5B50;&#x96C6;&#x3002;&#x8FD9;&#x4E9B;&#x8282;&#x70B9;&#x5C06;&#x53D7;&#x547D;&#x8FDB;&#x884C;&#x8FD9;&#x90E8;&#x5206;&#x8BA1;&#x7B97;&#xFF0C;&#x770B;&#x4EA7;&#x751F;&#x7684;S[i]&#x4E0E;&#x5148;&#x524D;&#x63D0;&#x4F9B;&#x7684;&#x503C;&#x662F;&#x5426;&#x4E00;&#x81F4;&#x3002;</p>
<p>&#x53E6;&#x5916;&#xFF0C;&#x66F4;&#x590D;&#x6742;&#x7684;&#x662F;&#x6076;&#x610F;&#x77FF;&#x5DE5;&#x53D1;&#x5E03;&#x4E0D;&#x5B8C;&#x6574;&#x533A;&#x5757;&#x8FDB;&#x884C;&#x653B;&#x51FB;&#xFF0C;&#x9020;&#x6210;&#x6CA1;&#x6709;&#x8DB3;&#x591F;&#x7684;&#x4FE1;&#x606F;&#x53BB;&#x786E;&#x5B9A;&#x533A;&#x5757;&#x662F;&#x5426;&#x6B63;&#x786E;&#x3002;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x662F;&#x8D28;&#x7591;-&#x56DE;&#x5E94;&#x534F;&#x8BAE;&#xFF1A;&#x9A8C;&#x8BC1;&#x8282;&#x70B9;&#x5BF9;&#x76EE;&#x6807;&#x4EA4;&#x6613;&#x7D22;&#x5F15;&#x53D1;&#x8D77;&#x8D28;&#x7591;&#xFF0C;&#x63A5;&#x53D7;&#x5230;&#x8D28;&#x7591;&#x4FE1;&#x606F;&#x7684;&#x8F7B;&#x8282;&#x70B9;&#x4F1A;&#x5BF9;&#x76F8;&#x5E94;&#x7684;&#x533A;&#x5757;&#x53D6;&#x6D88;&#x4FE1;&#x4EFB;&#xFF0C;&#x76F4;&#x5230;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x77FF;&#x5DE5;&#x6216;&#x8005;&#x9A8C;&#x8BC1;&#x8005;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x5E15;&#x7279;&#x91CC;&#x590F;&#x8282;&#x70B9;&#x5B50;&#x96C6;&#x4F5C;&#x4E3A;&#x6B63;&#x786E;&#x7684;&#x8BC1;&#x636E;&#x3002;</p>
<h2 id="&#x7EFC;&#x8FF0;&#xFF1A;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x5E94;&#x7528;">&#x7EFC;&#x8FF0;&#xFF1A;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x5E94;&#x7528;</h2>
<p>&#x4E0A;&#x8FF0;&#x5408;&#x7EA6;&#x673A;&#x5236;&#x4F7F;&#x5F97;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x4EBA;&#x80FD;&#x591F;&#x5728;&#x4E00;&#x4E2A;&#x865A;&#x62DF;&#x673A;&#x4E0A;&#x5EFA;&#x7ACB;&#x901A;&#x8FC7;&#x5168;&#x7F51;&#x5171;&#x8BC6;&#x6765;&#x8FD0;&#x884C;&#x547D;&#x4EE4;&#x884C;&#x5E94;&#x7528;&#xFF08;&#x4ECE;&#x6839;&#x672C;&#x4E0A;&#x6765;&#x8BF4;&#x662F;&#xFF09;&#xFF0C;&#x5B83;&#x80FD;&#x591F;&#x66F4;&#x6539;&#x4E00;&#x4E2A;&#x5168;&#x7F51;&#x53EF;&#x8BBF;&#x95EE;&#x7684;&#x72B6;&#x6001;&#x4F5C;&#x4E3A;&#x5B83;&#x7684;&#x201C;&#x786C;&#x76D8;&#x201D;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x5BF9;&#x4E8E;&#x591A;&#x6570;&#x4EBA;&#x6765;&#x8BF4;&#xFF0C;&#x7528;&#x4F5C;&#x4EA4;&#x6613;&#x53D1;&#x9001;&#x673A;&#x5236;&#x7684;&#x547D;&#x4EE4;&#x884C;&#x63A5;&#x53E3;&#x7F3A;&#x4E4F;&#x8DB3;&#x591F;&#x7684;&#x7528;&#x6237;&#x53CB;&#x597D;&#x4F7F;&#x5F97;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x6210;&#x4E3A;&#x6709;&#x5438;&#x5F15;&#x529B;&#x7684;&#x66FF;&#x4EE3;&#x65B9;&#x6848;&#x3002;&#x6700;&#x540E;&#xFF0C;&#x4E00;&#x4E2A;&#x5B8C;&#x6574;&#x7684;&#x201C;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x5E94;&#x7528;&#x201D;&#x5E94;&#x8BE5;&#x5305;&#x62EC;&#x5E95;&#x5C42;&#x7684;&#x5546;&#x4E1A;&#x903B;&#x8F91;&#x7EC4;&#x4EF6;&#x3010;&#x65E0;&#x8BBA;&#x662F;&#x5426;&#x5728;&#x4EE5;&#x592A;&#x574A;&#x5B8C;&#x6574;&#x5B9E;&#x65BD;&#xFF0C;&#x4F7F;&#x7528;&#x4EE5;&#x592A;&#x574A;&#x548C;&#x5176;&#x5B83;&#x7CFB;&#x7EDF;&#x7EC4;&#x5408;&#xFF08;&#x5982;&#x4E00;&#x4E2A;P2P&#x6D88;&#x606F;&#x5C42;&#xFF0C;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x6B63;&#x5728;&#x8BA1;&#x5212;&#x653E;&#x5165;&#x4EE5;&#x592A;&#x574A;&#x5BA2;&#x6237;&#x7AEF;&#xFF09;&#x6216;&#x8005;&#x4EC5;&#x6709;&#x5176;&#x5B83;&#x7CFB;&#x7EDF;&#x7684;&#x65B9;&#x5F0F;&#x3011;&#x548C;&#x4E0A;&#x5C42;&#x7684;&#x56FE;&#x5F62;&#x7528;&#x6237;&#x63A5;&#x53E3;&#x7EC4;&#x4EF6;&#x3002;&#x4EE5;&#x592A;&#x574A;&#x5BA2;&#x6237;&#x7AEF;&#x88AB;&#x8BBE;&#x8BA1;&#x6210;&#x4E00;&#x4E2A;&#x7F51;&#x7EDC;&#x6D4F;&#x89C8;&#x5668;&#xFF0C;&#x4F46;&#x5305;&#x62EC;&#x5BF9;&#x201C;eth&#x201D;  Javascript  API&#x5BF9;&#x8C61;&#x7684;&#x652F;&#x6301;&#xFF0C;&#x53EF;&#x88AB;&#x5BA2;&#x6237;&#x7AEF;&#x91CC;&#x770B;&#x5230;&#x7684;&#x7279;&#x5B9A;&#x7684;&#x7F51;&#x9875;&#x7528;&#x6765;&#x4E0E;&#x4EE5;&#x592A;&#x574A;&#x533A;&#x5757;&#x94FE;&#x4EA4;&#x4E92;&#x3002;&#x4ECE;&#x201C;&#x4F20;&#x7EDF;&#x201D;&#x7F51;&#x9875;&#x7684;&#x89D2;&#x5EA6;&#x770B;&#x6765;&#xFF0C;&#x8FD9;&#x4E9B;&#x7F51;&#x9875;&#x662F;&#x5B8C;&#x5168;&#x9759;&#x6001;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x56E0;&#x4E3A;&#x533A;&#x5757;&#x94FE;&#x548C;&#x5176;&#x5B83;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x534F;&#x8BAE;&#x5C06;&#x5B8C;&#x5168;&#x4EE3;&#x66FF;&#x670D;&#x52A1;&#x5668;&#x6765;&#x5904;&#x7406;&#x7528;&#x6237;&#x53D1;&#x8D77;&#x7684;&#x8BF7;&#x6C42;&#x3002;&#x6700;&#x540E;&#xFF0C;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x534F;&#x8BAE;&#x6709;&#x5E0C;&#x671B;&#x81EA;&#x5DF1;&#x5229;&#x7528;&#x67D0;&#x79CD;&#x65B9;&#x5F0F;&#x4F7F;&#x7528;&#x4EE5;&#x592A;&#x574A;&#x6765;&#x5B58;&#x50A8;&#x7F51;&#x9875;&#x3002;</p>
<h2 id="&#x7ED3;&#x8BBA;">&#x7ED3;&#x8BBA;</h2>
<p>&#x4EE5;&#x592A;&#x574A;&#x534F;&#x8BAE;&#x6700;&#x521D;&#x662F;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x901A;&#x8FC7;&#x9AD8;&#x5EA6;&#x901A;&#x7528;&#x7684;&#x8BED;&#x8A00;&#x63D0;&#x4F9B;&#x5982;&#x94FE;&#x4E0A;&#x5951;&#x7EA6;&#xFF0C;&#x63D0;&#x73B0;&#x9650;&#x5236;&#x548C;&#x91D1;&#x878D;&#x5408;&#x7EA6;&#xFF0C;&#x8D4C;&#x535A;&#x5E02;&#x573A;&#x7B49;&#x9AD8;&#x7EA7;&#x529F;&#x80FD;&#x7684;&#x5347;&#x7EA7;&#x7248;&#x5BC6;&#x7801;&#x5B66;&#x8D27;&#x5E01;&#x6765;&#x6784;&#x601D;&#x7684;&#x3002;&#x4EE5;&#x592A;&#x574A;&#x534F;&#x8BAE;&#x5C06;&#x4E0D;&#x76F4;&#x63A5;&#x201C;&#x652F;&#x6301;&#x201D;&#x4EFB;&#x4F55;&#x5E94;&#x7528;&#xFF0C;&#x4F46;&#x56FE;&#x7075;&#x5B8C;&#x5907;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x7684;&#x5B58;&#x5728;&#x610F;&#x5473;&#x7740;&#x7406;&#x8BBA;&#x4E0A;&#x4EFB;&#x610F;&#x7684;&#x5408;&#x7EA6;&#x90FD;&#x53EF;&#x4EE5;&#x4E3A;&#x4EFB;&#x4F55;&#x4EA4;&#x6613;&#x7C7B;&#x578B;&#x548C;&#x5E94;&#x7528;&#x521B;&#x5EFA;&#x51FA;&#x6765;&#x3002;&#x7136;&#x800C;&#x5173;&#x4E8E;&#x4EE5;&#x592A;&#x574A;&#x66F4;&#x6709;&#x8DA3;&#x7684;&#x662F;&#xFF0C;&#x4EE5;&#x592A;&#x574A;&#x534F;&#x8BAE;&#x6BD4;&#x5355;&#x7EAF;&#x7684;&#x8D27;&#x5E01;&#x8D70;&#x5F97;&#x66F4;&#x8FDC;&#xFF0C;&#x56F4;&#x7ED5;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x5B58;&#x50A8;&#xFF0C;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x8BA1;&#x7B97;&#x548C;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x9884;&#x6D4B;&#x5E02;&#x573A;&#x4EE5;&#x53CA;&#x6570;&#x5341;&#x4E2A;&#x7C7B;&#x4F3C;&#x6982;&#x5FF5;&#x5EFA;&#x7ACB;&#x7684;&#x534F;&#x8BAE;&#x548C;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x5E94;&#x7528;&#xFF0C;&#x6709;&#x6F5C;&#x529B;&#x4ECE;&#x6839;&#x672C;&#x4E0A;&#x63D0;&#x5347;&#x8BA1;&#x7B97;&#x884C;&#x4E1A;&#x7684;&#x6548;&#x7387;&#xFF0C;&#x5E76;&#x901A;&#x8FC7;&#x9996;&#x6B21;&#x6DFB;&#x52A0;&#x7ECF;&#x6D4E;&#x5C42;&#x4E3A;&#x5176;&#x5B83;&#x7684;P2P&#x534F;&#x8BAE;&#x63D0;&#x4F9B;&#x6709;&#x529B;&#x652F;&#x6491;&#xFF0C;&#x6700;&#x7EC8;&#xFF0C;&#x540C;&#x6837;&#x4F1A;&#x6709;&#x5927;&#x6279;&#x4E0E;&#x91D1;&#x94B1;&#x6BEB;&#x65E0;&#x5173;&#x7CFB;&#x7684;&#x5E94;&#x7528;&#x51FA;&#x73B0;&#x3002;</p>
<p>&#x4EE5;&#x592A;&#x574A;&#x534F;&#x8BAE;&#x5B9E;&#x73B0;&#x7684;&#x4EFB;&#x610F;&#x72B6;&#x6001;&#x8F6C;&#x6362;&#x6982;&#x5FF5;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E2A;&#x5177;&#x6709;&#x72EC;&#x7279;&#x6F5C;&#x529B;&#x7684;&#x5E73;&#x53F0;&#xFF1B;&#x4E0E;&#x5C01;&#x95ED;&#x5F0F;&#x7684;&#xFF0C;&#x4E3A;&#x8BF8;&#x5982;&#x6570;&#x636E;&#x5B58;&#x50A8;&#xFF0C;&#x8D4C;&#x535A;&#x6216;&#x91D1;&#x878D;&#x7B49;&#x5355;&#x4E00;&#x76EE;&#x7684;&#x8BBE;&#x8BA1;&#x7684;&#x534F;&#x8BAE;&#x4E0D;&#x540C;&#xFF0C;&#x4EE5;&#x592A;&#x574A;&#x4ECE;&#x8BBE;&#x8BA1;&#x4E0A;&#x662F;&#x5F00;&#x653E;&#x5F0F;&#x7684;&#xFF0C;&#x5E76;&#x4E14;&#x6211;&#x4EEC;&#x76F8;&#x4FE1;&#x5B83;&#x6781;&#x5176;&#x9002;&#x5408;&#x4F5C;&#x4E3A;&#x57FA;&#x7840;&#x5C42;&#x670D;&#x52A1;&#x4E8E;&#x5728;&#x5C06;&#x6765;&#x7684;&#x5E74;&#x4EFD;&#x91CC;&#x51FA;&#x73B0;&#x7684;&#x6781;&#x5176;&#x5927;&#x91CF;&#x7684;&#x91D1;&#x878D;&#x548C;&#x975E;&#x91D1;&#x878D;&#x534F;&#x8BAE;&#x3002;</p>
<h2 id="&#x6CE8;&#x89E3;&#x4E0E;&#x8FDB;&#x9636;&#x9605;&#x8BFB;">&#x6CE8;&#x89E3;&#x4E0E;&#x8FDB;&#x9636;&#x9605;&#x8BFB;</h2>
<p><strong>&#x6CE8;&#x89E3;</strong></p>
<ol>
<li>&#x4E00;&#x4E2A;&#x6709;&#x7ECF;&#x9A8C;&#x7684;&#x8BFB;&#x8005;&#x4F1A;&#x6CE8;&#x610F;&#x5230;&#x4E8B;&#x5B9E;&#x4E0A;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#x662F;&#x692D;&#x5706;&#x66F2;&#x7EBF;&#x516C;&#x94A5;&#x7684;&#x54C8;&#x5E0C;&#xFF0C;&#x800C;&#x975E;&#x516C;&#x94A5;&#x672C;&#x8EAB;&#xFF0C;&#x7136;&#x800C;&#x4E8B;&#x5B9E;&#x4E0A;&#x4ECE;&#x5BC6;&#x7801;&#x5B66;&#x672F;&#x8BED;&#x89D2;&#x5EA6;&#x628A;&#x516C;&#x94A5;&#x54C8;&#x5E0C;&#x79F0;&#x4E3A;&#x516C;&#x94A5;&#x5B8C;&#x5168;&#x5408;&#x7406;&#x3002;&#x8FD9;&#x662F;&#x56E0;&#x4E3A;&#x6BD4;&#x7279;&#x5E01;&#x5BC6;&#x7801;&#x5B66;&#x53EF;&#x4EE5;&#x88AB;&#x8BA4;&#x4E3A;&#x662F;&#x4E00;&#x4E2A;&#x5B9A;&#x5236;&#x7684;&#x6570;&#x5B57;&#x7B7E;&#x540D;&#x7B97;&#x6CD5;&#xFF0C;&#x516C;&#x94A5;&#x7531;&#x692D;&#x5706;&#x66F2;&#x7EBF;&#x516C;&#x94A5;&#x7684;&#x54C8;&#x5E0C;&#x7EC4;&#x6210;&#xFF0C;&#x7B7E;&#x540D;&#x7531;&#x692D;&#x5706;&#x66F2;&#x7EBF;&#x7B7E;&#x540D;&#x8FDE;&#x63A5;&#x7684;&#x692D;&#x5706;&#x66F2;&#x7EBF;&#x516C;&#x94A5;&#x7EC4;&#x6210;&#xFF0C;&#x800C;&#x9A8C;&#x8BC1;&#x7B97;&#x6CD5;&#x5305;&#x62EC;&#x7528;&#x4F5C;&#x4E3A;&#x516C;&#x94A5;&#x63D0;&#x4F9B;&#x7684;&#x692D;&#x5706;&#x66F2;&#x7EBF;&#x516C;&#x94A5;&#x54C8;&#x5E0C;&#x6765;&#x68C0;&#x67E5;&#x692D;&#x5706;&#x66F2;&#x7EBF;&#x516C;&#x94A5;&#xFF0C;&#x4EE5;&#x53CA;&#x4E4B;&#x540E;&#x7684;&#x7528;&#x692D;&#x5706;&#x66F2;&#x7EBF;&#x516C;&#x94A5;&#x6765;&#x9A8C;&#x8BC1;&#x692D;&#x5706;&#x66F2;&#x7EBF;&#x7B7E;&#x540D;&#x3002;</li>
<li>&#x6280;&#x672F;&#x4E0A;&#x6765;&#x8BF4;&#xFF0C;&#x524D;11&#x4E2A;&#x533A;&#x5757;&#x7684;&#x4E2D;&#x503C;&#x3002;</li>
<li>&#x5728;&#x5185;&#x90E8;&#xFF0C;2&#x548C;&#x201C;CHARLIE&#x201D;&#x90FD;&#x662F;&#x6570;&#x5B57;&#xFF0C;&#x540E;&#x4E00;&#x4E2A;&#x6709;&#x5DE8;&#x5927;&#x7684;base256&#x7F16;&#x7801;&#x683C;&#x5F0F;&#xFF0C;&#x6570;&#x5B57;&#x53EF;&#x4EE5;&#x4ECE;0&#x5230;2^256-1&#x3002;</li>
</ol>
<p><strong>&#x8FDB;&#x9636;&#x9605;&#x8BFB;</strong></p>
<ol>
<li>Intrinsic value: <a href="https://tinyurl.com/BitcoinMag-IntrinsicValue" target="_blank">https://tinyurl.com/BitcoinMag-IntrinsicValue</a> </li>
<li>Smart property: <a href="https://en.bitcoin.it/wiki/Smart_Property" target="_blank">https://en.bitcoin.it/wiki/Smart_Property</a> </li>
<li>Smart contracts: <a href="https://en.bitcoin.it/wiki/Contracts" target="_blank">https://en.bitcoin.it/wiki/Contracts</a> </li>
<li>B-money: <a href="http://www.weidai.com/bmoney.txt" target="_blank">http://www.weidai.com/bmoney.txt</a> </li>
<li>Reusable proofs of work: <a href="http://www.finney.org/~hal/rpow/" target="_blank">http://www.finney.org/~hal/rpow/</a> </li>
<li>Secure property titles with owner authority: <a href="http://szabo.best.vwh.net/securetitle.html" target="_blank">http://szabo.best.vwh.net/securetitle.html</a> </li>
<li>Bitcoin whitepaper: <a href="http://bitcoin.org/bitcoin.pdf" target="_blank">http://bitcoin.org/bitcoin.pdf</a> </li>
<li>Namecoin: <a href="https://namecoin.org/" target="_blank">https://namecoin.org/</a> </li>
<li>Zooko&#x2019;s triangle: <a href="http://en.wikipedia.org/wiki/Zookos_triangle" target="_blank">http://en.wikipedia.org/wiki/Zookos_triangle</a>&#x2019;</li>
<li>Colored coins whitepaper: <a href="https://tinyurl.com/coloredcoin-whitepaper" target="_blank">https://tinyurl.com/coloredcoin-whitepaper</a> </li>
<li>Mastercoin whitepaper: <a href="https://github.com/mastercoin-MSC/spec" target="_blank">https://github.com/mastercoin-MSC/spec</a> </li>
<li>Decentralized autonomous corporations, Bitcoin Magazine: <a href="https://tinyurl.com/Bootstrapping-DACs" target="_blank">https://tinyurl.com/Bootstrapping-DACs</a> </li>
<li>Simplified payment verification:<a href="https://en.bitcoin.it/wiki/Scalability#Simplifiedpaymentverification" target="_blank">https://en.bitcoin.it/wiki/Scalability#Simplifiedpaymentverification</a> </li>
<li>Merkle trees: <a href="http://en.wikipedia.org/wiki/Merkle_tree" target="_blank">http://en.wikipedia.org/wiki/Merkle_tree</a> </li>
<li>Patricia trees: <a href="http://en.wikipedia.org/wiki/Patricia_tree" target="_blank">http://en.wikipedia.org/wiki/Patricia_tree</a> </li>
<li>GHOST: <a href="http://www.cs.huji.ac.il/~avivz/pubs/13/btc_scalability_full.pdf" target="_blank">http://www.cs.huji.ac.il/~avivz/pubs/13/btc_scalability_full.pdf</a> </li>
<li>StorJ and Autonomous Agents, Jeff Garzik: <a href="https://tinyurl.com/storj-agents" target="_blank">https://tinyurl.com/storj-agents</a> </li>
<li>Mike Hearn on Smart Property at Turing Festival: <a href="http://www.youtube.com/watch?v=Pu4PAMFPo5Y" target="_blank">http://www.youtube.com/watch?v=Pu4PAMFPo5Y</a> </li>
<li>Ethereum RLP: <a href="https://github.com/ethereum/wiki/wiki/%5BEnglish%5D-RLP" target="_blank">https://github.com/ethereum/wiki/wiki/%5BEnglish%5D-RLP</a> </li>
<li>Ethereum Merkle Patricia trees: <a href="https://github.com/ethereum/wiki/wiki/%5BEnglish%5D-Patricia-Tree" target="_blank">https://github.com/ethereum/wiki/wiki/%5BEnglish%5D-Patricia-Tree</a> </li>
<li>Peter Todd on Merkle sum trees:<a href="http://sourceforge.net/p/bitcoin/mailman/message/31709140/" target="_blank">http://sourceforge.net/p/bitcoin/mailman/message/31709140/</a> </li>
</ol>
<hr>
<p><strong>&#x539F;&#x6587;&#x94FE;&#x63A5;:</strong> <a href="https://github.com/ethereum/wiki/wiki/White-Paper" target="_blank">https://github.com/ethereum/wiki/wiki/White-Paper</a>
 <strong>&#x4F5C;&#x8005;:</strong> Vitalik
 <strong>&#x7FFB;&#x8BD1;:</strong> &#x5DE8;&#x87F9;&#x3001;&#x5C11;&#x5E73;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"白皮书","level":"2.1.1","depth":2,"next":{"title":"结约通证（ JYT ）","level":"3.1","depth":1,"ref":"","articles":[{"title":"什么是 JYT ？","level":"3.1.1","depth":2,"path":"jyt/jyt10.md","ref":"jyt/jyt10.md","articles":[]},{"title":"如何获取 JYT 分红？","level":"3.1.2","depth":2,"path":"jyt/jyt20.md","ref":"jyt/jyt20.md","articles":[]},{"title":"如何把 JYT 兑换成 ETH ？","level":"3.1.3","depth":2,"path":"jyt/jyt30.md","ref":"jyt/jyt30.md","articles":[]},{"title":"如何获得 JYT ？","level":"3.1.4","depth":2,"path":"jyt/jyt40.md","ref":"jyt/jyt40.md","articles":[]},{"title":"JYT 的价格算法和机制","level":"3.1.5","depth":2,"path":"jyt/jyt50.md","ref":"jyt/jyt50.md","articles":[]}]},"previous":{"title":"以太坊","level":"2.1","depth":1,"ref":"","articles":[{"title":"白皮书","level":"2.1.1","depth":2,"path":"eth/eth1.md","ref":"eth/eth1.md","articles":[]}]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["fontsettings","sharing","lunr","search","highlight","livereload"],"pluginsConfig":{"fontsettings":{"family":"sans","size":2,"theme":"white"},"sharing":{"all":["facebook","google","twitter","weibo","instapaper"],"facebook":true,"google":false,"instapaper":false,"twitter":true,"vk":false,"weibo":false},"lunr":{"ignoreSpecialCharacters":false,"maxIndexSize":1000000},"search":{},"highlight":{},"livereload":{},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"eth/eth1.md","mtime":"2018-12-28T05:49:55.804Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-12-28T05:58:55.403Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    

    </body>
</html>

